[
  {
    "klass": "sentinel",
    "name": "Bastion",
    "html": "<p>Bastion sentinels are battlefield leaders. They can easily turn the tides by calling out orders, inspiring troops, and synchronizing troop movements.</p>\n",
    "id": "bastion"
  },
  {
    "klass": "vanguard",
    "name": "Battle Master",
    "html": "<p>Battle masters use their barrier to execute unique maneuvers on the battlefield, controlling and harrying enemy forces.</p>\n",
    "id": "battle-master"
  },
  {
    "klass": "tracker",
    "name": "Beast Master",
    "author": "Helios",
    "html": "",
    "id": "beast-master"
  },
  {
    "klass": "adept",
    "name": "Blackstar",
    "html": "<p>Blackstars prefer controlling the battlefield over raw power. They can shape their biotic powers to avoid hurting\nfriends and gain unique benefits to biotic control powers like Lift, Singularity, and Stasis.</p>\n",
    "id": "blackstar"
  },
  {
    "klass": "tracker",
    "name": "Bloodhound",
    "author": "Helios",
    "html": "<p>Nose to the ground, eye on the scanners, ears perked, all senses opened. Focusing on your surroundings, you make sure that whatever target you selected doesn't get away once you have its trail.</p>\n",
    "id": "bloodhound"
  },
  {
    "klass": "adept",
    "name": "Commando",
    "html": "<p>Commandos don't need heavy weapons because they ARE the heavy weapon. Their features improve both the damage potential\nand output of their biotic powers, making them a deadly force.</p>\n",
    "id": "commando"
  },
  {
    "klass": "adept",
    "name": "Disruptor",
    "html": "<p>Disruptors have learned to tap into dark energy, improving biotic abilities that tear apart their adversaries from\nwithin. They also specialize in maintaining powers with intense focus.</p>\n",
    "id": "disruptor"
  },
  {
    "klass": "engineer",
    "name": "Drone Jockey",
    "html": "<p>A drone jockey forms a bond with their mechanical companion, giving it a body, name and increasing its potency on the battlefield.</p>\n",
    "id": "drone-jockey"
  },
  {
    "klass": "soldier",
    "name": "Gladiator",
    "html": "<p>Gladiators are pure-combatants, focused on winning at all costs and being nearly impossible to take down.</p>\n",
    "id": "gladiator"
  },
  {
    "klass": "sentinel",
    "name": "Guardian",
    "html": "<p>Guardians support and buff party members by utilizing different AI packages from their Tech Armor ability and protecting them with their Omni-Shield. They're also one of the most skilled classes, gaining the Expertise feature twice.</p>\n",
    "id": "guardian"
  },
  {
    "klass": "soldier",
    "name": "Havoc",
    "html": "<p>GUNS!!! GRENADES!!! EXPLOSIONS!!!</p>\n",
    "id": "havoc"
  },
  {
    "klass": "sentinel",
    "name": "Juggernaut",
    "html": "<p>Juggernauts are living tanks and nearly impossible to take down. Their tech armor upgrades make sure they can take a hit, or one hundred, without so much as a scratch.</p>\n",
    "id": "juggernaut"
  },
  {
    "klass": "engineer",
    "name": "Mastermind",
    "html": "<p>Masterminds are highly-intellectual and skilled individuals, using strategy and perfectly timed attacks to win in battle.</p>\n",
    "id": "mastermind"
  },
  {
    "klass": "engineer",
    "name": "Medic",
    "html": "<p>The name says it all. As a medic, you'll be one on the field that can dress a wound and get your comrades back into fighting shape.</p>\n",
    "id": "medic"
  },
  {
    "klass": "vanguard",
    "name": "Nemesis",
    "html": "<p>Nemesis vanguards prefer distance and using biotic powers. While they lack the raw power of an adept, they're more crafty and harder to take down.</p>\n",
    "id": "nemesis"
  },
  {
    "klass": "tracker",
    "name": "Outrider",
    "author": "Helios",
    "html": "<p>Your favourite place during battle is on the back of a powerful beast. You rush through underbrush covered jungles and dangerous slippery ice fields with ease and you're always the first into the fray. You and your beast share this ideology of 'Get in, bring the pain, get out.'</p>\n",
    "id": "outrider"
  },
  {
    "klass": "infiltrator",
    "name": "Saboteur",
    "html": "<p>Saboteurs are tech savvy infiltrators that use cloak and dagger tactics to control the outcome of battles.</p>\n",
    "id": "saboteur"
  },
  {
    "klass": "infiltrator",
    "name": "Shadow",
    "html": "<p>Shadow Infiltrators are melee specialists that make heavy use of their tactical cloak and stealth to close the distance between themselves and their target.</p>\n",
    "id": "shadow"
  },
  {
    "klass": "vanguard",
    "name": "Shock Trooper",
    "html": "<p>Shock troopers like to fight up close and personal, using charge to dash around the battlefield and ripping enemies apart with shotgun blasts.</p>\n",
    "id": "shock-trooper"
  },
  {
    "klass": "infiltrator",
    "name": "Sniper",
    "html": "<p>Snipers are ranged specialists that have an affinity for sniper rifles.</p>\n",
    "id": "sniper"
  },
  {
    "klass": "infiltrator",
    "name": "Stalker",
    "author": "Tech Knight",
    "html": "<p>The last of the three factions that took residence within the most dangerous forests of Chasca - the &quot;Night Stalkers&quot; -\nlooked to the location that had the most food and water within a short distance to sustain themselves for\npotentially many generations. The increased challenge of these creatures have given them many avenues to\nimprove their hunting methods, using equipment and stealth to their advantage, up to the point of being able to attack\nand still remain hidden to strike again from the shadows.</p>\n",
    "id": "stalker"
  },
  {
    "klass": "soldier",
    "name": "Weapon Master",
    "html": "<p>Weapon masters train extensively in the art of a single weapon, giving them powerful advantages when using a weapon of that type.</p>\n",
    "id": "weapon-master"
  }
]