[
  {
    "name": "Beguile",
    "threshold": 30,
    "prereq": {
      "paragon": {
        "within": 10
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "dc": {
          "base": 8,
          "proficient": true,
          "mod": "cha",
          "save": "wis"
        }
      }
    ],
    "html": "<p>You can start monologing for up to 1 minute, causing creatures of your choice that you can see within range and that\ncan hear you to make a Wisdom saving throw. Any creature with an Intelligence of 3 or lower succeeds on this\nsaving throw automatically, and if you or your companions are fighting a creature, it has advantage on the\nsave. On a failed save, the target has disadvantage on attack rolls against any creature other than you and\nWisdom (Perception) checks made to perceive any creature other than you until you stop talking or until the\ntarget can no longer hear you. The effect also ends if you are incapacitated or can no longer speak.</p>\n<p>You may use this benefit once per long rest.</p>\n",
    "id": "beguile"
  },
  {
    "name": "Calm Emotions",
    "threshold": 30,
    "prereq": {
      "paragon": {
        "min": 20,
        "greaterThan": "renegade"
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "dc": {
          "base": 8,
          "proficient": true,
          "mod": "cha",
          "save": "cha"
        }
      }
    ],
    "html": "<p>You attempt to suppress strong emotions in a group of people. Each sentient creature (Intelligence 4 more) that can\nhear you must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature\nfails its saving throw, choose one of the following two effects.</p>\n<p>You can suppress any effect causing a target to be charmed or frightened, immediately ending the condition.</p>\n<p>Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This\nindifference ends if the target is attacked or harmed or if it witnesses any of its friends being harmed.\nThe indifference lasts at least 1 minute, unless the GM rules otherwise.</p>\n<p>You may use this benefit once per long rest.</p>\n",
    "id": "calm-emotions"
  },
  {
    "name": "Compel",
    "threshold": 100,
    "prereq": {
      "paragon": {
        "min": 70,
        "greaterThan": "renegade"
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "dc": {
          "base": 8,
          "proficient": true,
          "mod": "cha",
          "save": "wis"
        }
      }
    ],
    "html": "<p>You attempt to compel a sentient creature (Intelligence of 4 or more) that you can see and that can hear you.\nIt must succeed on a Wisdom saving throw or be charmed by you for the next hour. If you or creatures that are friendly\nto you are fighting it, it has advantage on the saving throw.</p>\n<p>While the creature is charmed, you can issue commands to it while you are conscious (no action required), which it\ndoes its best to obey. You can specify a simple and general course of action, such as &quot;Attack that creature,&quot;\n&quot;Run over there,&quot; or &quot;Fetch that object.&quot; If the creature completes the order and doesn't receive further direction\nfrom you, it defends and preserves itself to the best of its ability.</p>\n<p>Each time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds,\nthe spell ends.</p>\n<p>You may use this benefit once per long rest.</p>\n",
    "id": "compel"
  },
  {
    "name": "Convince",
    "threshold": 15,
    "prereq": {
      "paragon": {
        "min": 10,
        "greaterThan": "renegade"
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "roll a d6 and add to a Charisma (Persuasion) check"
      }
    ],
    "html": "<p>When you make Charisma (Persuasion) check, you may roll a d6 and add the number rolled to the result.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "convince"
  },
  {
    "name": "Fear",
    "threshold": 30,
    "prereq": {
      "renegade": {
        "min": 20,
        "greaterThan": "paragon"
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "dc": {
          "base": 8,
          "proficient": true,
          "mod": "cha",
          "save": "wis"
        }
      }
    ],
    "html": "<p>When you make Charisma (Intimidation) check and roll a 9 or lower, you can treat the roll as a 10.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "fear"
  },
  {
    "name": "Frightening Presence",
    "threshold": 100,
    "prereq": {
      "renegade": {
        "min": 70,
        "greaterThan": "paragon"
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "dc": {
          "base": 8,
          "proficient": true,
          "mod": "cha",
          "save": "wis"
        },
        "shortDesc": "For the next hour, creatures that can see you within <me-distance length=\"60\" /> must succeed on a Wisdom saving throw or become frightened."
      }
    ],
    "html": "<p>Your presence can cause even the most battle hardened veterans to quiver. For the next hour when a sentient\ncreature (Intelligence 4 or more) can see you and comes within <me-distance length=\"60\" /> of you, the creature must\nsucceed on a Wisdom saving throw or become frightened. The creature remains frightened while it can see you or is\nwithin <me-distance length=\"60\" /> of you. While frightened by you, the creature must use its movement to move to the nearest safe\nspot from which it can't see you. If the creature moves more than <me-distance length=\"60\" /> from you and can't see you, the creature\nis no longer frightened, but the creature becomes frightened again if it regains sight of you or moves within\n<me-distance length=\"60\" /> of you.</p>\n<p>You may use this benefit once per long rest.</p>\n",
    "id": "frightening-presence"
  },
  {
    "name": "Glibness",
    "threshold": 100,
    "prereq": {
      "paragon": {
        "within": 20
      }
    },
    "mechanics": [
      {
        "type": "action",
        "resource": {},
        "shortDesc": "for the next hour you can replace your Charisma check rolls with a 15 and creatures cannot determine if you are being truthful"
      }
    ],
    "html": "<p>For the next hour, when you make a Charisma check, you can replace the number you roll with a 15. Additionally,\nno matter what you say, effects that would determine if you are telling the truth indicate that you are being truthful.</p>\n<p>You may use this benefit once per long rest.</p>\n",
    "id": "glibness"
  },
  {
    "name": "Matter over Mind",
    "threshold": 60,
    "prereq": {
      "renegade": {
        "min": 40,
        "greaterThan": "paragon"
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "on failed Strength or Dexterity check, reroll and add your Charisma plus the original modifier to the roll"
      }
    ],
    "html": "<p>When you fail an Strength or Dexterity check, you can reroll the die and add your Charisma modifier, in addition\nto the original modifier, to the new roll. You must use the now roll.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "matter-over-mind"
  },
  {
    "name": "Not by my Hand",
    "threshold": 60,
    "prereq": {
      "paragon": {
        "within": 15
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "add your Charisma modifier to another creature's ability check, if it can see or hear you"
      },
      {
        "type": "action",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "when you take the Help action, add your Charisma modifier to the creature's next ability check or attack roll it makes before the start of your next turn"
      }
    ],
    "html": "<p>When another creature that can see or hear you makes an ability check, you may add your Charisma modifier to the roll.\nAlternatively, in combat, whenever you take the Help action, you may add your Charisma modifier to the first attack\nroll or the next ability check the creature you aid makes before the start of your next turn.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "not-by-my-hand"
  },
  {
    "name": "Obfuscate",
    "threshold": 15,
    "prereq": {
      "paragon": {
        "within": 5
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "when you fail a Charisma (Deception) check, reroll the die and use the new roll"
      }
    ],
    "html": "<p>When you fail a Charisma (Deception) check, you can reroll the die, and you must use the new roll.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "obfuscate"
  },
  {
    "name": "Pen before Sword",
    "threshold": 60,
    "prereq": {
      "paragon": {
        "min": 40,
        "greaterThan": "renegade"
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "on failed Intelligence or Wisdom check, reroll and add your Charisma plus the original modifier to the roll"
      }
    ],
    "html": "<p>When you fail an Intelligence or Wisdom check, you can reroll the die and add your Charisma modifier, in addition\nto the original modifier, to the new roll. You must use the now roll.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "pen-before-sword"
  },
  {
    "name": "Presence",
    "threshold": 15,
    "prereq": {
      "renegade": {
        "min": 10,
        "greaterThan": "paragon"
      }
    },
    "mechanics": [
      {
        "type": "other",
        "resource": {
          "max": {
            "type": "mod",
            "value": "cha"
          }
        },
        "shortDesc": "treat a roll of 9 or lower as a 10 on a Charisma (Intimidation) check"
      }
    ],
    "html": "<p>When you make Charisma (Intimidation) check and roll a 9 or lower, you can treat the roll as a 10.</p>\n<p>You may use this benefit between long rests a number of times equal to your Charisma modifier (minimum of once).</p>\n",
    "id": "presence"
  }
]