[
  {
    "species": "prothean",
    "name": "Avatar",
    "html": "<p>The Protheans designated certain people as avatars, or exemplars, of particular virtues: bravery, strength, cunning,\netc. You may pick an Avatar below or create your own using the Creating an Avatar section. Whichever avatar you\nchoose, you gain the Avatar’s Inspiration trait as well.</p>\n<h4>Creating an Avatar</h4>\n<p>Instead of selecting an Avatar, you may choose to create your own, working with your GM and following these guidelines:</p>\n<ol>\n<li>The avatar should have some mechanic for triggering Avatar’s Inspiration</li>\n<li>If the triggering mechanic is likely to only be used once per long rest or less:\n<ul>\n<li>Avatar’s Inspiration should apply to multiple creatures simultaneously (if thematically appropriate)</li>\n<li>+1 to a thematically appropriate ability score</li>\n<li>One additional “minor” trait, such as a skill or tool proficiency, advantage on an uncommon saving throw, etc</li>\n</ul>\n</li>\n<li>If the triggering mechanic is likely to be used once per short rest:\n<ul>\n<li>Avatar’s Inspiration should apply to one creature</li>\n<li>One additional “minor” trait, such as a skill or tool proficiency, advantage on an uncommon saving throw, etc</li>\n</ul>\n</li>\n<li>If the triggering mechanic is likely to be used multiple times per short rest:\n<ul>\n<li>Avatar’s Inspiration should apply to one creature</li>\n<li>No other benefits</li>\n</ul>\n</li>\n</ol>\n",
    "id": "avatar"
  },
  {
    "species": "ardat-yakshi",
    "name": "Disposition",
    "html": "<p>As an Ardat-Yakshi, you choose your character's disposition about this condition. Your disposition affects the\nstrength of your addiction and the abilities you’ve gained from mating.</p>\n",
    "id": "ay-disposition"
  },
  {
    "species": "quarian",
    "name": "Cybernetic Augmentation",
    "html": "<p>Along with their suits, quarians also have extensive cybernetic augmentations integrated into their bodies. When receiving\nyour augmentations, you can choose from the following specializations.</p>\n",
    "id": "cybernetic-augmentation"
  },
  {
    "species": "asari",
    "name": "Life Stage",
    "html": "<p>Asari pass through three climacteric life stages, marked by biochemical and physiological changes. As an asari, you\nchoose which life stage you are in, gaining additional traits based on the stage.</p>\n",
    "id": "lifestage"
  },
  {
    "name": "Military Doctrine",
    "species": "turian",
    "html": "<p>Boot camp begins on the 15th birthday. Soldiers receive a year of training before being assigned to a field unit;\nofficers train for even longer. Most serve until the age of 30, at which they become part of the Reserves. You might be\ncurrently enlisted, a lifer, part of the reserves, or have moved on to other pursuits. Either way, your dogged service\nand commitment to your field unit has made a lasting impact on you. Choose one of the following military doctrines.</p>\n",
    "id": "military-doctrine"
  },
  {
    "species": "geth",
    "name": "Mobile Platform",
    "html": "<p>Your mobile platform is your “body”, a mechanical structure that your consciousness inhabits. The platform provides\nadditional benefits based on its model. You can change your platform provided you have a new platform to inhabit\nand spend 8 hours in an unconscious state as you transfer your programs from one platform to another.</p>\n<v-alert value type=\"info\"><p>Should your platform become damaged beyond repair, the persistence of your consciousness is dependent\non numerous variables, such as the time since your most recent back-up, network availability to a hub,\nand the location(s) of your consciousness’ storage. Work with your GM to decide if your consciousness\nis recoverable and the process in which you will need to be loaded into a new platform.</p>\n</v-alert>",
    "id": "mobile-platform"
  }
]