[
  {
    "layout": "post",
    "title": "How it starts",
    "description": "The origin story or Mass Effect 5e. Learn about how the system germinated.",
    "date": "2017-04-01T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/e/e1/Normandy_Render.png/revision/latest/scale-to-width-down/1000?cb=20120703201556",
    "html": "<p>In early 2017, I began listening to <a href=\"http://www.maximumfun.org/shows/adventure-zone\" target=\"_blank\">The Adventure Zone</a>\nand became intrigued by D&amp;D 5th edition. <!--more--> Quick, tangential shout-out: if I threw in all my favorite books, music, movies,\netc into sorted list, TAZ would rank in the top 10. Seriously, you should be listening to it.</p>\n<p>You're probably wondering, &quot;How is it 2017 and you've not played 5th Edition?&quot;. Well I'm not a very experience TRPG'er.\nUp to this point I'd only gamed within Pinnacle's <a href=\"https://www.peginc.com/product-category/savage-worlds/\" target=\"_blank\">Savage Worlds</a> system.\nSo after a few episodes of TAZ, I got myself a 5e player's handbook and read that mofo cover to cover. What I enjoyed\nmost was the de-emphasis of strategic tabletop battling and the emphasis of creative problem-solving. Plus the simplicity\nof the die rolling was appealing:</p>\n<p><code>D20 + modifying_numbers &gt; target_number ? success : failure</code></p>\n<p>Though the game certainly gets more complicated, the base equation is simple enough for inexperienced players to wrap\ntheir heads around.</p>\n<p>Now, I enjoy a fantasy setting as much as the next nerd, but I'd pick sci-fi over fantasy nine times out of ten. And what's\njust came out? That's right...<a href=\"https://www.masseffect.com/\" target=\"_blank\">Mass Effect: Andromeda</a>. Mass Effect is one of my favorite sci-fi\nuniverses but it's got another key feature: the wizard, i.e., spellcasting. Plus, you have an entire <em>universe</em> to run a\ncampaign. You can focus on space exploration, fighting Reapers, policing the Milky Way, or mixing with the Citadel politics.</p>\n<p>So I got this crazy idea, <em>I want to play a TRPG Mass Effect</em>.\nMy current DM said, &quot;I think there are a few out there already.&quot; And, yeah, I found a few in various states of completion:</p>\n<ul>\n<li>Complete Works\n<ul>\n<li><a href=\"http://masseffectd6.blogspot.com/\" target=\"_blank\">Mass Effect D6</a>, a Star Wars D6 conversion</li>\n<li><a href=\"http://web.archive.org/web/20150629183534/http://masseffectrpg.org/wp/?page_id=51\" target=\"_blank\">Mass Effect Fate RPG</a>, a FATE conversion</li>\n<li><a href=\"https://docs.google.com/file/d/0B5c7osZJmQnvQ09YVHFNaXdSLVk/edit\" target=\"_blank\">Mass Effect d20 system</a>, a OGL d20 conversion</li>\n</ul>\n</li>\n<li>Others\n<ul>\n<li><a href=\"https://wiki.rpg.net/index.php/Mass:_the_Effecting\" target=\"_blank\">Mass: the Effecting</a>, a nWoD conversion</li>\n<li><a href=\"http://www.pegforum.com/viewtopic.php?t=35981\" target=\"_blank\">Mass Effect: Ascension</a>, a Savage Worlds conversion</li>\n<li><a href=\"http://rpgcrank.blogspot.com/p/savage-worlds-mass-effect.html\" target=\"_blank\">Savage Worlds: Mass Effect</a>, Savage Worlds again.</li>\n<li><a href=\"https://destination-zero.obsidianportal.com/wikis/mass-effect-conversion-rules\" target=\"_blank\">A Mass Effect Game for Traveller</a></li>\n</ul>\n</li>\n</ul>\n<p>I even found the beginnings of a <a href=\"https://edster504.wordpress.com\" target=\"_blank\">5e conversion</a>. Perhaps I'm stubborn, or perhaps I'm\na masochist, or perhaps these other options just don't have that 5e flair I crave. No matter the reason, I've take the\nplunge, and that is how it starts.</p>\n",
    "id": "0-0-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 0.1.0-alpha ready!",
    "description": "Classes, races, and spells, oh my! The skeleton of an awesome homebrew.",
    "date": "2017-04-26T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/8/8c/Project_lazarus_-_shep_skeleton_%28after%29.png/revision/latest/scale-to-width-down/640?cb=20140710175851",
    "html": "<p>Version 0.1.0-alpha means this bad boy is just getting started. But it's at a point where I'm ready for the first\nplaytest (scheduled for June 2). Anyone who stumbles upon this site should feel free to play test as well and use whatever\nto start a campaign, but note that things will be a-changin' a lot.</p>\n<p>But in a month, we've come a long way. All the spells, classes, and races are spec'ed out. Though multiple play tests we'll\nneed to work on balancing the system. There's also a lot of unknowns:</p>\n<ul>\n<li>Will the shield mechanic be a pain in the ass to track?</li>\n<li>What about the weapons? Are they too overpowered? Underpowered compared to abilities?</li>\n<li>Should classes be able to cast more or less?</li>\n</ul>\n<p>Already I know that some classes feel less desirable and interesting than others. I worked on the Vanguard and Sentinel last\nso they benefited from a month of learning and refactoring. All the Adept classes seem a little underwhelming, but this might\nbe balanced by their ability to take and cast the most spells.</p>\n<p>But at this point, any changes would be entirely guesswork. So...ONWARD! TO PLAY TESTING!</p>\n",
    "id": "0-1-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "The refactor: So much change, it's basically new",
    "description": "We've overhauled the Mass Effect 5e, making it better than it was before. Better, stronger, faster.",
    "date": "2017-09-10T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/9/9d/Mass_relay_montage.png/revision/latest/scale-to-width-down/640?cb=20141021134527",
    "html": "<p>I randomly decided to checkout the analytics for this site and came across a surprising and exciting find: <em>people are\nvisiting this site!!!</em> It's not a ton of people, averaging ~30 a day. But this conversion seems to be generating interest,\nand that ain't nothing. Thus, I've got a renewed motivation (urgency?) to get some major work done in the next few months.\nAnd thanks to everyone who has taken a gander.</p>\n<p>But first...</p>\n<h1>Playtesting</h1>\n<p>We had 3 players with the following loadouts:</p>\n<ol>\n<li>Drell Marksman Soldier</li>\n<li>Asari Justicar Adept</li>\n<li>Human Saboteur Infiltrator</li>\n</ol>\n<p>We ran a fast-paced session, testing the classes out on creatures,\nmobs I pulled straight from D&amp;D, bosses (a Banshee), and 2 fully spec'ed NPCs (Sentinel &amp; Engineer).\nWe leveled quickly so we could check out the classes at different phases. Specifically, level 5, 9 and 12.\nOverall, the flow, battle mechanics, spells, etc. all had the necessary feel of both ME and D&amp;D. I was excited to see\nthat they melded together nicely. I even started on a bestiary, creating monsters for various Reaper mobs, including\nMarauders, Cannibals, Husks, and a Banshee. If you're so inclined, <a href=\"https://drive.google.com/open?id=19iMxTqyu7Vtyqy3I2-INWwurnXea_YuKzy7HbMZMuXw\" target=\"_blank\">check out my prep notes</a>\nfor the very short campaign. <strong>Note</strong>: we didn't get to Operation Driftwood, and we chose Operation Metal Detector.</p>\n<h2>What's next</h2>\n<p>I've been quietly working on a key aspect of any game system: <strong>balance</strong>. For the past months, I broken ye 'ole spreadsheets,\nworking on class analysis and overhauling the classes.</p>\n<p><strong>Issue 1</strong>: Some classes vastly outperformed others.</p>\n<p><strong>Issue 2</strong>: Classes peaked around level 9, with nominal damage increase beyond level 12.</p>\n<p>I found a D&amp;D class analysis in <a href=\"https://docs.google.com/spreadsheets/d/1JIrEV1RFv6yxWEdqG6zP3z-ZONDTacquGyqYj8G-CdE\" target=\"_blank\">The Optimists' Guide to D&amp;D 5E Damage by Class, Subclass, Weapon, and Level</a>.\nIt gave me a framework to review the ME classes. In doing the work, I also tried to align the classes more closely with\nD&amp;D counterparts. Soldiers became more like Fighters, Adepts like Wizards, Sentinels like Paladins. Other minor updates include\na better variety of weapons stats and improving/standardizing spell text.</p>\n<p>All in all, the next iteration will <em>look</em> similar but be a huge overhaul. Rest assured, I'll be sure to make the current\nversion available on the site, in case anyone is running a campaign.</p>\n<h2>Other things in the works</h2>\n<p>General site fixes, a bestiary, armor, adding new spells, printable spell cards, and adding some sort of &quot;NPC maker&quot;.</p>\n<p>This endeavor is far from over...</p>\n<h2>Shoutout</h2>\n<p>Major thanks to <a href=\"https://github.com/SleightxHope\" target=\"_blank\">SleightxHope</a> for jumping into Github and contributing a ton of ideas.\nBackgrounds, skills, armor, weapon mods, class rewrites! Can't say thanks enough for the collaboration and playtesting!</p>\n<h2>Why so much change?</h2>\n<p>One major issue was that almost all classes peaked around lvl 9. I started using\n<a href=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vTyqV8mnMFzRexQ_pEMnX1-BFRqFt3Jb_uCBjjY3nUdPCMbNT0dXc7Nkd4tIlZlzjv4NuR6xB44Euqd/pubhtml\" target=\"_blank\">spreadsheets</a>\nto track damage progression throughout levels. FYI - Those sheets are sorely\nout of date, as I threw in a plethora of changes last minute. But that's the documentation\nfor how the new classes stack up damage wise. It's really just proof that\nI put in <em>some</em> amount of time trying to balance this system out.</p>\n<p>The other major issue is that I wanted this conversion to reflect D&amp;D 5th Edition\nas much as it could. I'd spent too much time coming up with random abilities and class features\nrather than leaning back on the amazing work WoC does. So, in this iteration, I focused\non taking subclass features from 5e and sticking them in at appropriate levels. There is\nstill plenty of homebrew content, but the classes should have a much more familiar feel than before.</p>\n<h2>Player's Manual</h2>\n<p>To keep things more sustainable, I've completely rewritten the <nuxt-link to=\"/manual/intro\">player's manual</nuxt-link> into a single page webapp. This\npart of the site will now exist to keep people updated on news, play testing, and other miscellaneous items, like printable character sheets\nand spell cards.</p>\n<p><strong>NOTE:</strong> If you see any spelling errors or come across any bugs, please <a href=\"https://github.com/queryluke/masseffect-5e/issues\" target=\"_blank\">add an issue in the repo</a></p>\n<h2>Changes</h2>\n<h3>Rules</h3>\n<p>Mostly clarifications with a few minor updates.</p>\n<h4>Weapons</h4>\n<p><strong>Weapon Handling</strong></p>\n<ul>\n<li>Reloading takes an action</li>\n<li>Holstering and drawing a new weapon is a bonus action</li>\n</ul>\n<p><strong>Weapon Stats</strong></p>\n<ul>\n<li>Made the <strong>Rof &amp; Heat</strong> stat simpler. Instead of subtracting RoF from Heat, heat is now the number of times you\ncan fire the weapon before you need to reload.</li>\n<li><strong>Rare</strong> Weapons. Basically a way of saying lvl 1 PCs shouldn't have access to these weapons.</li>\n</ul>\n<p><strong>Weapon Attributes</strong>\nWeapons now have different types of attributes like &quot;Arc&quot; and &quot;Hip Fire&quot; which give the weapon additional combat perks.</p>\n<p><strong>Removed Hip Fire</strong>\nThe previous version gave all weapons advantage in melee range. Now only Hip Fire weapons have advantage in melee range.\nThe standard D&amp;D rule applies that all other ranged weapons have disadvantage in melee range.</p>\n<h4>Armor</h4>\n<p>Expanded the Armor section. Currently working on pre-made armor sets and armor mods.</p>\n<h4>Consumables</h4>\n<p>It never felt &quot;right&quot; that grenades and ammo powers were &quot;spells&quot;. So I've made them consumables. Consumables\nare kind of like magic items. They have an associated rarity (how often you'll get access to them) and are gone\nonce you use them.</p>\n<p><strong>Medi-gel</strong>\n...has been added. Lets you use a hit die in combat. See Rules &gt; Consumables in the PHB.</p>\n<h4>Skills</h4>\n<p>New Skills: <strong>Engineering</strong>, <strong>Xenology</strong></p>\n<h3>Races</h3>\n<p><strong>Geth</strong>\nI took away a few of the Tech powers that came from geth classes in ME3 Multiplayer mode and made them geth only.\nRepair Matrix and Hunter Mode didn't really make sense for organic creatures. In addition, geth get some really nice\nclass-specific features at level 11. This is to make up for the fact that geth cannot take any feats.</p>\n<p><strong>Quarians</strong>\nRemoved Improvised Grenade and added Cybernetic Augmentation. Read about the latter in the codex and felt the Imp grenade was\nlame.</p>\n<p><strong>Salarains</strong>\nMade Photographic Memory much more powerful, cosidering this is one of the weakest races. Great for Skill Monkeys though!</p>\n<h3>Classes</h3>\n<p>To be honest, so much has changed with the classes, the best I can do is give you an overview of each one. I'm also providing\na % done. By this, I mean how much the class <strong>feels</strong> complete, which should also be an indication of how much it's likely to change\nin the future.</p>\n<h4>General</h4>\n<p><strong>Damage!</strong></p>\n<p>A major issue in the previous iteration was that every class's damage output stopped scaling around level 10. This\nhas been fixed. It also meant implementing a new Max TP system for Engineers, Infiltrators, and Sentinels. Basically, as you\nlevel, you can spend more TP on your Tech Powers.</p>\n<p><strong>Combat Powers</strong></p>\n<p>I added in Combat Powers, which are mechanically like class features (generally only use them once per short/long rest),\nbut give you the customizing feel of spells and tech powers, i.e., you can choose which ones you want. Soldiers choose\nCombat powers as they progress, but Infiltrators can take a few as well instead of learning a tech power. I hope to expand\nthe crossover list further.</p>\n<h4>Adepts</h4>\n<p><strong>90%</strong>\nBrought adepts much more in line with Wizards, borrowing a lot of class and subclass features from D&amp;D.</p>\n<h4>Engineers</h4>\n<p><strong>90%</strong>\nPrimarily worked on the Support subclass, giving it more variety.</p>\n<h4>Infiltrators</h4>\n<p><strong>75%</strong>\nRedistributed and added more of the Rogue features from D&amp;D. Still feels like it could use a little bit more work.</p>\n<h4>Sentinels</h4>\n<p><strong>60%</strong>\nI feel like tech armor changes every time I sit down to do edits. I need to do a lot more playtesting with Sentinels and\nall subclasses before I can put a button in it.</p>\n<h4>Soldiers</h4>\n<p><strong>85%</strong>\nProbably the most drastic overhaul, getting rid of adrenaline dice, reworking the subclasses, adding combat powers,\nand making them progress more like fighters. I'm mostly happy with the outcome.</p>\n<h4>Vanguards</h4>\n<p><strong>75%</strong>\nUpdated subclasses and tried to make them more melee heavy. A mix of Paladins, Barbarians, and Fighters. Could still use\nsome work.</p>\n<h3>Feats</h3>\n<p>Added a new Feat: Grenadier. Hoping to add a few more in the near future.</p>\n<h3>Backgrounds</h3>\n<p>SleightxHope provided all of these. Will try to add more soon.</p>\n<h3>Spells</h3>\n<p>Also major overhauls.</p>\n<p>Well, I think that's everything. This has been a hell of sprint to get all the edits in, but I think it's at a much more stable\nplace where we can slow add new feature and adjust classes. Thanks to anyone out there who is playing!</p>\n",
    "id": "0-2-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Class changes",
    "description": "Rounding out a lot of the Mass Effect 5e classes",
    "date": "2017-10-15T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/6/69/MEA_Soldier_Profile.png/revision/latest/scale-to-width-down/420?cb=20180308081125",
    "html": "<p>Pretty much all changes due, with thanks, to the lore mastery, creativity, and play testing of SleightxHope!</p>\n<h3>Skills</h3>\n<ul>\n<li>Removed Xenology. There was too much crossover between Medicine, History, and Xenology. Medicine is used for organic biology\nchecks (alien or no), history is culture, politics, legends, lore, etc. (alien or no)</li>\n</ul>\n<h3>Races</h3>\n<ul>\n<li>Now have alignments</li>\n</ul>\n<h3>Classes</h3>\n<h3>Engineers</h3>\n<p><strong>Demolisher</strong></p>\n<ul>\n<li>Moved 2nd level Makeshift Grenades from 18 to 14.</li>\n<li>Replaced 14th level talent Targeting Mobility with new, more powerful talent Paint by Number.</li>\n</ul>\n<h4>Infiltrators</h4>\n<p><strong>Shadow</strong></p>\n<ul>\n<li>Deadly Strike renamed Up Close and Personal, moved to 2nd level.</li>\n<li>Melee Specialist replaced with Silent Cloak. Moved to 9th level. Aligns with Supreme Sneak from D&amp;D PHB.</li>\n<li>Tactical Ambush moved to Shadow subclass at the 14th level.</li>\n</ul>\n<p><strong>Operative</strong></p>\n<ul>\n<li>Complete rework, all new skillz!</li>\n</ul>\n<h4>Sentinels</h4>\n<p><strong>Battlemaster</strong></p>\n<ul>\n<li>Renamed to Overwatch, with a focus on managing the battlefield. Quality justification from SleightxHope, &quot;Think of\nMiranda Lawson, who is effectively a Sentinel without tech armor. She's a leader, giving orders from the front ... a\nSentinel subclass that uses superior Heads Up Display tech to give the Sentinel a tech aura that lets them give split-second\ntactical info to their allies (Help action).&quot;</li>\n<li>Using a variety of Rogue features plus new tactically oriented features.</li>\n<li>Battlemaster provides advanced option selection with all Tech/Biotics at the 10th level.</li>\n</ul>\n<h4>Soldiers</h4>\n<p><strong>General</strong></p>\n<ul>\n<li>Soldiers advance their fighting style 9th level.</li>\n</ul>\n<h4>Vanguards</h4>\n<p><strong>Slayer</strong></p>\n<ul>\n<li>Replace Melee Specialist with Biotic Bull Rush.</li>\n</ul>\n<h3>Feats</h3>\n<ul>\n<li>A plethora of new feats!</li>\n<li>Melee Specialist removed form the Vanguard and Infiltrator Progression. Added as a feat.</li>\n</ul>\n<h3>Spells</h3>\n<ul>\n<li>Charge is now a spell attack, rather than a saving throw. Removed the shield regen mechanic and added it as a special\nfeature of the new Vanguard class feature: Biotic Bull Rush.</li>\n</ul>\n",
    "id": "0-2-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 0.3.0 - Weapon Update",
    "description": "The weapons have been aligned with Mass Effect 1, 2, & 3 weapon stats",
    "date": "2017-11-17T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/a/ad/ME1_Assault_Rifle_Expert.png/revision/latest?cb=20120309174857",
    "html": "<h2>Weapon Refactor</h2>\n<p>In a pre-version 1 iteration that was never published, the weapons stats were mapped from the <a href=\"http://masseffect.wikia.com/wiki/Weapons#Mass_Effect_3\" target=\"_blank\">ME3 weapon stats</a>.\nThen I did a lot of tinkering to add some variety to the weapons, but in doing so, I screwed everything up and made many weapons way to powerful.</p>\n<p>This refactor attempts to bring the weapons back in line to their stats, as well as add any additional effect the weapon had in-game.\nFor example, the <a href=\"http://masseffect.wikia.com/wiki/M-37_Falcon\" target=\"_blank\">M-37 Falcon</a> is essentially a grenade launcher, but there was nothing in\nthis system that mirrored that mechanic. Now it has:</p>\n<pre><code>Instead of making a ranged weapon attack, the target makes a Dexterity saving throw (DC 8 + DEX modifier). If you are\nproficient with Assault Rifles, add your proficiency bonus to the DC. On a failed save, the target takes 1d8 thunder damage, or half as much on a successful one.\n</code></pre>\n<p>Damage was also scaled back, but not too much. Originally, the conversion was that all &quot;automatic&quot; weapons had a 5-6 Rate of Fire(RoF), but 5-6 damage die is A LOT.\nShotguns also had a high RoF accounting for the amount of bullets in a single blase, which created ambiguity between fire rate and bullet count.\nThree-round burst weapons has 3, Semi-auto has 2, and there were a few single shot, like sniper rifles. This also created a very large\nspread on the damage tables.</p>\n<p>In the refactor, there is a new weapon type: &quot;Semi-automatic&quot;. By default these only have an RoF of 1, but you can use your bonus\naction to fire another shot. This makes the standard D&amp;D 5e dual wielding mechanic more accessible, i.e., if you've got a\nsemi-automatic weapon, you can make a second attack as a bonus action.</p>\n<p>Three-round burst weapons have an RoF of 3, and automatic and RoF of 4, with a few minor exceptions for weapons that had\nridiculously higher RoFs in the game like the Tempest SMG and a few Heavy Weapons.</p>\n<p>The end result is more generalized weapons by type that have enough variety in range, heat, and mechanic to make your choice fun:</p>\n<ul>\n<li>Assault Rifles: Vary more than any other weapon type but are generally automatic with lower heat and a medium range</li>\n<li>Heavy Pistols: Semi-automatic, light, with high heat and medium range</li>\n<li>Shotguns: Short range power houses with low heat but a variety of punch.</li>\n<li>SMGs: Short range, high RoF, low damage.</li>\n<li>Sniper rifles: Long range &amp; high damage with limited RoF and Heat.</li>\n</ul>\n<p>Rare weapons have an increased cost (20k credits). This should make them unattainable to low level players and\ngives them a monetary cost to their awesomeness. Obviously, GMs can adjust cost to their needs.</p>\n<p>And finally, this version includes new melee weapons!</p>\n<p>Melee weapon attributes work exactly like their D&amp;D 5e counterparts (finesse, light, thrown, versatile, reach, etc). Most weapons have a special\nability as well. However, to replace the &quot;proficiency&quot; aspect of melee weapons (since there are so few), there is a STR requirement.\nAnyone can wield a melee weapon, but if you don't have the required STR mod (matching or above) your melee attacks with the weapon are\nmade at a disadvantage.</p>\n<h2>New Spells</h2>\n<p>A host of new spells and tech powers have been added. Primarily these were based on 5th edition, adding a bit more variety\nthan simple damage dealing abilities, and adding more options for Vanguards and Sentinels.</p>\n<h2>Spell damage</h2>\n<p>With a few exceptions, damage for all damage dealing biotic spells have been adjusted to fit the following criteria:</p>\n<ul>\n<li>Cantrips: &lt; 10 avg damage</li>\n<li>1st Level: 10-15 avg damage</li>\n<li>2nd level: 15 - 22 avg damage</li>\n<li>3rd level: 20 - 28 avg damage</li>\n<li>4th level: 25-35 avg damage</li>\n</ul>\n<p>This change was made to add a bit more scaling to the spells, as 4th level spells are effectively 6-7th level D&amp;D spells.</p>\n<h2>Class changes</h2>\n<p>A few class changes, primarily in name. Vanguards received some tweaking. Cabals are a very specific Turian Vanguard,\nso it didn't make much sense for them to be a subclass. Thus, Cabals have become Nemesis vanguards, a caster-oriented flavor.</p>\n<h2>New Race</h2>\n<p>Unshackled AI, a slight variant from Geth. Are you a rogue AI or a corporate masterpiece? You can decide with this versatile new race.</p>\n<h2>Changelog</h2>\n<h3>Weapons</h3>\n<p>New weapon type: Semi-automatic\nWhen you make a ranged attack with this weapon, you can use your bonus action to make a second ranged attack. You do not add your Dexterity\nmodifier to the attack or damage roll. The second attack may be on the same or a different target.</p>\n<p>Added melee weapons.</p>\n<h3>Feats</h3>\n<ul>\n<li>New Feat: Hair Trigger, gives you an advantage when using semi-automatic weapons.</li>\n</ul>\n<h3>Classes</h3>\n<h4>Class Features</h4>\n<ul>\n<li>Removed the &quot;Up close and personal&quot; fighting style.</li>\n<li>Added the &quot;Carnage&quot; fighting style, which specifically buffs shotgun use.</li>\n</ul>\n<h4>Engineer</h4>\n<ul>\n<li>Renamed &quot;Kamakaze drone&quot; to &quot;Disruptor drone&quot;, more in line with <a href=\"http://masseffect.wikia.com/wiki/Disruption_Drone\" target=\"_blank\">the game</a>.</li>\n<li>Renamed &quot;Support&quot; sublcass to &quot;Medic&quot;, more in line with <a href=\"http://masseffect.wikia.com/wiki/Engineer#Class_Talent\" target=\"_blank\">the game</a></li>\n<li>Added some additional subclass features to the Demolisher. It was lacking in combat potential until later levels.</li>\n</ul>\n<h4>Vanguard</h4>\n<p><strong>Cabal</strong>\nCabal reworked and renamed to Nemesis.</p>\n<ul>\n<li>Nightshade blades is now a combat power available to Vanguards, Infiltrators, and Soldiers</li>\n<li>Poison Strike was removed and the mechanic added as an advancement option for Charge.</li>\n<li>Metabiotics added, allowing you to spend barrier ticks to enhance your spells.</li>\n<li>Vengeance added. Dying in battle may not be a bad idea...</li>\n</ul>\n<p><strong>Slayer</strong>\nSlayer renamed to Shock Trooper, to better reflect <a href=\"http://masseffect.wikia.com/wiki/Vanguard#Class_Talent\" target=\"_blank\">the game</a></p>\n<ul>\n<li>\n<p>Biotic Bull Rush was revamped slightly, giving the aspects of the Charger feat when using Charge.</p>\n</li>\n<li>\n<p>Champion renamed to Battle Master to better reflect its D&amp;D counterpart.</p>\n</li>\n</ul>\n<h4>Sentinel</h4>\n<ul>\n<li>Removed 4th level spell slots from the progression table. Reflects that Sentinels are the least powerful of the biotic classes.</li>\n<li>Battle Master renamed to Mastermind, to better reflect their mastery of tactical situations.\n<ul>\n<li>Battle Master feat renamed to Tactical Advantage</li>\n</ul>\n</li>\n<li>Paladin renamed to Guardian to better reflect the feature set (auras that guard allies).</li>\n</ul>\n<h3>Spells &amp; Powers</h3>\n<ul>\n<li>Carnage renamed to &quot;Beehive&quot;. Carnage is now a fighting style.</li>\n<li>Neural Shock updated, now a creature hit by neural shock can take reactions until the start of its next turn.</li>\n<li>Flare and Dominate changed to level 4 and Singularity changed to level 3 to better reflect the required biotic control.</li>\n<li>Damage rescaled on most biotic spells.</li>\n</ul>\n<h4>New Spells &amp; Powers</h4>\n<p><strong>Tech</strong></p>\n<ul>\n<li>Snap Freeze</li>\n<li>Salvo</li>\n<li>Guidance</li>\n<li>Poison Spray</li>\n<li>Shocking Grasp</li>\n<li>Target Painting</li>\n<li>Unity</li>\n<li>Counterspell</li>\n</ul>\n<p><strong>Biotic</strong></p>\n<ul>\n<li>Biotic Wall</li>\n<li>Storm</li>\n<li>Backlash</li>\n<li>Catapult</li>\n<li>Alter Center Mass</li>\n<li>Fly</li>\n</ul>\n<p><strong>Combat</strong></p>\n<ul>\n<li>Fortification</li>\n</ul>\n",
    "id": "0-3-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 0.4.0 - Armor Sets & Mods",
    "description": "Armor sets added. Biotic and Tech power damage has been increased. And we've got a new way for you to get involved",
    "date": "2017-12-31T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/3/3f/Thessia_ground_assault.png/revision/latest/scale-to-width-down/640?cb=20130517150006",
    "html": "<h2>General</h2>\n<p>Overall, <a href=\"https://github.com/Swampson\" target=\"_blank\">Swampson</a> has helped me fix my wording can clarify a lot of rules that didn't make sense\nor were ambiguous. I'm deputizing him at the official &quot;Copy Editor&quot; of this project, whether he likes it or not.</p>\n<h3>Encumbrance &amp; Carry Capacity</h3>\n<p>Bringing this rule in line with 5th Edition. Lifting and Carrying rules added. Includes a limit on number of weapons you may carry\nand armor matrix has minimum strength scores. In addition, an Encumbrance Variant rule is added that uses weapon &amp; armor weight.</p>\n<h2>Armor Sets</h2>\n<p>A big addition in 0.4.0 is the pre-made Armor Sets. They're cheaper than creating custom armor, but lack the ability to be customized.</p>\n<h2>Armor Mod Overhaul</h2>\n<p>I've finally rounded out and standardized the the available armor mods. In addition, there are also detailed instructions\nfor creating armor mods in the armor rules section. So feel free to create your own!</p>\n<h2>Feedback form</h2>\n<p>And finally, I've added a <a href=\"https://goo.gl/forms/3wZj8QhlsLv3XOJw1\" target=\"_blank\">Google Form</a> so anyone can provide feedback without having to make a Github account.</p>\n<h2>Starting equipment</h2>\n<p>Due to the addition to the armor sets, each race also has a starting weapon and armor. Each race has the option of rolling for credits to buy their own equipment.\nEvery die count/die type combination averages to about 25,000 credits. But based on lifespan, you may get roll more or less die.\nThe reasoning is that long-lived (asari, krogan) races have a higher chance to be average in their monetary gains . Whereas, short-lived\nraces (salarians, vorcha) have a higher probability of either being in their peak or low of their monetary gains. Since it's just\na starting roll, it shouldn't effect gameplay too much. It was a nice way to factor in that flavor. The only exceptions are Volus, who only start with money\nand Geth/Unshackled AI, who effectively don't need to purchase armor, so start with less.</p>\n<h2>Weapons</h2>\n<ul>\n<li>&quot;Semi-Automatic&quot; renamed to &quot;Double Tap&quot;</li>\n</ul>\n<h2>Classes</h2>\n<p>Updates saving throws:</p>\n<ul>\n<li>Adept: CON &amp; CHA =&gt; WIS &amp; CHA</li>\n<li>Sentinel: WIS &amp; CHA =&gt; CON &amp; CHA</li>\n<li>Vanguard: CON &amp; STR =&gt; WIS &amp; STR</li>\n</ul>\n<h3>Engineers</h3>\n<ul>\n<li>Demolisher's Advanced Weapon Holsters reworded to account for new weight/encumbrance rules</li>\n</ul>\n<h2>Races</h2>\n<h3>Geth &amp; Unshackled AI</h3>\n<p>Composite plating updated, now AC is 13 + DEX modifier.</p>\n<h3>Quarians</h3>\n<p>Cybernetic Augmentation reworded to account for new weight/encumbrance rules</p>\n<h3>Salarians</h3>\n<p>Added amphibious trait\nPhotographic memory changed. Instead of advantage in multiple skills, gain expertise in one skill.</p>\n<h3>Krogan</h3>\n<p>Removed the option to be an Engineer.</p>\n<h2>Spells</h2>\n<ul>\n<li>Biotic modifier is based on your Wisdom score.</li>\n<li>Tech modifier is based on your Intelligence score.</li>\n<li>Sentinels use both biotic and tech modifiers.</li>\n</ul>\n<h3>Biotic</h3>\n<p>The major changes to be aware of is the increase to biotic spell damage. I goofed in my previous version and WAY\nundercut the power of the spells. Now the average spell damage should align to the following: <strong>Level</strong>,<code>Single Target Dmg</code>,<code>AoE Dmg</code></p>\n<ul>\n<li><strong>Cantrip</strong>: <code>5.5</code>, <code>3.5</code></li>\n<li><strong>1st-lvl</strong>: <code>13.5</code>, <code>10.5</code></li>\n<li><strong>2nd-lvl</strong>: <code>30</code>, <code>22.5</code></li>\n<li><strong>3rd-lvl</strong>: <code>49.5</code>, <code>33</code></li>\n<li><strong>4th-lvl</strong>: <code>63</code>, <code>43.5</code></li>\n</ul>\n<p>The reason for the changes, is that a 4th level spell is effectively an 7th/8th level spell in 5th edition.</p>\n<ul>\n<li>Annihilation Field\n<ul>\n<li>Damage increased 6d8 =&gt; 12d6</li>\n</ul>\n</li>\n<li>Catapult\n<ul>\n<li>Damage increased 3d8 =&gt; 3d10</li>\n</ul>\n</li>\n<li>Charge\n<ul>\n<li>Hits multiple targets</li>\n<li>Poison Strike =&gt; Necrotic strike. No longer causes poisoned effect. Deal more damage in a line.</li>\n<li>Tremor =&gt; Distance. Increases radius of impact</li>\n</ul>\n</li>\n<li>Dark Channel\n<ul>\n<li>Damage increased d6/d8 =&gt; d10/d12</li>\n<li>Improved Duration =&gt; Cripple. As a reaction, reduce target's attack roll or saving throw</li>\n</ul>\n</li>\n<li>Dark Sphere\n<ul>\n<li>Damage increased 3d8 =&gt; 6d8</li>\n</ul>\n</li>\n<li>Flare\n<ul>\n<li>Damage increased d10 =&gt; d12</li>\n</ul>\n</li>\n<li>Lance\n<ul>\n<li>Damage increased 2dx =&gt; 3dx</li>\n</ul>\n</li>\n<li>Phase Disruptor</li>\n<li>Damage increased 1d8/d12 =&gt; 3d4/d6</li>\n<li>Reave\n<ul>\n<li>Damage decreased 2d12 =&gt; 2d10</li>\n</ul>\n</li>\n<li>Slam</li>\n<li>Damage adjusted, 2d8/d12 + biotic modifier (instead of 1d8/d12 + 2 * biotic modifier)</li>\n<li>Storm\n<ul>\n<li>Damage increased 8d6 =&gt; 8d10</li>\n</ul>\n</li>\n<li>Throw\n<ul>\n<li>Damage increased d4/d6 =&gt; d6/d8</li>\n</ul>\n</li>\n<li>Vortex\n<ul>\n<li>Damage increased 4d10/d12 =&gt; 12d4/d6</li>\n</ul>\n</li>\n<li>Warp\n<ul>\n<li>Damage increased d6 =&gt; d10</li>\n<li>Poison =&gt; Keel Over. Chance to stun target.</li>\n</ul>\n</li>\n</ul>\n<h3>Combat</h3>\n<ul>\n<li>Ballistic Blades\n<ul>\n<li>Damage decreased 6d6 =&gt; 2d12</li>\n<li>Scaling damage added</li>\n</ul>\n</li>\n<li>Beehive\n<ul>\n<li>Damage decreased 2d10 =&gt; 2d6</li>\n<li>Scaling damage added</li>\n</ul>\n</li>\n<li>Concussive Shot\n<ul>\n<li>Damage decreased d10 =&gt; d8</li>\n<li>Blinding shot =&gt; Improved shot. Increases damage to d12</li>\n</ul>\n</li>\n<li>Havok Strike\n<ul>\n<li>Damage decreased 3d12 =&gt; 2d8</li>\n<li>Scaling damage added</li>\n</ul>\n</li>\n<li>Hawk Missile Launcher\n<ul>\n<li>Damage decreased 3d10 =&gt; 3d6</li>\n<li>Scaling damage added</li>\n<li>2 charges per long rest</li>\n</ul>\n</li>\n<li>Nightshade Blade\n<ul>\n<li>Secondary poison damage added</li>\n<li>Scaling damage added</li>\n</ul>\n</li>\n<li>Siege Pulse\n<ul>\n<li>Damage reduced 2d10 =&gt; 2d4</li>\n</ul>\n</li>\n</ul>\n",
    "id": "0-4-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.4.1 - Minor changes",
    "description": "Minor adjustments to Mass Effect 5e version 0.4.0",
    "date": "2017-01-09T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/a/af/Barrage_Upgrade.png/revision/latest?cb=20120721064359",
    "html": "<p>Additional changes marked for 0.4.0 that didn't make it in.</p>\n<ul>\n<li>Krogan Warhammer was way too powerful to use as a starting weapon. Damage &amp; Min Str decreased. Chance to stun on available for unprotected enemies.</li>\n<li>Starting credits reduced.</li>\n<li>Riot Shield added</li>\n</ul>\n",
    "id": "0-4-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Grunt Generator",
    "description": "Infinite NPCs! Our generator can spits out millions of unique NPC combinations",
    "date": "2018-01-20T00:00:00.000Z",
    "image": "https://data.n7.world/images/misc/grunts_cropped.png",
    "html": "<p>Some minor rule changes and clean-up based on a play test 1/13/18</p>\n<h2>Armor</h2>\n<p>The starting armor was very over powered, so 'standard' armor has been added for level 1 characters. In addition, some\narmor set prices have been increased.</p>\n<h2>Classes</h2>\n<p>The Extra Attack feature said it required a short rest between uses. This was a 'misprint'.</p>\n<h3>Soldier</h3>\n<ul>\n<li>Weapon Master: Strafe moved to 7th level. Attack as a bonus action, not free action.</li>\n<li>Weapon Master: Quick reload changed to Devastating Critical, gained at 15th level.</li>\n</ul>\n<h3>Engineer</h3>\n<ul>\n<li>Max Tech Point progression increased</li>\n<li>Drones last one minute. Clarification about attack bonuses made. AC differs per drone</li>\n<li>Medic: Healing drone's healing done increases like cantrips (in-line with all other drones), but you gain additional stats at 14th level.</li>\n<li>Drone Jockey: New feature Improved Drones.</li>\n<li>Drone Jockey: Feature progression rearranged: Dual Drones @ 7th level. Improved drones @ 10th level.</li>\n</ul>\n<h3>Infiltrator:</h3>\n<p>Sneak attack doesn't need advantage if target is flanked.</p>\n<h2>Spells</h2>\n<ul>\n<li>Barrier is an Action, with bonus action as available advancement. It was too easy to use all your Barrier Ticks for an attack,\nthen cast it as a bonus action at the end of your turn for defense. While we like this possibility, it shouldn't be available right\noff the bat.</li>\n</ul>\n<h2>Grunt Generator</h2>\n<p>For the past month, I've been quietly working on the bestiary. For people who've read the DMG or used it to create monsters,\nyou'll know it can be a complicated process. That's not a complaint. I love the details and thoroughness provided by WoC.\nBut it means that creating really good monsters takes time.</p>\n<p>My initial tentative list included a lot of archetypes. Not simply an archetype for each class, but archetypes that could span Challenge Rating (CR),\nraces, classes, etc. But while working on the archetypes, I was repeating a ton of work. The silver lining was that I\nrealized many of these archetypes could be 1) programmatically created and 2) randomized.</p>\n<p>This led me to designing a utility that could generate archetypes with random stats, features, and actions. I call it\nthe &quot;Grunt Generator.&quot; No, this isn't a <em>Home Improvement</em> reference. A &quot;grunt&quot; is a throwaway NPC. It's not as specific\nor unique as a monster, but it doesn't have the time and effort of a reoccurring or important NPC (like a boss or rival team).\nUsing the monster creation logic in the DMG, I created a very complex, programmatic &quot;flowchart.&quot; It adjusts\nattack bonus, defensive bonuses, and damage per round based on the chosen CR level. This ensures that the generated grunts aren't too powerful or too weak.</p>\n<p>Another benefit this utility brings is variety. With Wizard's Monster Manual, Volo's Guide, and the plethora of other books in existence,\nthere are hundreds if not thousands of monsters to choose from. I could spend years working on Mass Effect monsters and not come close\nto the amount provided in D&amp;D. So I took a short cut. The randomized stats, class, race, features, spells, tech\nand weapons means the number of unique grunts totals in the tens of thousands!</p>\n<p>Finally, a hidden benefit I hadn't planned for was loot. Because the weapons that a grunt has equipped are\nrandomized, when players take out a grunt, they can loot the body. This makes it really easy to pass out new weapon options\nto your players. Armor isn't a part of the grunt generator (yet?), so you'll still need to decided if there is any armor to\nloot. But at least the weapons are easy!</p>\n<p>In the Player's Manual, you'll find a new section, &quot;For GMs&quot;. In the future, I hope to fill this with other utilities,\nbut for now you can use the Grunt Generator. Pick you target CR, class, and race get generating! You can save the generated\ngrunt and make a list for your encounters. I'm eventually going to turn the list into a true encounter\nutility, which will let you pull in monsters from the bestiary. I've also got plans to improve the Grunt Generator,\nlike advanced options to let you tailor you grunts a bit more.</p>\n<p>Please note, I'm still working on the bestiary. Hopefully this new feature will keep your campaigns active and fun until\nI can get an official bestiary up. And don't be afraid to use monsters available in D&amp;D, this is a large universe!</p>\n",
    "id": "0-4-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.5.0 - Finally a few monsters",
    "description": "Bestiary drops with Reaper and collector forces. Shield mechanics refactored and some site enhancements",
    "date": "2018-02-26T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/8/89/Derelict_reaper_-_altar_huskathon.png/revision/latest/scale-to-width-down/640?cb=20140712153831",
    "html": "<h2>General</h2>\n<ul>\n<li>Reloading updated. Players may attempt to reload as a bonus action.</li>\n<li>Primer and Detonator rules added as variant rule.</li>\n</ul>\n<h3>Thermal Clips</h3>\n<ul>\n<li>New thermal clips added: Drill, Explosive, Phasic</li>\n<li>Thermal clip mechanics changed to account for addition of primer and detonators.</li>\n</ul>\n<h3>Armor Mods &amp; Sets</h3>\n<p>Armor or mods that granted an increase in shield regen die type, now increase shield regen by 5.\nArmor sets that had +shield points, have the total shields and regen amount listed.</p>\n<h3>Shields</h3>\n<ul>\n<li>Shields\n<ul>\n<li>Flat temporary HP that no longer increase with level</li>\n<li>Gained from armor and items, not inherent to the player character</li>\n<li>Regenerate fully on a short/long rest</li>\n<li>Regenerate in combat if the player takes the Dodge or Hide action then takes no damage until the start of the player's next turn.</li>\n</ul>\n</li>\n</ul>\n<p>Something that's been nagging me for some time is the shield mechanic. The idea was this: shields make up half of a\nplayer's health and slowly regenerate if they don't take damage. Sounds great, right? But a simple, great sounding idea\ncan get complicated quickly. The first major hurdle was divvying up player health. Trying to 'split dice' resulted in\na total health pool about 10% higher than in 5th edition. When I factored in the average rate of shield\nregen the increase jumped to more than 25% higher.</p>\n<p>More importantly, rolling each turn to get shields back wasn't very exciting and took up a lot of time. Each round of\ncombat, players had to think: <em>did I take damage? I didn't...</em> [rolls dice] <em>...oh, goody, 2 sp I need track</em>. I found\nthat players actively choose <em>not</em> to roll because they didn't really care for the benefit.</p>\n<p>The final problem was the mechanic didn't fit the fiction. What happens when a player removes their armor? Do they still have shields?\nWhat is the underlying effect that causes you to gain more shields when you level up?</p>\n<p>Through discussions with Swampson, we cam up with an alternative that we believe fixes all of these problems:</p>\n<ol>\n<li>Shields no longer level up with the character.</li>\n<li>Shields are a small regenerating pool of temporary hp.</li>\n<li>Shields come standard in all chest armor pieces, with a base of 5 shield points and a regen of 5. Both can be increased with mods.</li>\n<li>Shields only recharge an amount equal to their regen when the character takes the Hide or Dodge action and then takes no damage until the start of their next turn.</li>\n</ol>\n<p>#1 &amp; #2 fix the health and fiction issues. But I'm especially excited about #3. The idea of hiding or dodging to recharge\nyour shields is a great reflection of Mass Effect combat. Plus, the reward has more potential for the player. Although, 5 additional\nhit points doesn't sound like a lot, it is for a level 1 character wearing standard armor, and as players level up they can\nget upwards of 30-40 shield points via upgrading their armor. What I really enjoy is that players now have an\nactive choice in regaining shields, but there is still some luck involved.</p>\n<p>Mechanically, I'm also a fan of how well this mechanic blends with the existing 5th edition rules. Instead of a more\ncomplex set of hp, shields are akin to a cantrip that provides temporary hp. The increase in health isn't too much to break\nthe system, but enough to help mitigate the lack of healing spells.</p>\n<p>If you've got any thoughts on this change, feel free to use the <a href=\"https://goo.gl/forms/3wZj8QhlsLv3XOJw1\" target=\"_blank\">feedback form</a>.</p>\n<h2>Spells &amp; Powers</h2>\n<p>Any spell effect that had a player 'gain shield points', now only effects players wearing armor.</p>\n<ul>\n<li>Annihilation Field: <strong>Drain</strong> option replaced with <strong>Phasic</strong>, which bypasses shields.</li>\n<li>Shocking touch: <strong>Absorbing Shock</strong> option replaced with <strong>Reach</strong>, increasing the range of the power.</li>\n<li>Siege Pulse: Shield point cost reduced to 5.</li>\n</ul>\n<h2>Races</h2>\n<h3>Geth</h3>\n<ul>\n<li>Hunter Mode: No longer reduces shields. Movement increase reduced to 2m, attack bonus reduced to +1. Soldier class bonus reduced to only necrotic and force damage resistance.</li>\n</ul>\n<h2>Bestiary</h2>\n<p>Collector forces added.\nReaper forces added (excluding Reaper Destroyers and Reaper Capital Ships).</p>\n<p>As mentioned in my previous post, I've still been working on the bestiary. My goal is 100 unique monsters and npcs by the end\nof April (no promises!). For now, I am happy to be able to give you the Reaper and Collector forces. Before you get too excited,\nno, this does not include a Reaper. That's a task that will take extensive play testing. But, with the random grunt generator,\nI hope this is enough to get you started on a fun campaign. From here on out, instead of a huge drop in April, I'll add\nfactions as I complete them. Cerberus is next, followed by the Geth, then the mercenary factions (Blue Suns, Eclipse, and Blood Pack).\nFinishing out the bestiary with some aliens, re-skined 5th edition monsters that I think fit well into the universe, and some\nnamed NPCS. When I finally do drop a Reaper stat block into the mix, I'm sure I'll have a very long post explaining my choices,\nmath, and play testing notes.</p>\n<h2>Site improvements</h2>\n<p>Probably least exciting to the average user (but exciting for me) are the minor site enhancements I've added.\nSpells, weapons, monsters, and grunts can now be bookmarked for quick reference. Conditions and some rule references\nnow have tooltips. And we've added spell cards to the <nuxt-link to=\"/assets\">Printables</nuxt-link> section. Special\nthanks to Swampson for banging those out. We're not 100% on the layout and style, but when we are, we'll release a\nprinting guide to go along with them.</p>\n<ul>\n<li>Rule dialogs added for quick reference.</li>\n<li>Tooltips added for conditions</li>\n<li>Special thermal clips added as possible npc feature in the grunt generator.</li>\n<li>Spell cards added to printables section</li>\n<li>Bookmarks allow you to save spells, weapons, and npcs for quick reference</li>\n</ul>\n",
    "id": "0-5-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.5.1 - Cerberus forces",
    "description": "Cerberus forces now in the bestiary.",
    "excerpt": "Cerberus forces and a note about upcoming changes",
    "date": "2017-03-19T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/8/8c/TIM_and_kai_leng.png/revision/latest/scale-to-width-down/640?cb=20130523085712",
    "html": "<h2>We're official (kind of...)</h2>\n<p>Tonight we launched our official site name: <a href=\"http://n7.world\" target=\"_blank\">n7.world</a>!</p>\n<p>You can also find us at <a href=\"http://masseffect5e.net\" target=\"_blank\">masseffect5e.net</a></p>\n<p>We waffled between n7.world and masseffect5e.net, landed on the former for the following reasons:</p>\n<ol>\n<li>It's easy to remember</li>\n<li>'N7' is a classic and recognizable Mass Effect reference, almost synonymous with the game itself</li>\n<li>'World' elicits the idea of roleplaying and being a piece in a larger galaxy.</li>\n</ol>\n<p>Truth be told, I hastily pushed this change out and even fixed a few links while I was actively running a weekly campaign\n(<em>shame on me as a GM!</em>). So if there are any issues you come across you can either use the <a href=\"https://goo.gl/forms/3wZj8QhlsLv3XOJw1\" target=\"_blank\">feedback form</a>\n<strong>OR!</strong> ping me on my fresh email: <a href=\"mailto:luke@n7.world\" target=\"_blank\">luke@n7.world</a></p>\n<p>I've got more system updates coming out next weekend at the latest. As word spreads about this system, we continue to gain a group\nof active contributors who are generating a ton of great new ideas.</p>\n<p>Thanks to everyone!</p>\n<h2>General</h2>\n<ul>\n<li>Shields regenerate after combat in addition to a short or long rest, or by taking the Hide or Dodge action\nand taking no damage.</li>\n<li>Armor proficiency moved back to the class (not race). To compensate this change, the 5,000 credit cost for race customization has been removed.</li>\n</ul>\n<h3>Galaxy Master</h3>\n<p>Swampson came up with the term 'Galaxy Master' (tm tm tm) or GM. We're using that from now on.</p>\n<h3>Medi-gel</h3>\n<p>Medi-gel should have always been a healing potion instead of the weird mechanics using hit die. Again, the hit die mechanics were neat,\nbut unnecessarily complex.</p>\n<h2>Skill changes</h2>\n<p>Finally, the skill changes were made to accomodate the upcoming Backgrounds and a large vehicle/space travel addition Swampson is working on.</p>\n<ul>\n<li><em>Hacking</em> renamed <em>Electronics</em> to encompass a wide variety of checks.</li>\n<li><em>Nature</em> renamed <em>Science</em> as a catch-all for scientific intelligence checks. In theory, most information needs can be found with\na quick search on the exonet. This check involves making connections between facts based on experience or intellect.</li>\n<li><em>Piloting</em> renamed <em>Vehicle Handling</em> and base ability changed to Dex. This covers your ability to maneuver vehicles. The GM\ncan also ask for a Wisdom (Vehicle Handling) check when attempting to drive unfamiliar or alien vehicles.</li>\n</ul>\n<h2>Re-aligning with 5e</h2>\n<p>Re-aligning Mass Effect 5th Edition (ME5e) with 5th Edition (5e), where possible, is an on-going process.\nThe first few versions of ME5e were based on cool ideas and not thoroughly play tested. As ME5e evolves, we want to be sure\nit has a balance and doesn't drift too far from the source. In some cases, the drift is necessary, a plethora of weapons and a nod towards\nscience over arcane. In other cases, the drift is intentional to add depth and variety: the expanded armor rules. But in a lot of cases,\nthe drift makes playing ME5e more complicated than intended. We want to fall back on existing 5e rules and only make changes\nwhere the core rules don't have the necessary structures to support this setting. A few examples follow.</p>\n<h3>Omni-tool attacks</h3>\n<p>In v0.5.0, we removed omni-tool attacks. This is a case where I'd simply pulled the idea straight out of ME3, in which each\nclass has its own attack. Though I've received feedback that it was a fun idea, the effect was that each class's default melee\naction was set and not a choice the player can make. However, we still need to replace the ME idea of having an omni-tool attack.\nNothing feels better than picking off a few marauders at range while a group of husks close in on you and, at the last second,\nspawning a blade and cutting those zombies to shreds.</p>\n<p>I never intended to lose this feeling, but I hadn't created the structures to replace it. In v0.5.1, we're halfway there.\nWe've introduced multiple types of Omni-weapons which have the potential to work like the previous omni-tool attacks. First,\nthese weapons don't use a weapon slot (and have a weight 0 if using the Encumbrance rules). In addition, you can draw them with\na free action. So features that grant additional attacks can now be used for these omni-weapons without having to stow or draw\ndifferent weapons.</p>\n<p>Currently there isn't a replacement for the biotic powers (Biotic Push and Punch). These should be available as cantrips\nin the next update. We're also working on providing Engineers with a cantrip-like starting power which can also replace their omni-tool power.</p>\n<h3>Armor Proficiency</h3>\n<p>Another superfluous change was tying armor proficiency to race. This somewhat came from ME1 where certain armor types were only\navailable for certain races, but it didn't add enough to the game. Mechanically, all it did was force some races to take feats in order\nto play their class effectively. It also simply added a 5,000 credit price tag for most armor. No we're back in-line with 5e\nand all armor proficiency and starting equipment is on the class.</p>\n<h2>Weapons</h2>\n<p>Almost all weapon weights have been reduced by 1-2. The exception is a few Heavy Weapons.</p>\n<h3>Omni-weapons</h3>\n<p>Omni-weapons replace void left by omni-tool attacks. They are light weapons that take no weapon slot and take a free action\nto draw. This gives players the option of having a back-up, at-the-ready melee attack.</p>\n<ul>\n<li>Added Omni-Taser &amp; Omni-Hammer added</li>\n</ul>\n<h3>Other weapon changes</h3>\n<ul>\n<li><strong>Asari Huntress Sword</strong> &amp; <strong>Asari Warsword</strong> combined into one weapon. Only allows casting of cantrip.</li>\n<li>Cerberus Operator Blade renamed Monomolecular Blade</li>\n<li>M-98 Widow deals double damage to targets not behind cover, replacing the complex and unrealistic 'line-damage' to creatures behind the target.</li>\n</ul>\n<h2>Feats</h2>\n<ul>\n<li>Melee Specialist:\n<ul>\n<li>with two-handed ranged weapon, can attack with an omni-weapon</li>\n<li>with one-handed ranged weapon, can attack with light or versatile (w/ one hand) weapon</li>\n<li>only melee, removed +1 AC (benefit available w/ Dual wielder feat)</li>\n</ul>\n</li>\n<li>Added Dual Wielder feat</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li>Dual Wield fighting style renamed Gunslinger to avoid confusion with the Dual Wielder feat</li>\n<li>Engineer's <em>Styptic</em> Medi-gel Enhancement increases the potency of the medi-gel.</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Husk, Str increased to 13, AC increased to 14, CR decreased to 1/8</li>\n<li>Abomination, Str increased to 13, HP increased to 26, CR increased to 1/4</li>\n<li>Collector Captain, Summon Seaker Swarm summons 1d4 swarms at an unoccupied space it can see within 10m.</li>\n<li>Harbinger, Added legendary actions, added melee attack, added Dark Channel to spell list</li>\n</ul>\n<h3>Cerberus Forces</h3>\n<p>12 unique monsters have been added to the Bestiary which encompass the list of Cerberus forces. It may seem like 3 weeks is\na long time to only have finished 12 monsters, but I need to refactor the underlying weapon code. Originally, I was creating\nduplicate attacks for each weapon. I.e., there was an NPC weapon attack and the weapon itself. But this was creating a lot\nof inconsistent data and needed to be remedied.</p>\n<p>Except for the delay, I am happy with the diversity among this group of NPCs. Adjutants add a bit of 'vampire'-flare to the system.\nPhantoms and Dragoons are a threat up close and hard to hit. Combat Engineers can be troublesome by spawning Turrets. Guardians\nare walking tanks that can take a serious amount of damage. All the while, a Nemesis might be taking pot-shots at you from 80m out.</p>\n<h2>Site Enhancements</h2>\n<ul>\n<li>Fixed bug that showed <code>Shields 0 ( regen)</code> when a monster had no shields.</li>\n<li>Added Distance rule change back into general rules.</li>\n<li>Fixed bug that caused side navigation menu to sometimes not show up.</li>\n</ul>\n",
    "id": "0-5-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.6.0 - A faster way to upgrade",
    "description": "A major back-end overhaul will make it easier to iterate on Mass Effect 5e",
    "date": "2018-04-15T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/0/04/ME3MP_Ops_Survival_Pack.png/revision/latest?cb=20180207021358",
    "html": "<h2>The Bad News</h2>\n<p>Unfortunately, I wasn't able to get to everything I wanted to in this release. There aren't any new monsters,\na planned Drone Jockey overhaul was left to the wayside, and some spell changes didn't make it in. The reason is that\nI've spent the majority of my time working on a major overhaul of the back-end of the site.</p>\n<p>Prior to this release there were some major hurdles I was battling with. For one, the Player's Manual (PHM) and the information pages (index, about, news), were split\nbetween 2 systems (Vue and Jekyll). I'd also been 'hacking' my development setup which often caused errors which led to hours debugging.\nAdditionally, the setup had a fatal flaw in that permalinked urls to the player's manual would render blank pages, which\nmeant site crawlers weren't able to parse any information in the PHM pages. I'm not too concerned about Search Engine Optimization (SEO), but felt that\ncrawlers should at least be able to scan the bulk of the content.</p>\n<p>Finally, I wanted a bit more pizazz and clarification on the homepage to explain what this system was and how to get started. My\nanalytics were showing a pretty high bounce rate (lower is better) on the homepage, but a high acquisition rate for users that\nmanaged to make it to the Player's Manual. I.e., users would land on the site, see only news and the logo and think, &quot;We'll this looks\npretty lame, bye!&quot;</p>\n<p>What was initially a piecemeal approach to fixing these issues turned into a complete overhaul, which took much longer than I originally anticipated.</p>\n<h2>The Good News</h2>\n<h4>1. Fancy new site pages</h4>\n<p>I probably enjoy this more than most. But the homepage, about section, and news section all have new styles.</p>\n<h4>2. Increased interest in the system</h4>\n<p>Over the past 2 weeks, I've received a swarm of feedback. At least 7 people have mentioned they're getting ready to start a campaign.\nThis has me floored. Before, I knew of only a few groups who were actively using the system. Not it seems like we're up to about a dozen.\nThe more users we have the more feedback and play testing we'll get, which will really help the system evolve.</p>\n<p>On this note, I need to give some shoutouts to Ben McPherson, Noel Moriarty, Adam (TheMarmotKing), and Alex Needleman who've been working really hard on pointing out\nsite bugs, over/underpowered mechanics, and creating new content. Keep up the good work everyone!</p>\n<h4>3. Still get some new changes</h4>\n<p>Even though my time was limited, I was still able to push a host of new changes, but this is mainly thanks to the aforementioned people.</p>\n<p>The major addition is that Weapon Mods were added. These will give players a new way to get bonuses on weapons which helps alleviate the lack of\n+N magical items that 5th edition has. Another big change was the increase opportunities for classes to learn Tech and Biotic powers, which should\nhelp make the classes feel less stale between levels.</p>\n<h2>General</h2>\n<ul>\n<li>Removed &quot;Backgrounds&quot; page. Information was incomplete and not applicable. Will be re-introduced when backgrounds are complete.</li>\n<li>Added basic information about resupply costs for items (Medi-gel, Heavy weapon charges, thermal clips, and grenades).</li>\n<li>The opportunity to quickly reload a weapon has been labeled &quot;Rapid Reload,&quot; and is performed as a reaction to taking the Reload action.\nHowever, the Rapid Reload reaction cannot be taken by a player wielding 2 weapons.</li>\n<li>Added Infrared Vision as a ersatz replacement for Truesight.</li>\n</ul>\n<h2>Classes</h2>\n<p>Starting weapon choices adjusted:</p>\n<ul>\n<li>M-8 Avenger replaces M-96 Mattock</li>\n<li>M-4 Shuriken replaces M-25 Hornet</li>\n<li>M-92 Mantis replaces M-13 Raptor</li>\n<li>Fighting Style: amended to allow classes that learn this ability twice (soldiers, sentinels, &amp; vanguards) to learn 2 initial perks from two different fighting styles or\none initial and one advanced perk from a single fighting style.</li>\n<li>Brawler Fighting style updated. Proficiency bonus added to melee attack damage rolls. Advantage on melee attacks moved to advanced perk.</li>\n</ul>\n<h3>Adepts</h3>\n<ul>\n<li>Adepts learn 2 cantrips and 2 1st level spells at level 1. This makes up for the fact that Adepts do not gain any basic ability at level 1.\nI.e., Engineers = Drone; Infiltrators = Tactical Cloak, Sentinel = Tech Armor, etc.</li>\n<li>Additional opportunities to learn biotic spells. Total opportunities = 16.</li>\n</ul>\n<h3>Engineers</h3>\n<ul>\n<li>Engineer's Efficiency added at level 3, providing the engineer with a cantrip-like tech power.</li>\n<li>Additional opportunities to learn a tech powers. Total opportunities = 14</li>\n</ul>\n<h3>Infiltrators</h3>\n<ul>\n<li>Tech power acquisition redistributed, allowing 9 opportunities to learn or advance tech powers (used to be 6).</li>\n<li>Tech point maximum increased to end at max 8, instead of max 6.</li>\n</ul>\n<h3>Sentinels</h3>\n<p>Overall, Sentinels were reworked to provide more opportunities to <strong>learn</strong> biotic spells and tech powers, but they can never\ncast those spells with the potency of Engineers or Adepts. This change also balances potential multi-classing. I.e., a multi-classed\nAdept/Engineer could have 8 Tech Powers (max TP = 6) and 10 Biotic spells (max spell slot 3rd level). Whereas a max level Sentinel\ncould have 7 Tech Powers (max TP = 6) and 8 Biotic Spells (max spell slot 3rd level).</p>\n<h3>Vanguards</h3>\n<ul>\n<li>\n<p>Removed the automatic acquisition of Barrier at level 1. Instead, Vanguards can choose one of the following cantrips: Charge, Biotic Punch, Barrier, or Throw</p>\n</li>\n<li>\n<p>Removed Sentinel Mastery class feature, replaced with additional opportunity to learn a biotic spell and tech power.</p>\n</li>\n<li>\n<p>Increased the level at which Sentinels can learn biotic spells: 5th level = 1st level spells, 9th level = 2nd level spells, 15th level = 3rd level spells.</p>\n</li>\n<li>\n<p>Additional opportunities to learn a tech powers and biotic spells. Total opportunities = 15</p>\n</li>\n</ul>\n<h2>Races</h2>\n<ul>\n<li><em>Krogans</em> can be Engineers, this is in line with the Andromeda lore, and there is nothing relevant in the codex that would justify them\nnot being able to be Engineers.</li>\n<li><em>Salarians</em>: added High Metabolism trait indicating they need a limited amount of sleep.</li>\n<li>Removed confusing syntax about taking a feat. Before, site stated that Ability Score Improvements could be substituted for a feat &quot;available to your race&quot;.\nFeat acquisition is only limited during character creation for level 1 characters. Otherwise, all feats are available to all races.</li>\n</ul>\n<h2>Weapons</h2>\n<ul>\n<li>Added normal and long range distance to ranged weapons. Essentially, this added a limit to which weapons cannot be fired beyond.</li>\n<li>Melee weapon attack damage bypasses shields.</li>\n<li>Krogan Warhammer no longer stuns or pushes enemy back. Instead, has the possibility to knock the target prone.</li>\n<li>M-8 Avenger: RoF reduced to 3</li>\n<li>M-96 Mattock: Damage increased to d10</li>\n<li>M-4 Shuriken: Damage reduced to d1</li>\n<li>M-25 Hornet: Range increased to 8m</li>\n<li>M-13 Raptor: Damage increased to d8</li>\n<li>All Heavy Weapons are unique (cannot be modded)</li>\n<li>Double Tap allows Dex mod to be used when making the attack roll (not damage roll). Used to prevent dex mod from being applied to attack and damage roll. This bring the skill in line\nwith 5th Edition's Two-Weapon Fighting rules.</li>\n</ul>\n<h2>Armor</h2>\n<ul>\n<li>Increase potency cost of <code>+1 to melee, ranged, biotic, tech, or combat</code> attack and damage rolls from 8000/level to 12000/level. Bring this in line\nwith weapon mods cost.</li>\n<li>Potency should never be &lt; 3</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li>New cantrips: Biotic Push &amp; Biotic Punch</li>\n</ul>\n<h2>Site improvements</h2>\n<ul>\n<li>Updated homepage, about page, news page, changelog</li>\n<li>Spell sorting/filtering added</li>\n<li>Fixed bug where Race page footer navigation had &quot;Next class&quot; as the button label</li>\n<li>Fixes bug where Biotic Walls advancement, Shifting Wall, did not display complete description.</li>\n</ul>\n",
    "id": "0-6-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.7.0",
    "description": "Geth forces, Race Audit, and a Weapon Balance",
    "date": "2018-05-06T00:00:00.000Z",
    "image": "https://data.n7.world/images/misc/ArmatureLanding.png",
    "html": "<h2>Many hands</h2>\n<p>First, we want to give a thanks to following people. They've been providing a lot of great feedback and ideas\nthrough Github and it's really spurned a lot of improvements.</p>\n<ul>\n<li>bpmcpherson</li>\n<li>nmmoriarty</li>\n<li>Duneday</li>\n<li>damuttley</li>\n<li>SrShadow</li>\n<li>BLUEmusta</li>\n<li>TheMarmotKing</li>\n</ul>\n<p>Additionally,</p>\n<ul>\n<li>Alex Needleman has continued to playtest and provide a lot of great feedback.</li>\n<li>David Thompson has offered his help with design.</li>\n</ul>\n<p>Thanks to everyone!!!</p>\n<h2>What's next?</h2>\n<p>We've got a lot of things in the works!</p>\n<h4>Angara Race</h4>\n<p>Ben (bcmcpherson), our local Andromeda expert has been creating a lot of Andromeda content. Most notably is his <a href=\"https://github.com/queryluke/masseffect-5e/issues/205\" target=\"_blank\">Angara concept</a>.\nWe're not quite ready to include everything in the system because we need to do a bit of housekeeping on the backend. But, we encourage you to test\nout the race and provide feedback!</p>\n<h4>Digital Character Sheet</h4>\n<p>Ben has also been working on a version of the Character Sheet in Google Sheets. Once the finishing touches are ready, we'll get it up on the site.</p>\n<h4>Loot Generator</h4>\n<p>As the dust settles on the cost of mods, weapons, and armor, we've been working on a Loot Generator and guidelines for awarding credits. That should be out in the very near future.</p>\n<h2>General</h2>\n<ul>\n<li>Added a note about race/class restrictions. Though we provide a rule of thumb, final decisions should be made by the GM.</li>\n<li>Created a Combat section in the rules to reduce the length of General rules. (Some rules now exist in multiple locations, if applicable to that category).</li>\n<li>Added infrared vision as a new sense.</li>\n<li>Changed Rapid Reload to a bonus action and made it a variant rule.</li>\n<li>Changed Thermal Clips to a standard rule. Not tracking thermal clips is a variant rule.</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li>Removed Perception as skill option for Sentinels &amp; Adepts. Added for Infiltrators &amp; Soldiers.</li>\n<li>Added additional information about spellcasting to each class page.</li>\n<li>Vanguards weapon proficiency choices changed. Instead of automatically gaining shotguns, vanguards automatically gain melee and have the option of shotguns.\nVanguards are geared heavily towards a melee class and should gain that proficiency.</li>\n<li>Sniper fighting style changed to +2(basic) and +4(adv) damage made with Sniper Rifles if no hostile creature is within 10m.</li>\n</ul>\n<h3>Adepts</h3>\n<ul>\n<li>To accommodate the changes in Lift, Biotic Control allows the Adept to lift a target 1 size larger than its current capability.</li>\n<li>Barrier Ticks rescaled from 2-5</li>\n</ul>\n<h3>Engineers</h3>\n<p>As alluded to in our previous release, we've been working on an overhaul of the Drone Jockey (Engineer) subclass and it's finally here.</p>\n<ul>\n<li>\n<p>Drones are now a stat block in the bestiary. As such, the Drone ability will summon the bestiary version. Medics\nare still the only subclass that can access the Repair (Healing) drone.</p>\n</li>\n<li>\n<p>Drone Jockeys are completely refactored. Though the multi-drone approach was fun, it significantly slowed down combat and proved slightly too powerful at all levels.\nInstead, Drone Jockeys function almost identically to 5th Edition's Ranger - Beast Conclave. You'll get to create a Drone Companion that persists outside of combat,\ngains valuable stat and defensive increases, and has its own personality.</p>\n</li>\n</ul>\n<h3>Infiltrators</h3>\n<ul>\n<li>Moved Evasion to the 14th level</li>\n<li>Removed Cunning Action at 14th level</li>\n<li>New ability Fast Hands gained at 7th level</li>\n</ul>\n<h3>Sentinels</h3>\n<ul>\n<li>Added barrier ticks (2-6) and the ability to cast Barrier, Barrier Detonation, Lash, Phase Disruptor.</li>\n<li>Sentinels can take the Protection fighting style.</li>\n<li>Increased spell and tech point progression, bringing them in line with Vanguard and Infiltrator casting potency.</li>\n</ul>\n<h3>Soldiers</h3>\n<ul>\n<li>Sharpshooter subclass features aligned with 5th Edition's Sharpeshooter class from the <a href=\"https://media.wizards.com/2016/dnd/downloads/2016_Fighter_UA_1205_1.pdf\" target=\"_blank\">Unearthed Arcana</a></li>\n<li>Gain Tactical Clip at 7th level for faster reloading</li>\n</ul>\n<h4>Vanguards</h4>\n<ul>\n<li>Barrier ticks rescaled, still from 3-10, but distributed more evenly across levels</li>\n</ul>\n<h2>Races</h2>\n<p>Primarily due to work of the contributors listed above, we audited each race. We focused on missing lore specific traits,\nbalancing the traits between races, and clarifying trait mechanics. Of particular note, Asari will use Charisma as their\nspellcasting modifier for biotic spells, rather than Wisdom.</p>\n<h3>Asari</h3>\n<ul>\n<li>Cantrip replaced with Biotic Initiate, similar to 5th Edition's Magic Initiate, giving all Asari some biotic powers</li>\n<li>Asari always use Charisma as their spellcasting modifier for biotic spells.</li>\n</ul>\n<h3>Geth</h3>\n<ul>\n<li>Ability bonuses changed to +2 INT, +1 STR</li>\n</ul>\n<h3>Krogan</h3>\n<ul>\n<li>Added Powerful Build</li>\n</ul>\n<h3>Quarian</h3>\n<ul>\n<li>Ability bonuses changed to +2 INT, +1 CON.</li>\n<li>Hermetic suit uses exhaustion rules when breached.</li>\n<li>Options for Cybernetic Augmentation improved.</li>\n</ul>\n<h3>Turian</h3>\n<ul>\n<li>Added radiant resistance.</li>\n</ul>\n<h3>Volus</h3>\n<ul>\n<li>Ability bonuses changed to reflect their race: intuitive with above-average intelligence (+2 wis, +1 int)</li>\n<li>Savvy Dealings, now gives proficiency in Persuasion. The &quot;discounts from vendors&quot; was too open-ended and could pidgeon-hole Volus players making all shop transactions.</li>\n</ul>\n<h3>Vorcha</h3>\n<ul>\n<li>Added poison resistance &amp; limb regeneration</li>\n</ul>\n<h3>Unshackled-AI.</h3>\n<ul>\n<li>Removed option of starting feat, balancing their lvl 1 options with other races.</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Charge</strong>\n<ul>\n<li><em>Advanced Option Necrotic Strike</em> removed. Replaced with Barrier Regen. References classic Charge/Nova Vanguard from ME3. But primarily</li>\n</ul>\n</li>\n<li><strong>Decoy</strong>. Clarified the spell's mechanic</li>\n<li><strong>Guidance</strong>. bonus can be used on attack rolls. Limited to 1 target.\n<ul>\n<li><em>Multi Tap</em>. Allows application og Guidance to 3 targets (must still cast the spell for each target).</li>\n</ul>\n</li>\n<li><strong>Invasion</strong> renamed to AI Hacking. Better elicits the spell mechanic and allows for creation of Andromeda's Invasion in the future.\ngives Vanguards another option to regain barrier ticks.</li>\n<li><strong>Lift</strong>. removed the &quot;Sleep&quot; mechanic and changed to a ranged spell attack. Cannot benefit from being cast at higher levels. Limited to Medium target.\n<ul>\n<li><em>Advanced Option Control</em>, now a bonus action, reduced movement to 6m.</li>\n<li><em>Advanced Option Heavy Lift</em>, allows you to lift a Large object or creature.</li>\n</ul>\n</li>\n<li><strong>Overload</strong>\n<ul>\n<li><em>Quad Leap</em> removed. Replace with increased damage options.</li>\n</ul>\n</li>\n<li><strong>Sentry Turret</strong>. Sentry turret is now a stat block, casting this spell creates a turret.</li>\n<li><strong>Tactical Scan</strong> duration reduced from Infinite to 10 minutes</li>\n<li><strong>Turbocharge</strong> Removed. With the removal of RoF, Turbocharge was removed. We will add it back in a later version.</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Added Geth Forces</li>\n<li>Added Drones</li>\n<li>Centurion: was missing speed, saving throws, and senses. CR was too low. Added resistance to bludgeoning, slashing, and piercing damage, which correctly brings CR to 3.</li>\n</ul>\n<h2>Weapons</h2>\n<h3>Weapon Balance</h3>\n<p>If you averaged the damage of all weapons before and after v0.7.0, you could argue that we've nerfed the weapons. But\nwe consider this version to bring a much better balance to the weapon system, despite the slightly reduced damage overall.</p>\n<p>We noticed quite a few problems with the previous versions</p>\n<ol>\n<li>Weapons dealt 15-20% more damage than in 5th Edition</li>\n<li>The spread of damage was huge 1d4 =&gt; 4d10</li>\n<li>The Rate of Fire mechanic didn't have any benefits other than being flavor about the weapon. And even the flavor was difficult to apply.\nTake the M-4 Shuriken: in the game, this weapon specifically has a six-round burst, meaning 6 RoF. But since it's meant to be a starting weapon, we had to make it deal 6d1. There are other cases where RoF didn't directly correlate.</li>\n<li>Weapon damage was unbalanced. We received a lot of feedback that Shotguns were too powerful, Sniper rifles underpowered, and melee weapons worthless.</li>\n</ol>\n<p>Our solution was to create weapon profiles and build from those profiles. In doing so we also created distinct levels for\nthe weapons that mirror 5th edition's item rarity (Common, Uncommon, Rare, Very Rare). This provided a system in which we could\nmake objectively better weapons, whereas previous versions attempted to make all weapons unique (save for the starting weapons).</p>\n<p>We're very pleased with the result and feel the weapons are more balanced than they've ever been. If you'd like to read the entire\ndiscussion, please refer to the <a href=\"https://github.com/queryluke/masseffect-5e/issues/249\" target=\"_blank\">github issue</a>. Additionally, we prepared\n<a href=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vSq70x_GZuDKcELgX8k_7Hd6nLGu3DoIEdDwP-YEGjUU-ghGc7ot_Q7140FZwGbEalHgzPwVm4BN8y_/pubhtml?gid=332103674&single=true\" target=\"_blank\">an analysis</a> of the new weapon balance.</p>\n<h3>Changes</h3>\n<ul>\n<li>Weapons now have a 4-tier rarity: Common, Uncommon, Rare, Very Rare.</li>\n<li>Weapon costs have been adjusted to reflect rarities: Common &gt;= 3,000, Uncommon &gt;= 10,000, Rare &gt;= 30,000, Very Rare &gt;= 50,000</li>\n<li>Rate of Fire (RoF) has been removed. While we liked the flavor it added, it didn't have any other benefit. Plus, it was difficult to keep the flavor consistent among weapons.</li>\n</ul>\n<h4>Assault Rifles</h4>\n<ul>\n<li>Adas Anti-Synthetic Rifle: 4d6 =&gt; 2d6, deals and additional 1d6 damage to synthetic targets.</li>\n<li>Cerberus Harrier: 4d4 =&gt; 2d6</li>\n<li>Geth Pulse Rifle: 6d4 =&gt; 2d6, deals radiant damage</li>\n<li>M-15 Vindicator: 3d4 =&gt; 1d10</li>\n<li>M-55 Argus: 3d6 =&gt; 1d12</li>\n<li>M-7 Lancer: 4d6 =&gt; 2d6</li>\n<li>M-76 Revenant: 5d4 =&gt; 3d4</li>\n<li>M-8 Avenger: 3d4 =&gt; 1d8</li>\n<li>M-96 Mattock: 1d10 =&gt; 1d8</li>\n<li>M-99 Saber: 1d10 =&gt; 3d6, customization options changes</li>\n<li>N7 Typhoon: 5d4 =&gt; 2d8</li>\n<li>N7 Valkyrie: 2d6 =&gt; 2d8</li>\n<li>Particle Rifle: 6d4 =&gt; 2d10</li>\n<li>Phaeston: 4d4 =&gt; 2d4</li>\n<li>Striker Assault Rifle: 4d6 =&gt; 1d12, special updated, can start targeting to deal additional damage</li>\n</ul>\n<h4>Heavy Pistols</h4>\n<ul>\n<li>Acolyte: 1d8 =&gt; 1d6</li>\n<li>Arc Pistol: 1d8 =&gt; 1d6</li>\n<li>Executioner Pistol: 1d12 =&gt; 2d12</li>\n<li>M-358 Talon: 2d8 =&gt; 2d6</li>\n<li>N7 Eagle: 4d4 =&gt; 2d4</li>\n<li>Scorpion: 1d8 =&gt; 1d6</li>\n</ul>\n<h4>Melee</h4>\n<ul>\n<li>Asari Huntress Sword: 1d6 =&gt; 1d8</li>\n<li>Krogan Warhammer: 1d12 =&gt; 2d6 (1d12 as a one-handed weapon)</li>\n<li>Monomolecular blade: 1d8 =&gt; 1d10</li>\n<li>Omni-blade: 1d6 =&gt; 1d8</li>\n<li>Omni-hammer: 1d8 =&gt; 1d10</li>\n<li>Omni-whip: 1d8 =&gt; 2d4</li>\n</ul>\n<h4>Shotguns</h4>\n<ul>\n<li>AT-12 Raider: 2d10 =&gt; 2d8</li>\n<li>Disciple: 2d6 =&gt; 2d4</li>\n<li>Geth Plasma Shotgun: 2d12 =&gt; 2d10</li>\n<li>Graal Spike Thrower: 2d12 =&gt; 2d6. Reduced additional damage to 1d6</li>\n<li>M-11 Wraith: 2d10 =&gt; 3d6</li>\n<li>M-27 Scimitar: 3d4 =&gt; 2d4</li>\n<li>M-300 Claymore: 4d12 =&gt; 3d8</li>\n<li>N7 Crusader: 2d6 =&gt; 2d10</li>\n<li>N7 Piranha: 2d10 =&gt; 2d4</li>\n<li>Reegar Carbine: 2d4 =&gt; 1d12</li>\n</ul>\n<h4>SMGs</h4>\n<ul>\n<li>Blood Pack Punisher: 4d6 =&gt; 3d4, +1 to hit within normal range instead of +2</li>\n<li>Collector SMG: 4d6 =&gt; 2d8</li>\n<li>M-12 Locust: 4d4 =&gt; 3d4</li>\n<li>M-25 Hornet: 3d4 =&gt; 2d4</li>\n<li>M-4 Shuriken: 6d1 =&gt; 2d4</li>\n<li>M-9 Tempest: 4d4 =&gt; 2d6</li>\n<li>N7 Hurricane: 4d6 =&gt; 3d6</li>\n</ul>\n<h4>Sniper Rifles</h4>\n<ul>\n<li>Black Widow: 4d10 =&gt; 2d12, increased heat to 3. Added ignores half cover and deals 1d4 extra damage on targets not behind cover. Essentially the heavier, higher heat version of the M-98 Widow</li>\n<li>Javelin: Ignores half AND three-quarters cover (more in line with fiction, as it's the highest piercing weapon)</li>\n<li>Kishock Harpoon Gun: 1d12 =&gt; 3d6. Added CON save for bleeding damage. Bleeding damage increased to 3d6.</li>\n<li>Krysae Sniper Rifle: 1d10 =&gt; 2d4</li>\n<li>M-13 Raptor: 1d8 =&gt; 1d10</li>\n<li>M-90 Indra: 4d6 =&gt; 2d8, increased heat to 10</li>\n<li>M-92 Mantis: 1d10 =&gt; 2d8</li>\n<li>M-97 Viper: 1d8 =&gt; 1d12</li>\n<li>M-98 Widow: 1d12 =&gt; 2d12. Removed &quot;ignores three-quarters cover&quot;, reduced additional damage to 1d4</li>\n<li>N7 Valiant: 1d8 =&gt; 2d8. Removed +2 on ranged attack rolls, added &quot;Can reload as a bonus action&quot;</li>\n</ul>\n<h3>Weapon Mods</h3>\n<p>In the last release, we introduced weapon mods, but this was rushed and not thoroughly tested. It became clear that the stacking of certain mods\n(especially between weapons an armor) created very high bonuses. In 5th edition, +X items are limited to +4 for legendary type items, but our\nmod combinations could result in as much as +7. In response, we've changed or removed any armor mods or sets that increased the effectiveness of\nranged weapons. Basically, let weapon mods buff weapons and let armor mods buff defenses. The only caveat is that armor can still provide boosts\nto melee weapons, as they currently have no mods.</p>\n<ul>\n<li>Rename &quot;core&quot; type to &quot;ammo&quot;</li>\n<li>Cranial Trauma Mod: Limit to one level (1 additional damage die on critical hit)</li>\n<li>Power magnifier: Limit to one level (currently lvl 3 has potential to add +9 with some subclasses).</li>\n<li>Concentration Mod: Limit to one level (19-20 crit)</li>\n<li>Piercing Mod: Rename piercing ammo. Negates resistance to piercing damage.</li>\n<li>Shredder mod: Renamed shredder ammo. Changes damage to slashing. Negates resistance to slashing damage.</li>\n<li>Quick release magazine: Limit to 1 level. &quot;You may reload as a bonus action&quot;</li>\n<li>Magazine upgrade: Limit to 1 level. Weapon gains a bonus to heat equal to 1/2 it's base heat score. (useless for 1 heat weapons)</li>\n<li>Extended Magazine: New. Weapon gains a bonus to heat equal to twice it's base heat score (limited for 1 heat weapons)</li>\n<li>High-Velocity Barrel: New. Reroll damage</li>\n<li>Heat sink: removed</li>\n</ul>\n<h3>Grenades</h3>\n<ul>\n<li>Increased the radius of the smoke grenade to 4m.</li>\n</ul>\n<h2>Armor</h2>\n<p>Overall, we reduced or removed armor mods/sets/mechanics that increased ranged weapon attack and damage potential to avoid too much\noverlap and stacking between armor and weapon mods.</p>\n<h3>Armor Sets</h3>\n<p>In general, armor set costs were realigned to be 15% less than if you had crafted the armor from scratch, since armor sets cannot be upgrade later.</p>\n<ul>\n<li>Serrice Adaptor Gauntlets =&gt; cannot select bludgeoning, piercing, or slashing resistance</li>\n<li>Mantis Armor =&gt; +1 AC. Increase your speed by 4m. Increase your grenade capacity by 2.</li>\n<li>Collector Armor =&gt; reworked: +3 AC, auto-stabalize and medi-gel</li>\n<li>N7 Defender Armor =&gt; reworked: 20 shields (regen 10). +2 AC. Increase thermal clip capacity by 4. Increase grenade capacity by 2</li>\n<li>Terminus Assault Armor =&gt; 10 shields (regen 5). Speed +4m. When you lose hit points, as a reaction, you may expend a charge of medi-gel. +2 bonus to melee attack and damage rolls</li>\n<li>Cerberus Nightmare Armor =&gt; remove heat +2, instead double base heat. remove + to ranged attacks and damage.</li>\n<li>Blood Dragon Armor =&gt; remove + to tech and biotic attack and damage rolls, replace with reroll 1's on tech/biotic damamge</li>\n<li>Cerberus Ajax Armor =&gt; rework: 30 shields (15 regen). +1 AC. Increase your thermal clip capacity by 8. Increase your grenade capacity by 4.</li>\n<li>Cerberus Shade Armor =&gt; rework: 10 shields &amp; regen, shield jumpstart, +1 bonus to melee attack and damage</li>\n<li>Inferno Armor =&gt; rework: When you lose hit points, as a reaction, you may expend a charge of medi-gel. +1 bonus to biotic and tech attack and damage rolls.</li>\n<li>Reckoner Knight Armor =&gt; rework: 15 shields (regen 5). When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2.</li>\n<li>Partisan Armor =&gt; immune to poisoned</li>\n<li>N7 Armor =&gt; rework: 10 shields (regen 10). +1 AC</li>\n<li>Kestrel Helmet =&gt; reduce +AC to 1</li>\n<li>Kuwashii Visor =&gt; rework. basically gives hunter's mark.</li>\n<li>Archon Visor =&gt; limited to 1/2 level of a specific class</li>\n<li>Umbra visor =&gt; reroll 1 instead of 1 &amp; 2, limited to tech powers</li>\n<li>Mnemonic Visor =&gt; rework: reroll 1 on biotic spells</li>\n<li>Delumcore Overlay =&gt; rework: -1 AC. 1 additional damage die on critical hit</li>\n<li>Death Mask =&gt; rework: +1 AC. +1 on melee attack and damamge rolls</li>\n<li>Recon hood =&gt; rework: Infrared Vision 60m. Darkvision 60m. You can toggle between the 2 vision types as a free action.</li>\n<li>Strider leggaurds =&gt; remove adv. on Dex checks and saving throws, replace with +6m speed</li>\n</ul>\n<h3>Armor Mods</h3>\n<h5>New</h5>\n<ul>\n<li>Teflon Coating, resistance to radiant damage, 15,000</li>\n</ul>\n<h5>Changes</h5>\n<ul>\n<li>Ablative Coating (+2 AC) =&gt; Resistance to piercing damage, 30,000 credits</li>\n<li>Adrenaline Regulators =&gt; increase cost to 40,000</li>\n<li>Archon AI (gain spells slots on a short rest) =&gt; increase cost 24,000</li>\n<li>Armor Plating renamed Ceramic Weave</li>\n<li>Asymmetric Defense Layer (+2 AC. Increase your hit points by half your level, minimum 1.) =&gt; +2 AC, 20,000 credits.</li>\n<li>Barrier (5 barrier ticks/long rest) =&gt; reduced to 3 barrier ticks, recharge on short rest, 24,000</li>\n<li>Energized Plating (+3 AC) =&gt; price increase 30,000 credits</li>\n<li>Focus Modulator (You gain a +2 bonus to ranged weapon, biotic, and tech attack rolls) =&gt; Basically will give the wearer the ability to cast hunter's mark, 3/long rest, 40,000 credits</li>\n<li>Life support webbing (Increase your hit points by half your level, minimum 1.) =&gt; Increases your maximum exhaustion by 1 level. At the first level, you suffer no negative effects. 15,000 credits</li>\n<li>Microservos (Arms) =&gt; price increase 24,000</li>\n<li>Microservos (Legs, +2 melee attack and damage rolls) =&gt; +1 melee attack and damamge rolls, 12,000</li>\n<li>Mag Latches =&gt; increase cost to 25,000</li>\n<li>Personal Disruptor Torpedoes =&gt; damage decreased to 3d12</li>\n<li>Recharge capacitors =&gt; changed mechanic to reaction instead of free action</li>\n<li>Revive AI =&gt; Price decreased to 50,000</li>\n<li>Savant Biotic Amplifier (add damage die on biotic rolls) =&gt; reroll 1&amp;2 on biotc spells, 40,000</li>\n<li>Thermal armor =&gt; increase cost to 25,000</li>\n<li>Umbra AI =&gt; increase cost to 40,000, tech powers only</li>\n</ul>\n<h5>Shield Point Changes</h5>\n<ul>\n<li>Shield capacity (arms) =&gt; reduced to 5 sp, 10,000 credits</li>\n<li>Sentry System (head) =&gt; reduced to 5 sp, 10,000 credits</li>\n<li>Shield battery (chest) =&gt; reduced to 5 sp, 10,000 credits</li>\n<li>Shield Modulator (chest) =&gt; reduced to 10 sp, 20,000 credits</li>\n<li>Shield Interface (chest) =&gt; reduced to 15 sp, 30,000 credits\n<strong>Note</strong> this makes max shields from mods = 45 (5 base, 5 arms, 5 head, 5 + 10 + 15 chest)</li>\n</ul>\n<h5>Shield Regen</h5>\n<ul>\n<li>All shield regen =&gt; increase cost to 8,000</li>\n</ul>\n<h5>Removed</h5>\n<ul>\n<li>VI aiming</li>\n<li>Weapon stabilizers</li>\n<li>Ceramic Weave</li>\n</ul>\n<h3>Armor Mechanics</h3>\n<h5>New</h5>\n<ul>\n<li>reroll any 1 on your [biotic, tech, or melee] damage rolls =&gt; cost 20,000</li>\n</ul>\n<h5>Changes</h5>\n<ul>\n<li>shields: reduced potency to 5 to allow shield stacking on different pieces of equipment</li>\n<li>shield regen: increase cost to 8,000</li>\n<li>attack bonus (+1 to attack and damage bonus) =&gt; only allowed for melee weapons</li>\n<li>reroll any 1 on your [biotic, tech, or melee] damage rolls = cost increase to 40,000</li>\n<li>Damage or Condition Immunity =&gt; cost increase 25,000 (cannot be piercing, slashing, or bludgeoning)</li>\n<li>Resistance to 1 damage type =&gt; cost increase to 15,000, except for piercing damage (30,000)</li>\n<li>Instantly stabalize when you drop below 0 hit points =&gt; cost reduced 35,000</li>\n<li>AC Increase =&gt; price increased to 10,000</li>\n</ul>\n<h6>Removed</h6>\n<ul>\n<li>additional damage die for [biotic, tech] spell</li>\n<li>Increase hit points by 1/2 level</li>\n<li>Increase weapon heat</li>\n</ul>\n<h2>Site Enhancements</h2>\n<ul>\n<li>Grunt Generator has be improved for more variety. Before, high-level CR grunts always dual-wielded. Now, grunts can have legendary actions,\nand their equipped weapons appropriate for their level (i.e., no Very Rare weapons on a 1/8 CR grunt).</li>\n<li>Renamed &quot;Tools&quot; section to &quot;For GMs&quot;</li>\n<li>Moved rules for creating new armor mods and sets into the For GMs section</li>\n</ul>\n",
    "id": "0-7-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.7.1",
    "description": "Changelog for Mass Effect 5e v0.7.1",
    "date": "2018-05-19T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/0/08/Fehl_prime_-_biotic_balls.png/revision/latest/scale-to-width-down/640?cb=20130122172423",
    "html": "<h2>General</h2>\n<ul>\n<li>Monsters and NPCs that used grenades now have a Recharge 5-6 for grenades, rather than a set number of grenades. The recharge\nis not meant to indicate that the NPC is literally regenerating a grenade over time, but a random chance that the PC has more grenades.</li>\n<li>Added a rule set about expenses, currency, buying and selling.</li>\n</ul>\n<h2>Races</h2>\n<ul>\n<li>Salarian's photographic memory offered expertise in skills that are no longer in the game.</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li>Removed Stun Baton from starting weapon options (it is an uncommon weapon). Replaced with Omni-Torch for Engineers.</li>\n<li>Increase range of Tech Aura (<strong>Guardian Sentinel</strong>) from 4m/10m =&gt; 10m/20m</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Vortex</strong>: Changed damage type to force.</li>\n<li><strong>Slam</strong>: Changed damage type to bludgeoning.</li>\n<li><strong>Singularity</strong>: Affects creatures AND objects, instead of only hostile creatures.</li>\n<li><strong>Barrier Detonation</strong>: Changes to DEX save instead of Hit Point roll.</li>\n<li><strong>Biotic Push</strong>: Removed &quot;target is knocked prone&quot;. This is now an advanced option, replacing Deadly Push.</li>\n<li><strong>Target Painting</strong>: Reduced the duration to 1 round of combat. Since this is based on Faerie Fire which requires concentration, it didn't make sense for\nthis spell to have infinite length.</li>\n</ul>\n<h2>Weapons</h2>\n<ul>\n<li>There was an error in the cost calculation formula making the weapon costs too high.</li>\n<li><strong>Black Widow</strong>; was missing its additional benefits (ignores half cover, 1d4 additional damage to targets not behind cover)</li>\n<li><strong>Hip Fire</strong>: Removed the advantage that hip-fire provided on targets within 2m. This was an unfair benefit over melee weapons.</li>\n<li><strong>Shotguns</strong>: Reduced long range to double normal range instead of triple.</li>\n<li><strong>SMGs</strong>: Hip fire added to most SMGs</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li><strong>Rocket Drone</strong>: now has a range for it's distortion rockets</li>\n</ul>\n<h2>Feats</h2>\n<ul>\n<li><strong>Hair Trigger</strong>: Limited to a single Double Tab weapon (i.e., cannot stack with Gunsliger). Allows 1 additional ranged attack per turn as a free action.\nAdditionally, the +DEX bonus is added to the <em>damage</em> roll not the <em>attack</em> roll.</li>\n</ul>\n",
    "id": "0-7-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.8.0",
    "description": "Backgrounds, Bestiary Bump, and Barrier",
    "date": "2018-06-08T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/6/60/Kasumi_Briefing.jpg/revision/latest/scale-to-width-down/800?cb=20100617000152",
    "html": "<h2>General</h2>\n<h3>AC</h3>\n<p>The way AC is calculated has been changed. Prior, there was an AC penalty if you were not wearing armor, resulting in very low AC and\nmaking it very dangerous to play a character without armor. Now, AC is granted by individual armor pieces.</p>\n<h3>Backgrounds, Tools &amp; Tool Proficiencies, and Omni-Gel</h3>\n<p>This homebrew is a work in progress. Instead of spending years behind closed doors and delivering\na prefect product, our philosophy is to publish content quickly so players can test it and then we refine later. So before you\nget too excited about backgrounds, note that this is the first draft. The same goes for the tool proficiencies. As you'll\nquickly realize, some backgrounds reference Starship System proficiencies. These proficiencies are currently\nstubs and have no in-game mechanics. We're working on a larger starship rule set, which we'll release in v0.9.0.</p>\n<p>Omni-gel is a new resource that is necessary to power tool kit abilities.</p>\n<p>As this is brand new content, we would love to hear your <nuxt-link to=\"/about\">feedback and ideas</nuxt-link>.</p>\n<h3>Burst Fire</h3>\n<p>We've introduced a new weapon feature that borrows from the Dungeon Master's Guide, <em>Burst Fire</em>. Weapons with Burst Fire allow players to spend their action\n&quot;spraying and praying&quot; giving a bit more variety to assault rifles and smgs.</p>\n<h3>Fighting styles</h3>\n<p>The advanced versions of fighting styles have been removed. Trying to balance advanced fighting styles proved difficult,\nand many advanced versions we're too powerful. In addition, some fighting styles have been updated:</p>\n<ul>\n<li>Gunslinger: Effectively grants Two-Weapon fighting for ranged weapons. Though it can no longer stack with Double Tap, there is no damage penalty on the attack\nmade with your bonus action.</li>\n<li>The Freehand: Description clarified to provide bonus when wielding a weapon that is not two-handed</li>\n<li>Carnage: Replaced with damage reroll (similar to 5th Edition's Great Weapon Fighter).</li>\n<li><em>(New)</em> Close Quarters Shooter: Slightly less powerful version of 5th editions, the limitations are put in place because the majority of combat is ranged and the\nbenefit of the 5th edition version out-shined all other offensive fighting styles</li>\n<li><em>(New)</em> Assault: Increases your Burst Fire capability</li>\n</ul>\n<h3>Barrier</h3>\n<p>Barrier has proved to be a difficult ability to figure out. One of the primary problems is that barrier has changed between\nevery game. Here are the iterations:</p>\n<ul>\n<li>Mass Effect 1: Active boost in shields points, specifically providing an additional layer of shields for a duration</li>\n<li>Mass Effect 2: Active boost to overall damage reduction</li>\n<li>Mass Effect 3:Vanguards and Adepts had a 'biotic barrier' instead of shields which powered some biotic abilities.\nThere was also a power called Barrier that worked like ME2, but had a new barrier detonation component.</li>\n<li>Mass Effect: Andromeda: Passive bonuses to shields</li>\n</ul>\n<p>Since the onset of the project, we've wanted to keep unique and iconic powers, one of which was the Nova Vanguard which\ngrew in popularity in Mass Effect 3. So we created a system that could improve spells by using a resource <em>other than</em> spell slots.\nBut this has added a dimension of spell complexity not found in 5th edition. The other problem was barrier ticks, a class\nresource that could only be regenerated with a cantrip. This ultimated made the cantrip mandatory. Therefore, we've made Barrier\na class feature available to Adepts, Sentinels, and Vanguards.</p>\n<p>Here is the breakdown of the changes:</p>\n<ul>\n<li>&quot;<em>Nerfs</em>&quot;\n<ul>\n<li>Scaling damage reduction removed, instead classes gain increased damage reduction at specific levels.</li>\n<li>Barrier has a limited number of casts based on your class level</li>\n</ul>\n</li>\n<li>&quot;<em>Buffs</em>&quot;\n<ul>\n<li>Barrier can be cast as an action or bonus action</li>\n<li>Having an active barrier does not reduce speed</li>\n</ul>\n</li>\n</ul>\n<p>We hope that this makes barrier less confusing without completely overhauling the system.</p>\n<h3>Cantrips</h3>\n<p>Instead of learning cantrips as part of your spell gains, you instead learn cantrips as you progress in your class level.\nIn short, you know a number of cantrips (advanced count as 2 cantrips) based on the number of cantrips known on your progression table.</p>\n<h3>Detonators</h3>\n<p>The potency of detonators have been increased slightly, giving them a more satisfying feel. We will continue to work on how to make these more attractive.</p>\n<h2>Races</h2>\n<p>All races have been provided with a flat 10,000 credit increase to their starting credits. Prior to the increase, average rolls were comparable to taking the starting equipment,\nproviding almost no benefit for gambling.</p>\n<h3>Salarians</h3>\n<ul>\n<li>Photographic memory: Proficiency bonus is based only on ability checks for recalling information.</li>\n</ul>\n<h2>Classes</h2>\n<h3>Adepts</h3>\n<ul>\n<li><strong>Blackstar</strong>: Biotic Control, Lift and Pull names are swapped (see spells below). Additionally, the Lift portion provides advantage when maintaining the spell.</li>\n</ul>\n<h3>Infiltrator</h3>\n<ul>\n<li>Tactical cloak: Added a duration of 1 minute</li>\n</ul>\n<h3>Sentinels</h3>\n<ul>\n<li>Removed the attainment of an advanced Fighting Style</li>\n<li><strong>Bastion</strong>: <em>Assault Armor</em>, clarified the wording of this feature. Added additional saving throws for affected targets.</li>\n</ul>\n<h3>Vanguards</h3>\n<ul>\n<li>Removed the attainment of an advanced Fighting Style</li>\n<li><strong>Shock Trooper</strong>: Biotic Slash now detonates a primed target.</li>\n</ul>\n<h2>Spells</h2>\n<p>Our Barrier changes came about from a spell review. We've slowly working through all of our spells, testing, theory-crafting, and\ndiscussing changes. This process should help clarify spell text and make advanced options more attractive. We've finished cantrips\nand will be working through the other biotic spell levels, tech, and combat in future partial releases.</p>\n<ul>\n<li><strong>Backlash</strong>: Change to a concentration spell, lasts 1 minute</li>\n<li><strong>Charge</strong>\n<ul>\n<li><em>Distance</em>: Removed. Was not as attractive as Barrier Regen</li>\n<li><em>Stunning Blow (new)</em>: Stuns target that fails saving throw. Provides a control option for players not investing in Barrier.</li>\n</ul>\n</li>\n<li><strong>Biotic Push</strong>: Removed. Between Throw and Biotic Punch, there was no niche that Biotic Push filled.</li>\n<li><strong>Biotic Pumch</strong>: Flat barrier tick gain. Casting time is an Action.\n<ul>\n<li><em>Siphoning Strike</em>: Gain 10 shield points.</li>\n</ul>\n</li>\n<li><strong>Dark Channel</strong>: Damage reduced to d6. Dark Channel caused equivalent damage to 1st level spells. Instead of transferring to a <em>random</em> creature,\ntransfers to the <em>nearest</em> creature.</li>\n<li><strong>Dark Sphere</strong>: Reduced duration to 1 minute.</li>\n<li><strong>Lash</strong>: Removed barrier tick cost. Set range of 10m.</li>\n<li><strong>Lift</strong>: Has been renamed <em>Pull</em>, as the mechanics of this spell better reflect <em>Pull</em> in Mass Effect 2, 3, and Andromeda</li>\n<li><strong>Pull</strong>: Has been renamed <em>Lift</em> and refactored, becoming a cantrip for moving objects around with a mass effect field.</li>\n<li><strong>Sabotage</strong>: Removed the attack roll, but increased cost. Added saving throw for weapons that are a part of creatures.\n<ul>\n<li><em>Backfire</em>: Replaces Disable. Deals damage back at attacker.</li>\n</ul>\n</li>\n<li><strong>Sentry Turret</strong>: Added duration of 1 minute.</li>\n<li><strong>Slam</strong>: Clarified that this spell can be used on a creature.\n<ul>\n<li><em>Reaction</em>: Replaces Improved Damage. Allows Slam to be cast as a reaction.</li>\n</ul>\n</li>\n<li><strong>Slow Fall</strong>: Added advanced options\n<ul>\n<li><em>Improved Duration</em>: 5 min duration</li>\n<li><em>Navigate</em>: Can direct the movement of the fall.</li>\n</ul>\n</li>\n<li><strong>Submission Net</strong>: Refactored, the spell text was confusing. Now the focus is controlling targets and preventing Tech casting.\n<ul>\n<li><em>Electrified Net</em>: Allows dealing damage to trapped targets</li>\n<li><em>Anti-Tech</em>: Can cast as a reaction when creature casts tech</li>\n</ul>\n</li>\n<li><strong>Throw</strong>: Increased damage to d8. Added Medium or smaller restriction to push back.\n<ul>\n<li><em>Radial Blast</em>: Replaces Improved Force. Deals damage to all creatures within 2m sphere of initial target.</li>\n</ul>\n</li>\n</ul>\n<h2>Weapons</h2>\n<ul>\n<li>Added ML-77 Missile Launcher</li>\n<li>Added Collector Sniper Rifle</li>\n</ul>\n<h2>Bestiary</h2>\n<p>As the bestiary has grew a problem became terribly evident: there were too many low-CR monsters. If you want numbers, ~90%\nof the bestiary was found between CRs 1/8 and 3. This presents a primary problem for high-level characters because there\nwas a severe lack of content for them to run. So the bestiary &quot;bump&quot; is our redistribution of CRs, increasing the CRs of\nmost monsters. Monsters that have had CR increases have had their stat blocks updated to reflect those changes.</p>\n<p>The benefit of this change is distributing monsters throughout CR levels, which allows more opportunities boss battles\nand improves experience gain. As with most games, killing numerous low-level npcs is never as productive as killing a single\nhigh-level npc. This redistribution gives players across all levels more high-level monsters to fight.</p>\n<p>However, some will find issue that this feels like an overall &quot;nerf&quot; to their characters. I.e., in previous versions\na level 1 character could easily take out a variety of forces Cerberus &amp; Geth Troopers, Husks, etc. The new version\nincreases the difficultly of these &quot;starting&quot; monsters. We understand this is a drastic difference from the game and that\nlevel 1 characters will not feel as powerful. We would like to offer the following reconceptualization of level 1 characters:</p>\n<p>In the games, you play as Shepard, who is a highly-skilled, well-trained solder. You captain a ship and have achieved some\nof the highest ranks in the military. Thus, we see Shepard as a level 12-15 character and his/her ability to easily\nmow down opponents is due to their higher level. As a level 1 character, your still green. You may have some experience\nbut its not enough to easily down a whole platoon of cerberus troopers.</p>\n<p><strong>New</strong>:</p>\n<ul>\n<li>Elcor</li>\n<li>Harvester</li>\n<li>Klixen</li>\n<li>Pyjak</li>\n<li>Thresher Maw</li>\n<li>Varren</li>\n<li>Varren Alpha</li>\n<li>Yahg</li>\n</ul>\n",
    "id": "0-8-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.8.1 - New Races!",
    "description": "New Character Sheet and welcome the Prothean and Angara races",
    "date": "2018-06-20T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/3/39/AVATAR_OF_VENGEANCE.png/revision/latest/scale-to-width-down/1024?cb=20130330092722",
    "html": "<h2>Races</h2>\n<p>We've got 2 new races, thanks to Ben McPherson!</p>\n<h3>Protheans</h3>\n<p>You'll want to work with your GM on playing a Prothean, as they were wiped out 50,000 years before the first Mass Effect game.\nBut Javik was discover in an undamaged stasis pod, so its possible there are other surviving members of the race throughout\nthe galaxy. As a prothean you have acces to a unique set of skills but they're not without the constant badgering of interested\nparties wanting to know exactly <em>what</em> you are.</p>\n<h3>Angara</h3>\n<p>If you've set your campaign in Andromeda, Angara a available as a playable race. We'll be working on incorporating more\nAndromeda monsters and spells into the system, but this should give you enough to get started!</p>\n<h3>Other Changes</h3>\n<ul>\n<li>Added the Moderately and Heavily Armored feats to available starting traits.</li>\n<li>Clarified mechanic of Salarian's photographic memory. Before there was confusion about what score to &quot;double&quot;, especially if you already had expertise in the skill</li>\n</ul>\n<h2>Classes</h2>\n<h3>Infiltrator</h3>\n<ul>\n<li>Tactical cloak ends after 1 min or making an attack, casting a spell, using a grenade or mine, or firing a heavy weapon.</li>\n</ul>\n<h3>Sentinel</h3>\n<p><strong>Tech Armor</strong>: Tech armor suffered from scaling issues. I.e., it was too powerful at level 1 and too weak at higher levels.\nMany of the Tech Armor powers and enhancements have been updated to make the usefulness of the power scale.</p>\n<ul>\n<li>Removed the AC boost and damage resistance. Works similarly to Arcane Ward in 5th Edition, granting more temporary hit points.\nAdditionally, the ongoing tech point drain has been removed.</li>\n<li>Advanced, tech armor has resistance to all damage. Whenever you cast a spell, tech armor gains hit points equal to three\ntimes the spell level or tech points spent.</li>\n</ul>\n<p><strong>Bastion</strong></p>\n<ul>\n<li>Assault Armor: Creatures compelled to attack you while tech armor is active can make the saving throw again is they take damage from\na source other than you.</li>\n<li>Improved Tech Armor:\n<ul>\n<li>Initial, tech armor provides +1 AC.</li>\n<li>Advanced, tech armor has resistance to bludgeoning, piercing, and slashing damage.</li>\n</ul>\n</li>\n<li>Tech Armor Overload:\n<ul>\n<li>Initial, Increased range to 4m, added CON saving throw. Damage based on the remaining hit points of the tech armor.</li>\n<li>Advanced, range increased to 8m, creatures has disadvantage on the saving throw.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Mastermind</strong></p>\n<ul>\n<li>Biotic enfilade: Limited to 1 per short/long rest</li>\n</ul>\n<p><strong>Guardian</strong></p>\n<ul>\n<li>Tech Aura:\n<ul>\n<li>Reactive, limited to Dex or Str saving throws.</li>\n<li>Speed, increased to 6m and can take the disengage action as a bonus action.</li>\n<li>Regen, shield point regen based on spellcasting modifier</li>\n</ul>\n</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Turbocharge</strong>: New combat power that provides burst fire to any weapon.</li>\n<li><strong>Nova</strong>: Improved damage is d12</li>\n<li><strong>Cryo Beam</strong>: Con save instead of dex save</li>\n</ul>\n<h2>Armor</h2>\n<ul>\n<li>+1 AC mod bonuses increased to 20,000 credits, considered to be a &quot;rare&quot; level mod. Armor set prices adjusted to reflect this change.</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Passive Perception now shows up on stat block</li>\n<li><strong>Adjutant</strong> &amp; <strong>Weakened Adjutant</strong>: Reaper infection is a melee attack with specific target.</li>\n</ul>\n<h2>Site Changes</h2>\n<ul>\n<li>Some monster skills did not properly reflect their ability scores</li>\n<li>Not all subclass features were showing up in the subclass tab</li>\n<li>Fixed bug in CR sorting of the bestiary</li>\n<li>Tech Armor was erroneously displaying as the Blackstar's 14th level subclass feature</li>\n<li>All class race combinations allowed in the NPC Generator</li>\n</ul>\n<h3>New Character Sheet!</h3>\n<p>The feedback from users has called for the desperate need for an updated character sheet, and we're happy to deliver.\nVeterans of 5th edition will not that the sheet might be a little unorthodox: AC on the back? ... Yes! When designing\nthis sheet we wanted to give a tactile action to starting an encounter. So when you roll for initiative, it means its time\nto flip your sheet and use all the combat information on the back. It's not perfect, there are a lot of class features\nthat act as combat abilities, but this is out first draft. In future iterations we even hope to create class specific\ncharacter sheets.</p>\n",
    "id": "0-8-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.8.2",
    "description": "Changelog for Mass Effect 5e version 0.8.2",
    "date": "2018-07-08T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/d/d1/Codex_ME3_-_data_placeholder.png/revision/latest?cb=20140823044128",
    "html": "<h2>General</h2>\n<ul>\n<li>Added information about <nuxt-link to=\"/manual/combat#cover\">cover</nuxt-link> (specifically targeting shooting through enemies)</li>\n<li>Added <nuxt-link to=\"/manual/beyond-first-level\">Multiclassing</nuxt-link> rules</li>\n</ul>\n<h3>Shields</h3>\n<ul>\n<li>Shield regeneration can also be triggered by taking full cover</li>\n<li>After triggering your shield regeneration with the Hide or Dodge action, your shields continue to regenerate at the start\nof your turn until you take damage or until the shields reach maximum capacity.</li>\n</ul>\n<h2>Classes</h2>\n<p>Barrier regens on a short rest.</p>\n<h3>Adept</h3>\n<p>The following features came from the wizard's progression D&amp;D 5th edition. However, in Mass Effect 5e, a 2nd level spell\nis equivalent to a 3rd/4th level spell in 5th edition. Thus, the following features were allowing very powerful, high-level\ncasts for free.\nBiotic Mastery - limited to 1st level spells\nSignature Biotics - limited to 1st &amp; 2nd level spells</p>\n<h3>Infiltrator</h3>\n<p>With the release of Xanathar's Guide to Everything, many of the following features have been updated or clarified. To match their\n5th edition counterparts, the following features have been updated:</p>\n<ul>\n<li>Shadow\n<ul>\n<li>Sudden Strike</li>\n</ul>\n</li>\n<li>Saboteur\n<ul>\n<li>Ear for Deceit, Eye for Detail, Insightful Fighting, Eye for Weakness</li>\n</ul>\n</li>\n</ul>\n<h3>Vanguards</h3>\n<p>Biotic Slash proved too costly as a subclass feature. It has been replaced with Biotic Fury (Barbarian's Divine Fury)\nand Relentless (Paladin's Relentless Avenger)</p>\n<h2>Spells</h2>\n<p>Biotic &quot;Higher Level&quot; spell effects have been doubled. This was a major oversight in the way spell damage was handled. We\nfollow the DMG's recommendations for spell damage, but ME5e spells cap at 5th level. A 1st level spell in this\nsystem is equivalent to a 1st or 2nd level in 5th Edition. 2nd =&gt; 3rd or 4th. Therefore, in this system, when you cast a\n1st level spell as 2nd level, the spell is increased by 2 levels (not 1). Therefore the benefits should be doubled.</p>\n<p>Additionally the range of most spell attacks has been increased.</p>\n<ul>\n<li><strong>Alter Center Mass</strong>: Increased range\n<ul>\n<li><em>Debilitate</em>: reduces speed and buffs AoE attacks on the target</li>\n</ul>\n</li>\n<li><strong>Catapult</strong>: Improved spell text.\n<ul>\n<li><em>Salvo</em>: Max to number of targets</li>\n<li><em>Counterstrike</em>: Potential counterspell</li>\n</ul>\n</li>\n<li><strong>Lance</strong>: Increased Range.\n<ul>\n<li><em>Anti-shield</em> Lighting damage is in addition to force damage (not a replacement)</li>\n</ul>\n</li>\n<li><strong>Nova</strong>: Changed to a cantrip. Since it requires Barrier Ticks to cast, it did not make sense to add an additional resource cost.\n<ul>\n<li><em>Half Blast</em> adjusted for comparable damage to <em>Improved Damage</em>.</li>\n</ul>\n</li>\n<li><strong>Pull</strong>\n<ul>\n<li><em>Control</em> was removed and included in the spell. <em>Grip</em> added to provided a damage-dealing component to the spell.</li>\n</ul>\n</li>\n<li><strong>Reave</strong>: Overhauled. Now reflects how the spell works in the Mass Effect games.</li>\n<li><strong>Shockwave</strong>: Clarified the width of the line\n<ul>\n<li><em>Improved Distance</em> was removed and replaced with <em>Controlled Shockwave</em>, allowing the player to redirect the shockwave\nas it travels</li>\n</ul>\n</li>\n</ul>\n<h3>New</h3>\n<ul>\n<li>Biotic Slash, this replaces the Vanguards Biotic Slash feature as the feature proved too costly compared to other class features.</li>\n</ul>\n<h2>Site Changes - Mobile Site Refactor</h2>\n<p>Our analytics showed that ~50% of the site traffic was from mobile devices. So the primary focus of this update was to improve\nthe quality of the mobile site. Including</p>\n<ul>\n<li>Mobile views for search and filters</li>\n<li>Full screen dialogs</li>\n<li>Responsive tables</li>\n</ul>\n",
    "id": "0-8-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.8.3",
    "description": "Changelog for Mass Effect 5e version 0.8.3",
    "date": "2018-08-18T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/6/6a/Omega_-_samorinth_shodown.png/revision/latest/scale-to-width-down/640?cb=20140624123628",
    "html": "<h2>News</h2>\n<p>The news is that the News section is gone, replaced by these changelogs. My original idea was to have regular news updates\nwith interesting topics or rule clarifications, but who am I kidding...I've barely got enough time to work on the system, let\nalone making fun blog posts. So I'm scrapping the idea. Maybe I'll get to a point where I can bring it back. But for now,\nall news has been attached to its version.</p>\n<h2>Encounter Builder</h2>\n<p>Thanks to RexThePig who created a spreadsheet of the Mass Effect 5e Bestiary. This spreadsheet can be imported into\nKobold Club's encounter building tool. We've added <nuxt-link to=\"/guide/encounter-creation\">instructions</nuxt-link> on how to do this.</p>\n<h2>Classes</h2>\n<h3>Engineer</h3>\n<p>The Engineer's Drone ability was ineffective at later levels and didn't scale like other class signature abilities. Summoned drones\nnow benefit from the engineers level with additional hit point and damage/healing.</p>\n<p>In addition, the Drone Jockey subclass was under performing because the drone kept dying in our playtests. We've increased it's\nsurvivability by removing the lightning vulnerability and providing additional hit points and shield points.</p>\n<h2>Bestiary</h2>\n<p>Added images to bestiary</p>\n<p>Mass Accelerator Machine Gun attacks are now ranged weapon attacks. This affects the following monsters:</p>\n<ul>\n<li>Sentry Turret</li>\n<li>Turret</li>\n<li>Geth Colossus</li>\n<li>Geth Armature</li>\n</ul>\n<p>Added INT saving throw for the following geth, making them harder to affect with AI Hacking.</p>\n<ul>\n<li>Geth Armature</li>\n<li>Geth Colossus</li>\n<li>Geth Prime</li>\n<li>Geth Hunter</li>\n</ul>\n<p><strong>New</strong></p>\n<ul>\n<li>YMIR Mech</li>\n<li>LOKI Mech</li>\n<li>FENRIS Mech</li>\n<li>Rachni Worker</li>\n<li>Rachni Soldier</li>\n<li>Rachni Brood Warrior</li>\n<li>Rachni Queen</li>\n</ul>\n<h2>Armor Mods</h2>\n<p>Added Jetpacks and Jump Jets, giving players more movement options from armor mods.</p>\n<h2>Spells</h2>\n<p>With these spell changes we've officially finished our Biotic Spell review. Special thanks to TheMarmotKing for taking\nthe lead on this. We feel the spells are much more balanced and fun.</p>\n<p><strong>Annihilation Field</strong></p>\n<ul>\n<li>Reduced range to 4m</li>\n<li>I've been wanting to get rid of the -1AC advanced options for a while. The originally represented reduced armor. In Mass\nEffect, that's great, because it effects enemies with &quot;Armor&quot; (i.e., a yellow health bar). But the translation gets muddled when\nmapped onto Armor Class, which is a concept not a physical thing. <em>Disorient</em> isn't that original, but giving anything\ndisadvantage is pretty useful.</li>\n</ul>\n<p><strong>Backlash</strong></p>\n<ul>\n<li>Added the note that this applies to the triggering attack.</li>\n<li>Changed the wording to allow this to block damage from ranged spell attacks (not just weapon attacks)</li>\n<li>Added note that reflecting damage cannot be triggered by a heavy weapon (they're technically ranged attacks)</li>\n<li>Reduced the higher level hp increase to 10 instead of 20. At +20 hp, a 5th level cast was 75 additional hp...seemed a\nbit much. This also brings the spell in line with 5th's Armor of Agathys.</li>\n<li>In the same vein, removed the additional hp at higher level casts from Durable advancement. Total hp gain on durable\nis now 60 instead of 75.</li>\n<li>Clarified the issue with remaining damage and reflecting damage back at the attacker with &quot;If damage that would be dealt\nto the aegis...&quot;. RAW would be: Aegis has 1HP remaining. Player is hit with a ranged weapon attack for 10 damage. First,\nsplit the damage (5 and 5). 5 is dealt back at the attack. 1 is dealt to the aegis. 4 is dealt to the player.</li>\n</ul>\n<p><strong>Biotic Orbs</strong></p>\n<ul>\n<li>Now a concentration spell, limiting potential spamming of higher level casts and prevents spell from stacking</li>\n<li>Casting a spell costs orbs, clearing up the casting mechanic</li>\n<li>Added action cost to the ranged attack</li>\n<li>Defensive orbs was underpowered compared to improved orbs. Retribution has more potential and works as a panic button\nto get use out of the orbs if the player's concentration fails</li>\n</ul>\n<p><strong>Biotic Sphere</strong></p>\n<ul>\n<li>Keeps out all hostile creatures, consequently removes the advantage on creatures within it.</li>\n<li>Increased hit points</li>\n<li>Clarifies how the damage and attacks are delegated. Essentially, when you're in the barrier, you can't be hit. The barrier takes all the damage.</li>\n<li>Because this represents an increase in the spells power, and the fact that biotic wall is also a 3rd level spell, this spell was made 4th level</li>\n<li><em>Infuse ammo</em> doesn't reduce the sphere's hp and increased the damage to 1d6</li>\n<li><em>Armored</em> gained resistance to thunder damage. 100 hp with resistance to the most standard damage types seemed a bit much, so reduced the starting hp to 75</li>\n</ul>\n<p><strong>Biotic Wall</strong></p>\n<ul>\n<li>using cm instead of inches (for consistency)</li>\n<li><em>Shifting wall</em> is a bonus action, not reaction because there was nothing to trigger the reacgion</li>\n</ul>\n<p><strong>Dark Sphere</strong></p>\n<ul>\n<li>Now the sphere moves at the end of your turn and detonates at the start of your turn if its traveled 20m. This prevents\nthe possibility of the sphere moving at the start of your turn AND detonating.</li>\n<li>Instead of the sphere's explosion causing another primed effect, it now detonates targets.</li>\n<li><em>Control</em> has the option to increase the speed (getting it to 20m in as little as 3 rounds)</li>\n</ul>\n<p><strong>Dominate</strong></p>\n<ul>\n<li>3rd level spell</li>\n<li>Adjusted to work similarly to it's 5th edition counterpart</li>\n<li>Upped psychic damage to make it more attractive</li>\n</ul>\n<p><strong>Flare</strong></p>\n<ul>\n<li>Increased range.</li>\n</ul>\n<p><strong>Fly</strong></p>\n<ul>\n<li>There was an error that showed an old version of Lift for this spell. Fly now works similarly to 5th edition's fly spell</li>\n</ul>\n<p><strong>Lash</strong></p>\n<ul>\n<li>Lash used to cost barrier ticks and automatically hit. The barrier tick cost was removed, but not the auto-hit, making\nthis spell too powerful. The auto-hit has been replaced with a ranged spell attack.</li>\n</ul>\n<p><strong>Singularity</strong></p>\n<ul>\n<li>Str save, no dex saves</li>\n<li><em>Necrotic field</em> replaces <em>Damage</em>. It buffs the damage and happens every turn to any creature in the field (despite\nif they're affected by the spell or not). Additionally, they're also primed (necrotic) which would set off 2 detonations\nif the target is also lifted. Necrotic field is a great advancement for people who want to set up combos but don't care\nmuch about the control aspect.</li>\n</ul>\n<p><strong>Stasis</strong></p>\n<ul>\n<li>Increased the range, reduced the duration</li>\n<li>Targets in stasis have damage resistance as they did in the Mass Effect games</li>\n<li>Vulnerable advancement option didn't make sense because of the damage resistance, this was changed to shatter,\nwhich builds up damage over time.</li>\n</ul>\n<p><strong>Storm</strong></p>\n<ul>\n<li>Added half damage on successful save</li>\n</ul>\n<p><strong>Warp</strong></p>\n<ul>\n<li>Increased range.</li>\n<li>Clarified what it meant to stabilize a creature. In 5th, you can only stabilize an unconscious creature, so this simply states what needs to be done.</li>\n<li>Removed the &quot;knocked prone&quot; portion of &quot;Keel Over&quot; as this inhibits ranged attacks. Because of this, it needed to be renamed, Disorient.</li>\n</ul>\n<p><strong>Vortex</strong></p>\n<ul>\n<li>Damage was lacking. 3rd level AoE spell should be about 31-36 damage. Bumped to 6d10 for 33 dmg.</li>\n<li>Updated <em>radial</em> to explain the spell is still centered on caster's location.</li>\n</ul>\n",
    "id": "0-8-3",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v0.8.4",
    "description": "Printable PDF",
    "date": "2018-08-26T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/e/eb/Noveria-Mira_core_activation_mini-game.png/revision/latest?cb=20090220023955",
    "html": "<p>I was hesitant to bump the version because only two things have changed. But...</p>\n<h3>Spells</h3>\n<p><strong>Throw</strong>: Advanced Option incorrectly had damage listed as d8 (now d12)</p>\n<h3>PDF / Offline Version of Rules</h3>\n<p>I've received number of emails asking about a printable PDF and/or an offline version of the rules. So I'm happy\nto finally deliver. It's far from perfect. To reduce the amount of work, the &quot;PDF&quot; is generated from components on the\nwebsite. Therefore, links and buttons might not work as expected. But, it's at least a working pdf that contains all the\ninformation on the site. You can also cache the page to your phone or computer (if you'll be without internet) and have\nan offline version. There are instructions on how to do this on the page.</p>\n<p><nuxt-link to=\"/assets\">PDF of Rules</nuxt-link></p>\n",
    "id": "0-8-4",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Happy N7 Day!!!",
    "description": "We have a lot of fun changes for Mass Effect 5e in version 0.9.0",
    "date": "2018-11-08T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/a/a1/N7_Logo.jpg/revision/latest/scale-to-width-down/640?cb=20141110080319",
    "html": "<br>\n<h1>v0.9.0</h1>\n<br>\n<h2>Vehicles</h2>\n<p>We have a new <nuxt-link to=\"/manual/vehicles\">section of rules</nuxt-link> related to vehicles and starships!!!</p>\n<br>\n<h2>Classes</h2>\n<p>Looking back at the history of the changelog, I realized that classes had become pretty wild. My initial approach to creating\nclasses had been: start with a 5th edition concept and plug in features from other classes that seem to work. Essentially,\nthis was horrible game design.</p>\n<p>Each class and subclass needs a concept. In some cases, the translation from 5th\nedition to Mass Effect was easy, and the concept was well defined. Adepts are a great example: they're glass-cannons. Each\nadpet subclass also had a unified concept. Commandos dish out huge amounts of single target damage, focusing on\nforce-type biotic powers. Blackstars were control experts. Disruptors had the most AoE potential and had benefits to\nnecrotic powers. Unfortunately, all the other classes and subclasses fell short (with a few exceptions).</p>\n<p>The engineers were severely underpowered. This was an inherent problem with the variable (X-cost) casting mechanic.\nThe infiltrator subclasses looked like I'd taken all of the rogue subclasses, shaken them up in a bag, and randomly drawn out some features\nfrom each. One major oversight was that infiltrators lacked a true sniper rifle class, which was their primary weapon in\nthe Mass Effect games. Soldiers seemed uninspired. Vanguards had everything plus the kitchen sink thrown into their progression tables.\nAnd sentinels felt too much like a multiclasses engineer/adept.</p>\n<p>Therefore, classes have received a number of significant changes. For each class and subclass, I started with a concept and made sure the\nbase class reflected that concept. The base class concepts are rooted in how the class played in the Mass Effect games.\nThe subclasses are unique creations that focus on a particular aspect of the base class.</p>\n<h2>Adepts</h2>\n<p>The adepts were generally fine and should feel like they did in v0.8.4. However the number of spell slots have been\nreduced to match the spell progression of &quot;full-casters&quot; in 5th edition (clerics, druids, bards, sorcerers, wizards).\n<em>Note: ME5e spells are squished by 2. I.e. a 1st-level spell in ME5e is in between a 1st/2nd-level spell in 5th edition</em>.\nInstead of set levels in which an Adept learns new spells, they can learn new spells at every level, giving them many\nmore opportunities to advance their arsenal.</p>\n<h2>Engineers</h2>\n<p><strong>Concept</strong>: Versatile casters.</p>\n<p><strong>Subclass Concepts</strong>: Drones, Healing, Strategy</p>\n<p>The Engineer tech point system has been overhauled. Instead of tech spells having a variable cost, tech spells have spell\nlevels. Engineers use tech points to cast those spells, requiring one tech point for each level of the spell they want to cast:\n1 tp = 1st level, 2tp = 2nd level, etc. This is a very minor change to 5th editions spell slot system, but it gives the\nengineers a greater amount of versatility. Should I keep casting pot shots for 1 tech point? Or should I pump all of\nmy tech points into a spell for a huge payoff. They're still limited in how many tech points they can spend (a 50th level\nincinerate is just a bit OP...). But they have the option of casting 50 1st-level incinerates or 10 5th-level incinerates,\nwhereas traditional casters are limited by their spell slots. This makes engineers adaptable to any situation.</p>\n<p><strong>Drone Jockey</strong>\nDrone Jockeys remain unchanged.</p>\n<p><strong>Medic</strong>\nMedics remain unchanged.</p>\n<p><strong>Mastermind</strong>\nMasterminds are always one step ahead of their enemies. Moved from the Sentinel class, masterminds are highly-intellectual and skilled individuals.</p>\n<ul>\n<li><em>enfilade</em> detonate primed enemies with your reaction, setting up the perfect combo</li>\n<li><em>jack of all trades</em> general ability in all skills</li>\n<li><em>extra attack</em></li>\n<li><em>tactical advantage</em> grants you bott advancement options for all your advanced spells, making any strategy possible</li>\n<li><em>spell steal</em> is your ultimate trump card against other casters</li>\n</ul>\n<br>\n<h2>Infiltrators</h2>\n<p><strong>Concept</strong>: Stealthy combatants that fight from the shadows. The parity between Rogues and Infiltrators is self-evident, so the infiltrator base class is heavily based on rogues.</p>\n<p><strong>Subclass Concepts</strong>: Melee, Sabotage, Sniper Rifles</p>\n<p>Though Infiltrators had a number of interesting combat options, Tactical Cloak proved too powerful to pass up in playtesting.\nEach round of an infiltrator's turn consisted of Attack, Tactical Cloak, Move. With tactical cloak always on,\nthe infiltrator rarely suffered damage could always apply their sneak attack damage. This made for rather boring combat.</p>\n<p>Another issues was multiclassing an Engineer with 2 levels of Infiltrator provided more opportunities for tactical cloak\nthan a full infiltrator.</p>\n<p>To fix these issues, Tactical Cloak uses are limited to two users per short rest, increasing based on infiltrator level.</p>\n<p><strong>Shadow</strong>\nFocus on melee attacks, closing distance, and sneaking up on targets.</p>\n<ul>\n<li><em>up close and personal</em> increases your sneak attack damage with melee weapons</li>\n<li><em>silent cloak</em> allows you to close distance without being noticed.</li>\n<li><em>melee prowess</em> improves your melee weapon attacks and damage</li>\n<li><em>shadow strike</em> improves your tactical cloak, allowing you to close distance, escape movement impairing effects, and strike targets</li>\n<li><em>death strike</em> grants an opportunity to deal devastating damage with a single opening attack</li>\n</ul>\n<br>\n<p><strong>Sniper</strong>\nFocus on using sniper rifles, giving infiltrators a subclass that references their Mass Effect counterpart</p>\n<ul>\n<li><em>steady aim</em> a powerful feature making this subclass deadly with a sniper rifle</li>\n<li><em>careful eyes</em> find targets even when they're hidden</li>\n<li><em>overwatch</em> monitor the battlefield and attack any creature that tries to move out of cover</li>\n<li><em>killshot</em> improved sneak attack damage with sniper rifles.</li>\n</ul>\n<br>\n<p><strong>Saboteur</strong>\nSaboteurs control the battlefield using distractions, tech powers, and sabotage. Very similar to arcane tricksters.</p>\n<ul>\n<li><em>saboteur's touch</em> sabotage enemy weapons</li>\n<li><em>combat heuristics</em> regain tech points every time you take down an enemy</li>\n<li><em>tactical ambush</em> increase the effectiveness of your spells when you use them from tactical cloak</li>\n<li><em>misdirection</em> make sure you're never hit in combat again</li>\n<li><em>saboteur's reflexes</em> rule the first round of combat by taking two turns</li>\n</ul>\n<br>\n<h2>Sentinels</h2>\n<p><strong>Concept</strong>: Tanks and combat leaders</p>\n<p><strong>Subclass concepts</strong>: Leadership, Survivability, Support</p>\n<p>Sentinels felt too much like a multi-classed adept and engineer. The new sentinel progression attempts to provide a\nunique spellcasting experience for the class, utilizing the warlock progression from 5th edition.</p>\n<p>Tech Armor was proving too powerful at high levels, granting as much as 300 additional hit points. The number of uses\nper long rest has been reduced to 2.</p>\n<p>Finally, the stat split for sentinels is over. Choosing between Wisdom and Intelligence was too much of a hindrance\nand didn't make sense with the simplified spell system. Charisma is now a sentinel's spellcasting modifier.</p>\n<p><strong>Bastion</strong>\nBastions are combat leaders. Their features are based on the Warlord concept from Mike Mearls. Whereas masterminds\nfocus on increasing their own combat potential, bastions focus on increasing the potential of their party members.</p>\n<ul>\n<li><em>master tactician</em> increases the range of Help action and allows it as a bonus action</li>\n<li><em>tactical focus</em> choose an area of the battlefield and apply a unique tactic, the number of tactics and size of the area increases as you level</li>\n<li><em>every ready</em> make sure you're never surprised again and keep yourself at the top of the initiative order</li>\n<li><em>call the shots</em> sacrifice your action to bolster your allies and inhibit your enemies</li>\n<li><em>tactical maneuvers</em> direct your troops around the battle field</li>\n<li><em>synchronized assault</em> give your allies an additional action</li>\n</ul>\n<br>\n<p><strong>Juggernaut</strong>\nJuggernauts are living tanks, nearly impossible to kill.</p>\n<ul>\n<li><em>assault armor</em> keep the action on you</li>\n<li><em>hardened tech armor</em> increased ac and nullify critical hits</li>\n<li><em>advanced tech armor</em> keep your tech armor alive by gaining hit points when you cast spells</li>\n<li><em>unyielding assault</em> avoid becoming paralyzed, stunned, or frozen</li>\n<li><em>adaptive tech armor</em> gain resistance to the last type of damage you took</li>\n</ul>\n<br>\n<p><strong>Guardian</strong>\nUltimate support specialists. They can buff the party but their expertise helps in non-combat situations. Overall, guardians\nremain similar to their previous iterations. The primary change is that they are no longer limited to learn specific auras,\nand their auras last 10 minutes.</p>\n<h2>Soldiers</h2>\n<p><strong>Concept</strong>: Weapon masters and combat experts.</p>\n<p><strong>Subclass Concepts</strong>: Combat Prowess, Weapon focus, EXPLOSIONS!!!</p>\n<p><strong>Havoc Subclass</strong>\nHavoc soldiers do just that, cause havoc. They do so by using grenades, heavy weapons, and more powerful combat powers.</p>\n<ul>\n<li><em>advanced weapon holsters</em> allow havoc soldiers to bring more guns into a fight</li>\n<li><em>makeshift grenades</em> never run out of grenades again, use your omni-gel to create new ones</li>\n<li><em>advanced combat powers</em> do more with your combat powers</li>\n<li><em>heavy weapon hack</em> never run out of heavy weapon charges, use your omni-gel to create new ones</li>\n<li><em>paint by number</em> target and fire your heavy weapons in the same round.</li>\n</ul>\n<br>\n<p><strong>Weapon Master</strong>\nWeapon masters specialize in a single weapon. Mostly unchanged from the previous version, except their superiority die-type\nincreases with their level.</p>\n<p><strong>Gladiator</strong>\nBased on the Samurai of 5th Edition's Unearthed Arcana. Gladiators revel in te challenge of combat and are extremely\ndifficult to kill. Their fighting spirit gives them incredible advantage in combat and can even prevent death.</p>\n<h2>Vanguards</h2>\n<p><strong>Concept</strong>: war-casters that use high-risk, high-reward tactics</p>\n<p><strong>Subclass Concepts</strong>: Melee, Shotguns &amp; Charge, Biotic Powers</p>\n<p>Vanguards spellcasting has been adjusted to &quot;half-caster&quot; level (paladins &amp; rangers), requiring more emphasis on barrier\nmanipulation and close-quarter combat. However the nemesis subclass was reworked to provide a ranged option for vanguards\nwith unique biotic talents.</p>\n<p>Vanguards can also learn combat powers instead of learning new cantrips.</p>\n<p><strong>Battle Master</strong>\nBattle masters use their barrier ticks to create unique opportunities in combat. New features have been introduced that\nincrease their melee combat potential.</p>\n<ul>\n<li><em>biotic maneuvers</em> unique talents that can be applied using barrier ticks</li>\n<li><em>biotic focus</em> greatly increase your melee combat potential</li>\n<li><em>improved barrier</em> increase the potency of your barrier</li>\n<li><em>extra attack</em> gain an additional attack with this subclass,</li>\n<li><em>opportunist</em> use your reaction to strike creatures that have been hit with other attacks</li>\n</ul>\n<br>\n<p><strong>Shock Trooper</strong>\nShock troopers are built around the charge cantrip, jumping from enemy to enemy, and closing distance for shotgun blasts.</p>\n<ul>\n<li><em>biotic bull rush</em> improves the charge cantrip and grants an additional weapoin attack</li>\n<li><em>stunning strike</em> further improves the charge cantrip by adding a potential stun</li>\n<li><em>shotgun savvy</em> allows you to apply brutal critical and zero-sum to your shotgun attacks</li>\n<li><em>onslaught</em> greatly improves the damage of charge</li>\n<li><em>a touch of force</em> adds a bonus to weapon attacks</li>\n<li><em>blitz</em> lets you use charge as a reaction</li>\n</ul>\n<br>\n<p><strong>Nemesis</strong>\nNemesis vanguards focus on biotic powers and range. While they lack the biotic potential of adepts, they make up for it with survivability.</p>\n<ul>\n<li><em>biotic recovery</em> regenerates spell slots</li>\n<li><em>metabiotics</em> grants powerful augmentations to your biotic spells</li>\n<li><em>biotic attacks</em> take advantage of your extra attack by reducing the casting time of specific spells to an attack</li>\n<li><em>biotic fury</em> apply the benefits of zero-sum and brutal critical to your biotic spells</li>\n<li><em>teleporting dodge</em> stay out of harms way</li>\n<li><em>bombardment</em> deal even more damage with your biotic spells</li>\n</ul>\n<br>\n<h2>Races</h2>\n<h3>Quarians</h3>\n<ul>\n<li>Use omni-gel to patch their suit.</li>\n</ul>\n<h3>Geth</h3>\n<ul>\n<li>Armor rules improved</li>\n<li>Soldier's hunter mode improved.</li>\n<li>removed keen senses</li>\n</ul>\n<h3>Salarian</h3>\n<ul>\n<li>clarified that salarians gain a short rest in 4 hours</li>\n</ul>\n<h3>Turian</h3>\n<ul>\n<li>added additional weapon proficiency</li>\n</ul>\n<h3>Unshackled AI</h3>\n<ul>\n<li>Armor rules improved</li>\n<li>removed keen senses</li>\n</ul>\n<h3>New Race Concepts</h3>\n<p>While not official races, you can check out the Hanar and Elcor concepts in the new Found Codices section.</p>\n<h2>Spells</h2>\n<ul>\n<li><strong>ai hacking</strong> adjusted text to resemble dominate\n<ul>\n<li><em>power down</em> replaces damaging advancement, allows you to incapacitate the target</li>\n</ul>\n</li>\n<li><strong>ballistic blades</strong>\n<ul>\n<li><em>exploding blades</em> thunder damage reduced</li>\n</ul>\n</li>\n<li><strong>barrier detonation</strong> added length, changed to Strength saving throw, targets with shields have advantage on the saving throw, clarified advancements</li>\n<li><strong>behive</strong> damage increased by 1d6\n<ul>\n<li><em>remote deploy</em> allows firing beehive as a reaction as well</li>\n</ul>\n</li>\n<li><strong>concussive shot</strong> damage increases with level.\n<ul>\n<li><em>stunning shot</em> con save happens instead of str save</li>\n</ul>\n</li>\n<li><strong>charge</strong>: Is a ranged spell attack with a single target.\n<ul>\n<li><em>Stunning blow</em> removed (too powerful for a cantrip), replaced with <em>Area Charge</em> for AoE potential.</li>\n</ul>\n</li>\n<li><strong>cryo beam</strong> updated as a 2nd level spell, increased damage, allows continual casting</li>\n<li><strong>cryo blast</strong> updated as a 1st level spell, aoe slow spell that better represents its in-game counterpart, increased range</li>\n<li><strong>decoy</strong> adjusted to reflect 5th edition's mirror image</li>\n<li><strong>defense matrix</strong> adjusted to reflect 5th edition's shield of faith</li>\n<li><strong>disrupt biotics</strong> adjusted to reflect 5th edition's counterspell\n<ul>\n<li><em>psychic strain</em> deals more damage</li>\n</ul>\n</li>\n<li><strong>electric slash</strong> updated as 2nd level spell</li>\n<li><strong>energy drain</strong> updated as 1st level spell, increased range</li>\n<li><strong>first aid</strong> updated as 1st level spell</li>\n<li><strong>flamethrower</strong> updated as 3rd level spell</li>\n<li><strong>fortification</strong>\n<ul>\n<li><em>venting fortification</em> works on next melee attack, does not require omni-tool</li>\n</ul>\n</li>\n<li><strong>guidance</strong> changed to bonus action, increased range</li>\n<li><strong>havoc strike</strong> increased usage to twice per long rest</li>\n<li><strong>hawk missile launcher</strong> casting time increased to bonus action\n<ul>\n<li><em>three-headed beast</em> replaces <em>improved damage</em>. Can distribute damage among three targets.</li>\n</ul>\n</li>\n<li><strong>incinerate</strong> updated as 1st level spell</li>\n<li><strong>neural shock</strong> charisma save, updated as 1st level spell</li>\n<li><strong>nightshade blades</strong> adjusted. 3 uses per short rest (pending you recover your blades). con save to prevent poisoned condition, but no additional damage.</li>\n<li><strong>overload</strong> updated as 1st level spell</li>\n<li><strong>poison spray</strong> updated as 1st level spell</li>\n<li><strong>sabotage</strong> updated as 1st level spell\n<ul>\n<li><em>multi weapon</em> replaced with <em>primed</em> which primes a target after firing the weapon</li>\n</ul>\n</li>\n<li><strong>salvo</strong> updated as a 1st level spell</li>\n<li><strong>sentry turret</strong> updated as 4th level spell</li>\n<li><strong>shocking grasp</strong> updated as 1st level spell</li>\n<li><strong>siege pulse</strong> casting time increased to an action. number of times you can use the feature is a gamble, at least once per short rest.\n<ul>\n<li><em>improved pulse</em> add your CON modifier to the DC</li>\n<li><em>lingering pulse</em> only effects targets that take the psychic damage.</li>\n</ul>\n</li>\n<li><strong>snap freeze</strong> completely reworked, creating a (hopefully) fun and unique spell</li>\n<li><strong>stimulant pack</strong> works like 5th editions bless</li>\n<li><strong>submission net</strong> updated to a 2nd level spell</li>\n<li><strong>tactical scan</strong> updated to work more like Insightful Fighting</li>\n<li><strong>target painting</strong> updated as a 1st level spell</li>\n<li><strong>unity</strong> changed to an AoE healing spell, similar to mass heal</li>\n</ul>\n<br>\n<h2>Weapons</h2>\n<ul>\n<li><strong>Charge</strong> mechanic was removed as a &quot;standard&quot; mechanic, now explained on the individual weapons.</li>\n</ul>\n<br>\n<h2>Omni-tool Programs</h2>\n<p>These using programs can utilize omni-gel or be programed into your omni-tool. They supplement many of the missing\nfeatures from wonderous items.</p>\n<h2>Other</h2>\n<h3>Conditions</h3>\n<ul>\n<li><strong>Frozen</strong> targets are considered primed (cold)</li>\n<li><strong>Unprotected</strong> condition has been removed</li>\n</ul>\n<h3>Backgrounds</h3>\n<ul>\n<li><strong>Experiment</strong> Background added</li>\n</ul>\n<h3>Tools &amp; Kits</h3>\n<ul>\n<li>Armor and Weapon tools can repair guns and armor looted from the battlefield, allowing the items to be sold.</li>\n<li>Startship system kits have been finalized</li>\n</ul>\n<br>\n",
    "id": "0-9-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Road to Version 1.0",
    "description": "Additions and playtesting changes",
    "date": "2018-12-15T05:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/9/9f/Normandy_using_a_Mass_Relay_01.jpg/revision/latest/scale-to-width-down/640?cb=20090127140715",
    "html": "<br>\n<h1>v0.9.1</h1>\n<p>For those unfamiliar with software development, any sub-1.0 version is generally considered &quot;in beta&quot;, which basically means\nan incomplete product. v0.9.0 brings us to the cusp of moving beyond beta and into a true production release. But making\nthe next step will take time and lots of playtesting. First, it is very unlikely there will be anymore major overhauls\nwith the system. At this point, everything is mostly in place and moving from v0.9.0 to v1.0.0 encompass a lot of minor\ntweaks based on playtesting and additional items like vehicles, spells, and omin-tool programs to round out the system.</p>\n<br>\n<h2>Classes</h2>\n<h3>Engineer</h3>\n<ul>\n<li>Summoned drones now gain additional benefits from the players' prof bonus. Prior, the bonus was only to the damage and\nhealing rolls. Now you can add your proficiency bonus to all skill checks, saving throws, attack rolls, and damage and healing.</li>\n</ul>\n<h3>Sentinel</h3>\n<p>I've received a lot of great feedback about the changes to the Sentinel class. Mostly, everyone enjoys the overall refactor,\nbut much of the feedback focused on the use of CHA as the Sentinel's spellcasting modifier. Many felt this change was either\nconfusing or didn't fit the Mass Effect lore.</p>\n<p>These types of nuances can be difficult, specifically which abilities apply to which classes. There is already a high premium\non Dexterity, due to the sheer number of ranged weapons, and a high premium on Intelligence, due to the fact this this is\nSci-fi and a lot of skills require Intelligence (Engineering, Electronics, Science). Admittedly, this change was an attempt\nto bring some balance to the spellcasting skills; an attempt to equalize the use of CHA, WIS, and INT in spellcasting modifiers.\nBut the flavor text to support this change wasn't enough.</p>\n<p>Thus, I've changed the Sentinel's spellcasting mod to be player/GM choice. Although this technique might be unheard of,\nI feel it allows each group of players to decide which spellcasting ability makes the most sense to the group:</p>\n<p>INT: The sentinel uses a high IQ to multi-task in combat and find strategic locations to place spells\nCHA: The sentinel uses willpower to overcome the mental strain and innate talents or brute force when casting spells\nWIS: The sentinel uses intense focus and practiced patience or combat insight when using spells</p>\n<p>As a GM, work with your sentinel operatives to decide what you'd like to use for your campaign, or, based on the operative's\nbackstory and roleplay, let them choose!</p>\n<h3>Vanguard</h3>\n<p><strong>Shocktrooper</strong></p>\n<ul>\n<li><em>Biotic bull rush</em>. Bonus distance increased to 20m to compensate for charge's increased distance.</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Charge</strong> I can honestly say that the Charge spell has changed more times than any other spell (and we're probably not finished).\nWe've playtested it as spell attack, and the damage was lacking. Moreover, a miss resulted in no movement (which is supposed\nto be a benefit of the power). The current iteration makes Charge a DEX save power, always providing movement and dealing\nsome minor damage if the creature fails its saving throw. There is no half damage on a successful save (keeping in line\nwith 5th edition cantrips). Additionally, the range and damage have been increased to 14m and 1d10, respectively.\n<ul>\n<li><em>Barrier Regen</em> To compensate for changes to Charge, the barrier regen has been reduced to 2 ticks instead of half\nof your ticks. When casting Charge, you will always gain barrier ticks, which is why the number was reduced.\nAlthough this breaks tradition with the Mass Effect advancements, this is one of those times where the video game\nmechanic doesn't mesh well with the D&amp;D combat system.</li>\n<li><em>Area Charge</em>. Increase the radius to 4m.</li>\n</ul>\n</li>\n<li><strong>Hawk Missile Launcher</strong>\n<ul>\n<li><em>Three-headed beast</em>. Clarified that the damage is split between the three missiles.</li>\n</ul>\n</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Oculus</li>\n<li>STG Agent</li>\n<li>Sniper</li>\n<li>Blue Suns faction\n<ul>\n<li>Centurion</li>\n<li>Heavy</li>\n<li>Legate</li>\n<li>Legionnaire</li>\n<li>Pyro</li>\n<li>Trooper</li>\n</ul>\n</li>\n<li>Blood Pack\n<ul>\n<li>Boom-Squad</li>\n<li>Pyro</li>\n<li>Trooper</li>\n<li>Warlord</li>\n<li>Warrior</li>\n</ul>\n</li>\n</ul>\n<h2>Other</h2>\n<ul>\n<li>Optional rules for Indoctrination can be found in the Found Codices section of the Appendix</li>\n</ul>\n",
    "id": "0-9-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 0.9.2",
    "description": "Updated races, new feats, and bug fixes",
    "date": "2019-02-03T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/4/4d/Council_Hologram-Ambassador_Meeting_2.png/revision/latest?cb=20091227112411",
    "html": "<h1>v0.9.2</h1>\n<p>I had to run the release of this version due to an error in v0.9.1 (the race pages were not being generated properly.\nI hoped to add some new spells from Ben, a lot of new monsters from Dakota P., a few new mods, and some more example vehicles.\nI still plan on adding those in the next couple of weeks.</p>\n<h2>Rules</h2>\n<h3>AC &amp; Armor</h3>\n<p>I've clarified the Armor &amp; AC table. Before Arms &amp; Legs were in the same row, which indicated that the AC bonus was for wearing arm <em>AND</em> leg armor.\nHowever, the intent is that Arm and Leg armor provide their own AC bonus.</p>\n<p>Additionally, I clarified that wearing pieces from different armor sets still provides the AC from the armor, but you do not get any set bonuses.\nIn a future patch, I plan to expand this further and make the set bonuses based on the number of pieces you are wearing.</p>\n<h2>Classes</h2>\n<p>Multiclassing proficiency gains have been improved for the following classes:</p>\n<ul>\n<li>Engineer, Assualt Rifles and Medium Armor</li>\n<li>Infiltrator, Sniper Rifles and Melee Weapons</li>\n<li>Sentinel, Medium and Heavy Armor, and 1 weapon type from Assault Rifles, Melee, Shotguns, or SMGs</li>\n<li>Soldier, Medium and Heavy Armor, and 2 weapon types</li>\n<li>Vanguard, Medium Armor and Shotguns</li>\n</ul>\n<h2>Races</h2>\n<p>Descriptions have been added to each race, largely sourced from <a href=\"https://www.gmbinder.com/share/-L7HA1pIhxcx3bVb8vqf\" target=\"_blank\">Races from the Relay</a> by <a href=\"https://www.reddit.com/user/thestray\" target=\"_blank\">/u/thestray</a>.</p>\n<p>Race changes below have been made for 2 reasons: Balance, based on <a href=\"https://docs.google.com/spreadsheets/d/1vq1kz6PRAbw5LHy6amH-bNb4OuB8DBXL1RsZROt03Sc/edit#gid=0\" target=\"_blank\">Detect Balance: a 5e Homebrew Race Guide</a> by Eleazzaar,\nand because the pervasiveness of starting feats for each race diluted the uniqueness of each race.</p>\n<h3>Asari</h3>\n<ul>\n<li>Removed <em>Skill Versatility</em> replaced with <em>Natural Diplomat</em></li>\n<li>combined <em>Biotic Initiate</em> and <em>Innate Biotics</em> into a single trait</li>\n<li>Added <em>Ardat-Yakshi</em> as a variant</li>\n</ul>\n<h3>Batarian</h3>\n<ul>\n<li>Removed feat options</li>\n<li>Added Four Eyes</li>\n</ul>\n<h3>Drell</h3>\n<ul>\n<li>Removed feat options</li>\n<li>Removed <em>Hallucinogen</em> as it is primarily flavor with very little game impact</li>\n<li>Removed <em>Darkvision</em> as there is no indication that Drell can see in the dark</li>\n<li>Replaced <em>Keen Senses</em> with <em>Natural Hunter</em> providing 2 skill proficiencies from a list</li>\n<li>Added <em>Raw Agility</em> allowing speed boosts</li>\n</ul>\n<h3>Elcor</h3>\n<ul>\n<li>Removed <em>Unstealthy</em>, given some technology they could be stealthy and quiet</li>\n<li>Removed <em>Stability</em>, for balancing reasons. High AC already assists in their defensive capabilities</li>\n<li>Changed <em>Thick Hide</em>, bonus is not restricted to not wearing armor. Use Con instead of Dex</li>\n<li>Added <em>Shoulder Mounts</em>, explains how elcor use ranged weapons.</li>\n</ul>\n<h3>Geth</h3>\n<ul>\n<li>Changed <em>Repair Matrix</em>, geth cannot be healed by medi-gel or spells that target organic creature. Instead they can spend\nhit die as an action.</li>\n</ul>\n<h3>Hanar</h3>\n<ul>\n<li>Completely reworked.</li>\n</ul>\n<h3>Humans</h3>\n<ul>\n<li>Made humans in line with D&amp;D 5th Edition. The variant human is available.</li>\n</ul>\n<h3>Krogan</h3>\n<ul>\n<li>Adjusted ability score increases to +2 CON and +1 STR</li>\n<li>Removed <em>Natural Armor</em>, replaced with <em>Toughness</em>. Wanted Krogans to be tough to kill, not tough to hit.</li>\n<li>Replaced <em>Rage</em> with <em>Blood Rage</em>, as it better represents their relentlessness.</li>\n<li>Removed <em>Relentless</em> as it is better reflected by <em>Blood Rage</em></li>\n<li>Added <em>Extremophile</em> from Races from the Relay, as it better represents their ability to survive</li>\n</ul>\n<h3>Prothean</h3>\n<ul>\n<li><em>All eyes on you</em> and <em>Avatar</em> moved to the flavor/about section as they had little game impact.</li>\n</ul>\n<h3>Quarian</h3>\n<ul>\n<li>Ability scores reduce to two +1's (DEX and INT). Additional scores are gained from the cybernetic enhancements</li>\n<li><em>Cybernetic Enhancement</em> adds greater variety (thanks to Races from the Relay for the ideas).</li>\n<li><em>Hermetic suit</em> now requires critical damage to be of puncture or slashing type to breach the suit.</li>\n</ul>\n<h3>Salarian</h3>\n<ul>\n<li>Removed starting feat. Replaced with <em>Twice as Bright</em> which provides skill and tool proficiencies.</li>\n</ul>\n<h3>Turian</h3>\n<ul>\n<li>Changed ability score increase to +1 of all the body traits</li>\n<li>Removed <em>Turian Toughness</em></li>\n<li>Added <em>Brothers-in-Arms</em> (basically pack tactics)</li>\n<li>Added Athletics proficiency to martial training.</li>\n</ul>\n<h3>Unshackled AI</h3>\n<ul>\n<li>Removed, now are a variant race of <nuxt-link to=\"/species/geth\">geth</nuxt-link>.</li>\n</ul>\n<h3>Volus</h3>\n<ul>\n<li>Added <em>Hermetic Suit</em> because they have one.</li>\n</ul>\n<h3>Vorcha</h3>\n<ul>\n<li>Removed <em>Hungry Jaws</em> and <em>Bloodlust</em> Neither had much to do with Vorcha.</li>\n<li>Added <em>Adaptation</em> providing some unique benefits based on the vorcha's environment</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Hawk Missile Launcher</strong>. Cooldown increased to once per short rest (instead of twice).</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Blood Pack correctly labeled with &quot;Blood Pack&quot; faction</li>\n</ul>\n<h2>Backgrounds</h2>\n<p>Some of the backgrounds were missing starting credits.</p>\n<ul>\n<li>Criminal now has starting credits (1,500)</li>\n<li>Scholar now has starting credits (2,000)</li>\n</ul>\n<h2>Omni-tool Programs</h2>\n<ul>\n<li><strong>Cognition booster</strong> <em>uncommon</em> -&gt; <em>rare</em></li>\n<li><strong>Threat Assessment</strong> <em>uncommon</em> -&gt; <em>rare</em></li>\n<li><strong>Trace Signal Jammer</strong> clarified advantage on saving throw against heavy weapons that require targeting</li>\n</ul>\n<h2>Feats</h2>\n<p>New feats from RJ:</p>\n<ul>\n<li>Card Shark</li>\n<li>Come Get Me</li>\n<li>Grace Under Fire</li>\n<li>Nerves of Steel</li>\n</ul>\n<br>\n<p>New Racial Feats from <a href=\"https://www.gmbinder.com/share/-L7HA1pIhxcx3bVb8vqf\" target=\"_blank\">Races from the Relay</a> by <a href=\"https://www.reddit.com/user/thestray\" target=\"_blank\">/u/thestray</a>:</p>\n<ul>\n<li>Additional Augmentation</li>\n<li>Cranial Bruiser</li>\n<li>Warlord's Blood Rage</li>\n</ul>\n<h2>Misc</h2>\n<ul>\n<li>All class features now indicate at which level you receive them.</li>\n<li>Class features correctly appear on the class features tab.</li>\n<li>Navigation between classes &amp; races has been added to the individual class/race pages</li>\n<li>Finally squashed the remaining bugs in the grunt generator.</li>\n<li>Alert Boxes now have WCAG 2.0 contrast compliance</li>\n<li>Race page direct links work again</li>\n</ul>\n",
    "id": "0-9-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 1.0.0",
    "description": "... 2 years later",
    "date": "2019-03-24T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/d/de/MEvisionSEQ3728.jpg/revision/latest/scale-to-width-down/800?cb=20081024150301",
    "html": "<h1>v1.0.0</h1>\n<h2>A message from Luke A.</h2>\n<div class=\"ma-3\"><em>\n<p>Its been a little over two years since the very first release of this project, and I am so happy with its progress.\nWhen I first started, my only goal was to have something for my friends and I to use. I honestly had no idea that the\nsystem would reach so many people. A quick glance at the past year shows that we've had over 19,000 people visit\nthe site from over 100 countries! The daily active users are up to 170 with about 2,000 monthly active users, and the\ntrendline continues to increase. I've received countless emails and feedback from people all over the world. I want to\nsay thank you to everyone who is using the system and especially to everyone who has contributed your thoughts and ideas.\nI am so humbled by your appreciation and I couldn't have done it without you.</p>\n<p>With this large content release (which primarily contains a lot of Andromeda content), I felt it was finally time to\ncut the v1.0 release of this system. It's still not perfect and I want to see it evolve. But I feel\nthat it has reached a worthwhile milestone.</p>\n<p>I have no intent on abandoning this project anytime soon. But, the foundation is complete. Is it perfect? Of course not,\nbut the entire set of rules has reached a stable, maintainable point. Essentially, this means there won't be any major,\nsweeping rule changes. I won't be overhauling classes, races, spells, how combat works, or any other system altering\nportions. If you think there are places where major overhauls are required, then we certainly encourage you to run\ncampaigns with your own set of rules. Perhaps one day, in the far future, enough problems will surface and we will\nrelease a grand v2.0, but this won't happen for many years to come.</p>\n<p>Having said all of that, <em>of course</em>, there will continue to be minor tweaks. When overpowered combinations\nbetween spells and class features or weapons and mods are uncovered, I will continue to remedy the issues with small\nadjustments. Even while writing this, I received an email about potential abuse of Burst Fire at lower levels.\nBut my goal is that these tweaks will gradually decrease.</p>\n<p>Additionally, the time has come for me to take a step back from my role as a content creator. This means I'll be\nleaning on the community more than ever to contribute content. In preparation for this change, I've created a number of\nidea submission forms so players can send us their content. Specifically, there are a number of monsters left to create\nand I'd love for more re-skinned 5e Wondrous Items as Omni-Tool programs. We've also created a\nsubreddit, <a href=\"https://www.reddit.com/r/masseffect5e/\" target=\"_blank\">/r/masseffect5e</a> to encourage more feedback and community communication.</p>\n<p>The primary reason that I want to step away from content creation is that I wish to focus my time on at the table\nimprovements. These include an encounter manager, a dice roller, online character creation, and better character sheets,\nincluding official Roll20, fillable PDF, and Google Sheets character sheets. I want a better PDF of the game\ndocument and I have a major idea for an explorable galaxy with planetoid descriptions. I also want to start\ncreating adventures and tutorials so new players can jump right into the system. This list of improvements will take\nyears and some may never happen, but at this time, it's my goal. However, I won't be able to accomplish these\ngoals if I'm focusing on backfilling classes, monsters, and other content.</p>\n<p>So, in short, I'm asking for your help. If you want to see this system improve, you have all of the power. Please use\nour <nuxt-link to=\"/about\">many avenues of feedback</nuxt-link> to let us know how we can improve and submit your ideas!</p>\n<p>Everyone reading this...seriously, thank you. I can't wait to see what we create together.</p>\n<p>Sincerely,</p>\n<p>Luke A.</p>\n<p></em></div></p>\n<h2>Rules</h2>\n<ul>\n<li>Expanded the armor bonuses and limitations table to be more gradient and realistic. Before if you were wearing all\nlight armor and added heavy arms, the required STR jumped to 16.</li>\n<li>High Jump distance is divided by three instead of two (most things can't high jump 4 meters, ~12ft)</li>\n<li>Clarified that after your shield regeneration begins, it continues at the start of your turn until your shields are max\nor you take damage.</li>\n<li>Weapon mods cannot be uninstalled from weapons. This was a hold-over from before there were tools and kits. Now, using weaponsmith's\nworkbench is the only way to <em>potentially</em> salvage installed mods. The primary issue is that weapon mods are fairly cheap for their\ngameplay value and players could easily buy the best mods and swap them between better weapons with ease. Without the ability to\nremove a mod, if players want to customize a weapon, they need to buy or build a new weapon. If you'd prefer to use\na more flexible modding system, we recommend that you increase the cost of weapon mods 10 fold.</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li><strong>Barrier</strong>: There was an infinite combination between biotic punch and barrier. With RAW, a player could cast biotic punch\nrepeatedly to gain an infinite amount of barrier ticks. Now, your total possible barrier ticks is limited to the barrier ticks\ncolumn in the class progression table. This was always the intent but is has been explicitly stated.</li>\n<li><strong>Assault Fighting Style</strong>: Increases the DC by 2 instead of by proficiency bonus. No increase in size. Burst Fire proved too\npowerful at lower levels and other fighting styles do not scale with level (except for Brawler, which is expected because melee\nis not as powerful as ranged).</li>\n</ul>\n<h3>Engineer</h3>\n<ul>\n<li><strong>Supply Pylon</strong>: Clarified some of the text in supply pylon. First, the resources are selected when you summon it and you only have one\nof each resource. Second, specified which grenades and their mark. Additionally, there is a cost of 5 omni-gel to recharge this ability. It was pointed out that players\ncould easily spent, say, a month calling the supply pylon a few times a day and sell the items within for infinite cash.</li>\n</ul>\n<h3>Sentinel</h3>\n<ul>\n<li>Reduced Tech Armor hit points to (Sentinel Lvl + Spellcasting Mod) * <em>2</em> (instead of 3). Maxed out, Tech armor was allowing 150 additional hit points per long rest,\nwhich was way too many.</li>\n<li><strong>Guardian</strong>\n<ul>\n<li><em>Omni-shield</em>:\n<ul>\n<li>Removed <em>If wielding a single-handed ranged or melee weapon, gain +2 AC and a +2 bonus to Dexterity saving throws.</em> Replaced with +1 AC.</li>\n<li>Added Fire and Cryo shield augmentation at higher levels.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>Soldier</h3>\n<ul>\n<li><strong>Havoc</strong>: Makeshift grenades increase in power at higher levels.</li>\n</ul>\n<h3>Vanguard</h3>\n<ul>\n<li><strong>Shock Trooper</strong>\n<ul>\n<li><em>A Touch of Force</em>: The bonus only applies to damage rolls. Fictionally, it didn't make sense for a biotic boost to affect\nthe ability to attack with a weapon. Also, added a 1 minute length to the effect.</li>\n</ul>\n</li>\n</ul>\n<h2>Races</h2>\n<h3>Geth</h3>\n<ul>\n<li><strong>Unshackled AI</strong>, updated description to better distinguish that unshackled AI are a variant race rather than a subrace.</li>\n</ul>\n<h3>Hanar</h3>\n<ul>\n<li>Hover is not it's own movement speed, but a type of flying and hanar cannot fly. Instead, they have been given a\na new trait <em>contra-gravitic levitation</em> which provides a walking speed and some benefits against difficult terrain\nbut has a chance to malfunction.</li>\n</ul>\n<h3>Prothean</h3>\n<ul>\n<li>Added the Awakened Collector variant race</li>\n</ul>\n<h3>Volus</h3>\n<ul>\n<li>Added a deadlier version of the hermetic suit breach since volus are much more at risk to breaches.</li>\n</ul>\n<h3>Vorcha</h3>\n<ul>\n<li>Added an <em>Underground</em> environment option for the <em>Adaptation</em> trait</li>\n</ul>\n<h2>Spells</h2>\n<p>Two new spells. As said above, I'd love to get some spell submissions from the community.</p>\n<ul>\n<li>Biotic Jump</li>\n<li>Invasion</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Any creature that has barrier ticks, now has text that indicates it takes 1d8 reduced damage when hit.</li>\n<li>I have a backlog of monsters that have been designed by Dakota P. that I need to add. These will come sooner, rather than\nlater.</li>\n</ul>\n<h2>Armor Mods</h2>\n<p>New armor mods inspired by Mass Effect: Andromeda</p>\n<ul>\n<li>Aerial Performance Optimizer</li>\n<li>Battlefield Assist Module</li>\n<li>EC Counter</li>\n<li>Equilibrium Regulator</li>\n<li>Medi-gel Regulator</li>\n</ul>\n<h2>Armor Sets</h2>\n<p>Armor sets have been largely overhauled to introduce a new mechanic: Armor Set Bonuses. The purpose of this change was\ntwo-fold: first, to alleviate confusion about what bonuses you receive from wearing a single piece of armor from a set,\nand, second, to make armor pieces more accessible at all stages of the game. It also allows for more mix-and-match potential\nwithout requiring the player to create custom armor.</p>\n<h3>Full Armor that became individual pieces with set bonuses</h3>\n<ul>\n<li>Blood Dragon Armor</li>\n<li>Cerberus Ajax Armor</li>\n<li>Cerberus Assault Armor</li>\n<li>Cerberus Nightmare Armor</li>\n<li>Cerberus Shade Armor</li>\n<li>Cerberus Spirit Armor</li>\n<li>Collector Armor</li>\n<li>Colossus Armor</li>\n<li>Inferno Armor</li>\n<li>N7 Defender Armor</li>\n<li>N7 Armor</li>\n<li>Partisan Armor</li>\n<li>Reckoner-Knight Armor</li>\n<li>Terminus Assault Armor</li>\n</ul>\n<h3>Andromeda Items</h3>\n<p>Some items are marked with an &quot;Andromeda&quot; flag. But this only means that the armor's name and flavor text\ndoes not apply to Milky Way settings. We still encourage GMs to allow players to purchase Andromeda armor, but,\nabove the table, decide on a different name and origin. Note that some armor from the Andromeda game are not flagged.\nThis is because the armor could reasonably be available in the Milky Way. For Example, HyperGuardian armor was purchased\nby the Andromeda Initiative and taken with them to the Andromeda Galaxy. But it was manufactured in the Milky Way by\nKassa Fabrication.</p>\n<ul>\n<li>Andromeda Elite Helmet</li>\n<li>Angaran Armor set</li>\n<li>Deep Space Explorer Armor set</li>\n<li>Heleus Armor set</li>\n<li>HyperGuardian Armor set</li>\n<li>Initiative Armor set</li>\n<li>Kett Armor set</li>\n<li>Maverick Armor set</li>\n<li>Pathfinder Armor set</li>\n<li>Remnant Armor</li>\n<li>Scavenger Armor</li>\n</ul>\n<h3>New / Updated Body Armor</h3>\n<p>Additionally, some new body armor has been introduced as standard upgrades to stock armor. Names of these new armor\ncome from the list of Mass Effect 1 armor (similarities stop there).</p>\n<ul>\n<li>Assassin Armor</li>\n<li>Crisis Armor</li>\n<li>Duelist Armor</li>\n<li>Freedom Armor</li>\n<li>Gladiator Armor</li>\n<li>Hoplite Armor</li>\n<li>Survivor Armor</li>\n<li>Liberator Armor</li>\n<li>Predator Armor</li>\n<li>Onyx Armor</li>\n<li>Skirmish Armor</li>\n<li>Titan Armor</li>\n<li>Ursa Armor</li>\n</ul>\n<p>If you need the old armor pieces, you can find them in the <a href=\"https://drive.google.com/open?id=1hR63JVeS21uYYAnrV8PCCbsHV_jvKm8Y\" target=\"_blank\">v0.9.2 Player's Manual</a>.</p>\n<h2>Weapon mods</h2>\n<p>New weapon mods inspired by Mass Effect: Andromeda</p>\n<ul>\n<li>Burst Fire System</li>\n<li>Beam Emitter</li>\n<li>Bio-Converter</li>\n<li>Electrical Conduits</li>\n<li>Grenade Launcher</li>\n<li>Plasma Charge System</li>\n<li>Rebalanced Field Coils</li>\n<li>Seeking Plasma System</li>\n<li>Single Fire System</li>\n<li>Sticky Grenade Launcher</li>\n<li>Ultralight Materials II</li>\n<li>Vintage Heat Sink</li>\n</ul>\n<h2>Weapons</h2>\n<p>All new weapons based on the Andromeda game. Like the armor sets, some weapons found only in the Andromeda galaxy have\nan &quot;Andromeda&quot; flag. This means the weapon wouldn't be found in the Milky Way, but you can simply rename the weapon or\nagree that the weapon was made in the Milky Way and use it.</p>\n<ul>\n<li>Charger</li>\n<li>Cyclone</li>\n<li>Dhan</li>\n<li>Electric Firaan</li>\n<li>Equalizer</li>\n<li>Hesh</li>\n<li>Inferno</li>\n<li>Isharay</li>\n<li>Kett Carfalon</li>\n<li>Kett Vakarsh</li>\n<li>L-89 Halberd</li>\n<li>Lanat</li>\n<li>Naladen</li>\n<li>P.A.W.</li>\n<li>Pathfinder Deep Impact</li>\n<li>Pathfinder Observer</li>\n<li>Pathfinder Pioneer</li>\n<li>Pathfinder Ranger</li>\n<li>Remnant Cryo-Gauntlet</li>\n<li>Rozerad</li>\n<li>Ruzad</li>\n<li>Sandstorm</li>\n<li>Scattershot</li>\n<li>Shadow</li>\n<li>Shorty</li>\n<li>Sidewinder</li>\n<li>Silhesh</li>\n<li>Soned</li>\n<li>Sovoa</li>\n<li>Sweeper</li>\n<li>Thokin</li>\n<li>Ushior</li>\n<li>Vanquisher</li>\n<li>X5 Ghost</li>\n<li>Zalkin</li>\n</ul>\n<h2>Grenades</h2>\n<p>Grenades can have Marks much like Spells have levels, and they increase in power with each mark.</p>\n<h2>Omni-Tools</h2>\n<p>Introduced a new concept of &quot;Unstable&quot; programs. These can be used more than once, but have a limited number or uses due to the\ninstability of the code. thermic_overvent.exe have been changed to an unstable program as an example.</p>\n<h2>Misc</h2>\n<ul>\n<li>Added a Random Height &amp; Weight table from Rex the Pig</li>\n<li>Fixed a bug with low-CR grunts from the generator having 0 Hp.</li>\n</ul>\n",
    "id": "1-0-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 1.1.0",
    "description": "New Monsters, Fillable Character Sheet, Google Sheets Character Sheet, & Item Rarities",
    "date": "2019-05-05T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/7/79/Bekenstein_-_brute_force_guards.png/revision/latest/scale-to-width-down/640?cb=20121012180405",
    "html": "<h1>v1.1.0</h1>\n<h2>Character Sheets</h2>\n<ul>\n<li>An updated fillable character sheet by <a href=\"https://www.reddit.com/user/wretchedcrows\" target=\"_blank\">/u/wretchedcrows</a> that is based on the updated character sheet.</li>\n<li>Added an official Google Sheets character sheet, it attempts to strike a balance between Ben's and GameMasterPo's</li>\n<li>Nick S. Fixed some formulas in Ben M's Google Sheets Character Sheet</li>\n</ul>\n<h2>Found Codices Removed</h2>\n<p>The &quot;Found Codices&quot; section was meant to be a place where we could present community and/or new ideas. Similar to the\n&quot;Unearthed Arcana&quot; of D&amp;D 5e. But now that we have a subreddit, it makes sense to keep community ideas there.</p>\n<h2>Equipment</h2>\n<p>All equipment now has rarity. These were added to assist GMs in deciding which items they should distribute as loot. Each\nequipment page has a new rarity filter. In addition, the item names correspond with their rarity color.</p>\n<p>&quot;Spectre&quot; has replaced &quot;Very Rare&quot; and/or &quot;Legendary&quot; as the top tier rarity.</p>\n<h3>Weapons</h3>\n<p>Having recently replayed ME1-3, I was reminded that the weapons have an animation when you holster and draw them, transforming from\na compact device into a full weapon and vice versa. Therefore, operatives would be able to carry more than two weapons.</p>\n<p>Because of this, weapon slots have been increased to 4, with two-handed weapons requiring 2 slots.</p>\n<h3>Heavy Weapons</h3>\n<p>Realized during some playtesting that the heavy weapons were woefully out of whack when comparing the cost/damage ratio. For\nexample, the ML-77 does an average of 39 damage per shot, with 6 charges. Total damage before you need to refill is 234.\nThis is an uncommon weapon that doesn't even require targeting to fire. Comparatively, the M-597 Landon deals 4d8 damage\nwith 10 charges. Total damage before you need to refill is 180, but it's a spectre level weapon.</p>\n<p>Each weapon is slightly different, and the blast radius, DC, and time to fire all add some unique variation and should be considered\nwhen assigning total damage. I'm currently running a full analysis and will have more sweeping changes to heavy weapons\nwith 1.2.0. Right now, I've adjusted the ML-77 launchers to 3d12 damage instead of 6d12.</p>\n<h3>Mods</h3>\n<p>To accommodate the weapon slot change</p>\n<ul>\n<li>Back holster, provides 2 additional weapon slots</li>\n<li>Hip holster, provides 1 additional weapon slot</li>\n</ul>\n<h2>Classes</h2>\n<h3>Soldier</h3>\n<p><strong>Havoc</strong> subclass's <em>advanced weapon holsters</em> now provide 2 additional weapon slots that can both hold two-handed weapons.</p>\n<h3>Vanguard</h3>\n<p><strong>Biotic Maneuvers</strong> did not say how many maneuvers the player learned initially (it should be 3).</p>\n<h2>Backgrounds</h2>\n<ul>\n<li>Veteran incorrectly had old (now removed) starship systems as proficiency choices.</li>\n</ul>\n<h2>Bestiary</h2>\n<p>Finally got around to adding all of Dakota P.'s bestiary submissions (Thanks!)</p>\n<ul>\n<li>Eclipse Commando</li>\n<li>Eclipse Engineer</li>\n<li>Eclipse Heavy</li>\n<li>Eclipse Operative</li>\n<li>Eclipse Trooper</li>\n<li>Eclipse Vanguard</li>\n<li>Kett Chosen</li>\n<li>N7 Slayer</li>\n<li>N7 Shadow</li>\n<li>N7 Paladin</li>\n<li>N7 Demolisher</li>\n<li>Security Guard</li>\n<li>Thorian</li>\n<li>Thorian Controller</li>\n<li>Thorian Creeper</li>\n<li>Thorian Spawn</li>\n<li>Thorian Thrall</li>\n</ul>\n<h2>Spells</h2>\n<p>A number of new spells from Ben M. and a new contributor, Chris Alley</p>\n<ul>\n<li>Blade Armor</li>\n<li>Damping</li>\n<li>Flak Cannon</li>\n<li>Gravity Field</li>\n<li>Heavy Charge</li>\n<li>Nanite Cloud</li>\n<li>Pheromone Spray</li>\n<li>Tear</li>\n<li>Trophy System</li>\n<li>Warp Cloud</li>\n<li>Charge: added a note that charge ignores half cover to represent its &quot;semi-teleport&quot; functionality in the ME games</li>\n</ul>\n<h2>Vehicles</h2>\n<ul>\n<li>Collector Ship, contributed by Connor Maxwell</li>\n</ul>\n<h2>Misc</h2>\n<ul>\n<li>Fixed the metric random height/weight tables</li>\n</ul>\n",
    "id": "1-1-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Site Search is here!",
    "description": "Want to search they player's manual? Now you can...",
    "date": "2019-05-13T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/8/86/Planetscanning.png/revision/latest?cb=20100201034738",
    "html": "<h1>v1.1.1</h1>\n<h2>Player's Manual Search (beta)</h2>\n<p>In this minor patch, I've added the capability to search through the player's manual. The search box is located\nat the top of the side navigation menu. Currently, some of the highlighting is a bit buggy, but its functioning and\nreturning decent results.</p>\n<p>If it crashes on you, you get strange results, or you've got other feedback, please <nuxt-link to=\"/about\">let us know</nuxt-link>.</p>\n",
    "id": "1-1-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 1.1.2",
    "description": "Melee mods, spell cards, adventures, and premade characters",
    "date": "2019-06-29T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/2/2b/MEA_Melee_Weapons.png/revision/latest?cb=20180324021732&format=original",
    "html": "<h1>v1.1.2</h1>\n<h2>Highlights</h2>\n<ul>\n<li>Beginnings of new <a href=\"https://www.reddit.com/r/masseffect5e/comments/c7h01l/updated_roll20_sheet/\" target=\"_blank\">Roll20 characters sheets</a> thanks to <a href=\"https://www.reddit.com/u/Danrconway/\" target=\"_blank\">/u/Danrconway</a> and <a href=\"https://www.reddit.com/u/Smeeg699/\" target=\"_blank\">/u/Smeeg699</a></li>\n<li>New <a href=\"https://drive.google.com/open?id=1wN7ALQLWtKoBmqOJtW10H7KpsYkjCM_A\" target=\"_blank\">Character sheet</a> created by Chris &quot;OodSigma13&quot; Dickson <em>2019-07-20</em></li>\n<li>Updated <a href=\"https://drive.google.com/open?id=1GLotuedjZ7AtLMhooBmhEFSU8TRuI4A7\" target=\"_blank\">fillable character sheet</a> by <a href=\"https://www.reddit.com/user/rpk0714\" target=\"_blank\">/u/rpk0714</a> <em>2019-07-20</em></li>\n<li>Quality of Life Improvements on the <a href=\"https://drive.google.com/open?id=1mj7JDIerstCcQjowNsfasNr42CcKCFrOIf3RPYRC1DA\" target=\"_blank\">Official Google Sheet</a> by <a href=\"https://www.reddit.com/user/IdonMezzedUp/\" target=\"_blank\">/u/IdonMezzedUp/</a> <em>2019-07-20</em></li>\n<li>New Class and Spell Icons by Chris &quot;OodSigma13&quot; Dickson <em>2019-07-20</em></li>\n<li>Improved <nuxt-link to=\"/assets\">Spell Cards</nuxt-link></li>\n<li>Mission Page added</li>\n<li><a href=\"https://drive.google.com/open?id=1XlaCFmUpouNIaQSa1w8SnFRNEQrDcfpX\" target=\"_blank\">Premade Characters</a> added in the assets section</li>\n</ul>\n<h2>Rules</h2>\n<ul>\n<li>Fixed the &quot;Carrying, Holstering, Drawing&quot; section in weapons. Previously had mention to 2 weapon slots, when they had been increased to 4 in v1.1.0</li>\n<li>Creatures that are Targeting cannot take actions or reactions.</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li>Clarified Barrier damage reduction happens before any damage is applied to Tech Armor or Shields. <em>2019-07-04</em></li>\n<li>Clarified barrier ticks are lost when barrier ends. <em>2019-07-04</em></li>\n<li>Adept and Sentinel Spellcasting incorrectly allowed learn advanced options every level. This should have been <em>instead\nof learning a new spell, select an advancement.</em> <em>2019-07-20</em></li>\n</ul>\n<h3>Engineer</h3>\n<ul>\n<li><strong>Drone</strong>: Removed +prof bonus from all skill checks and clarified the bonus replace's the drone's on attack rolls. Was confusing when compared to drone's bond. <em>07-20-2019</em></li>\n<li><strong>Engineer's Efficiency</strong>: Clarified text of , see <a href=\"https://www.reddit.com/r/masseffect5e/comments/bqq0cu/confusion_with_engineers_efficiency/\" target=\"_blank\">this post</a> for clarification.</li>\n</ul>\n<h3>Vanguard</h3>\n<ul>\n<li><strong>Metabiotics (twinned spell)</strong>: Removed text that referenced using 1 barrier tick for cantrips, as this ability can no longer be used on cantrips. <em>2019-07-20</em></li>\n</ul>\n<h2>Races</h2>\n<h3>Asari</h3>\n<ul>\n<li><strong>Innate Biotics</strong>: Clarified that this ability cannot be used to learn combat cantrips. <em>2019-07-20</em></li>\n</ul>\n<h3>Geth</h3>\n<ul>\n<li><strong>Integrated Protection</strong>: Clarified that the &quot;shield&quot; which would provide additional AC is a piece of equipment, see <a href=\"https://www.reddit.com/r/masseffect5e/comments/cbhen0/question_help_with_building_geth/\" target=\"_blank\">this post</a> <em>2019-07-20</em></li>\n</ul>\n<h3>Turian</h3>\n<ul>\n<li><strong>Brothers-in-arms</strong>: Renamed to <em>Esprit De Corps</em> to better support gender neutrality. <em>2019-07-20</em></li>\n</ul>\n<h2>Feats</h2>\n<ul>\n<li><strong>Grenadier</strong>: The Mark of the grenade you gain increases with your level. <em>2019-07-20</em></li>\n<li><strong>Hair Trigger</strong>: Clarified that you add your proficiency bonus to the damage roll on the free action attack. <em>2019-07-20</em></li>\n</ul>\n<h2>Backgrounds</h2>\n<p>Fixed the following backgrounds that had incorrect (old) starship systems listed: Faction Agent, Pilot, Scholar,\nScrapper, Sysop, Urchin</p>\n<h2>Weapons</h2>\n<ul>\n<li>The <em>Special</em> property has been added to Omni-* weapons to compensate for the introduction of melee mods.</li>\n<li>Updated the Heavy Weapon descriptions with clearer targeting mechanics.</li>\n<li><strong>Reaper Blackstar</strong> can cause indoctrination.</li>\n<li><strong>Ruzad</strong>: reduced damage from 3d6 to 2d6 as it was far too high for an uncommon weapon. Reduced heat to 3 to match the game. <em>2019-07-20</em></li>\n</ul>\n<h2>Weapon Mods</h2>\n<ul>\n<li>Plasma Charge System incorrectly had &quot;fire&quot; damage type, change to radiant</li>\n<li><strong>New</strong>: Long Barrel by Chris Alley</li>\n<li><strong>New</strong>: Shotgun Choke by A. Charlton</li>\n</ul>\n<p><strong>New Melee Mods!</strong>\nMelee weapon mods have been introduced. Thanks to Chris Alley for these ideas.</p>\n<ul>\n<li>Gyroscope</li>\n<li>Extended Grip</li>\n<li>Counterweight</li>\n<li>Energy Channel</li>\n<li>Honed Strike</li>\n<li>Poison Alloys</li>\n<li>Probability Modulator</li>\n</ul>\n<h2>Armor Mods</h2>\n<ul>\n<li><strong>New</strong>: Tactical Holsters inspired by Chris Alley</li>\n</ul>\n<h2>Armor Sets</h2>\n<ul>\n<li><strong>Survivor Armor</strong>: Correctly marked as Uncommon (was rare) <em>2019-07-20</em></li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>New</strong>: B.E.C. Field by Chris Alley\n<ul>\n<li>correctly marked as 1st level <em>2019-07-20</em></li>\n</ul>\n</li>\n<li><strong>Pull</strong>: Reduced length to 1 round. See <a href=\"https://www.reddit.com/r/masseffect5e/comments/c68spq/pair_of_questions_for_the_citadel_hivemind_here/\" target=\"_blank\">this discussion</a> <em>2019-07-04</em></li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Eclipse Trooper, health reduced from 14d8 to 4d8 (<a href=\"https://www.reddit.com/r/masseffect5e/comments/bt9pi4/question_about_enemy_stat_blocks/\" target=\"_blank\">see this discussion</a>)</li>\n</ul>\n<h2>Other</h2>\n<ul>\n<li>Travel/Pace tables have correct headers <em>2019-06-29</em></li>\n<li>Removed expansion panels for subclasses. There was an issue with the panels on mobile displays, preventing the descriptions from showing up. <em>2019-06-29</em></li>\n<li>Remove all submission buttons. Moved this <a href=\"https://www.reddit.com/r/masseffect5e/wiki/submissions/guidelines\" target=\"_blank\">workflow to reddit</a> <em>2019-07-4</em></li>\n<li>The &quot;Spell Types&quot; section of the rules was incorrectly titled &quot;What is a Spell?&quot; <em>2019-07-20</em></li>\n</ul>\n<br>\n",
    "id": "1-1-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Version 1.2.0",
    "description": "New Printable PDF.",
    "date": "2019-10-07T04:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/d/d1/Earth_%28orbit%29.png/revision/latest?cb=20140921173727",
    "html": "<h1>Hiatus</h1>\n<p>I wanted to let everyone know that with this release, I'm going to take an extended hiatus from development. I'm currently\nin the process of moving and starting a new job in a few weeks. Then the holidays will follow shortly after. I'm going to\nuse this time to think about where I want this system to go and what are the next steps I'd like to take.</p>\n<p>If anyone is creating pre-written missions or new tabletop assets, I will continue to link those assets on the site. But\nI won't be doing any content tweaking or editing. I've even got a few missions of my own I'd like to get on the site at some point.</p>\n<p>The community is still growing, and I encourage you all to keep involved via the <a href=\"https://www.reddit.com/r/masseffect5e/\" target=\"_blank\">subreddit</a>,\nshare your ideas, and ask questions. With the release of the new PDF, I hope I've made it as easy as possible for other\ndesigners and GMs to tweak or all-out rewrite whatever rules they want and make the game their own.</p>\n<h1>v1.2.0</h1>\n<ul>\n<li>Removed the v0.8.4 classes. You can find them in <a href=\"https://drive.google.com/drive/u/0/folders/1eDfgpG3JplKUjrIdySJKmyC4qxTi2MUT\" target=\"_blank\">previous versions of the pdf</a>.</li>\n</ul>\n<h2>Highlights</h2>\n<ul>\n<li><nuxt-link to=\"/assets\">New PDF</nuxt-link> created with Homebrewery.</li>\n</ul>\n<h2>Rules</h2>\n<ul>\n<li>Removed Unshackled AI from random height/weight table. Replaced Geth random values with unshackled AI.</li>\n<li>Clarified Set Bonuses in the Armor section</li>\n<li>Fixed targeting description in the rules. Incorrectly said targeting was a free action.</li>\n<li>Fixed weapon mods description in rules section. Incorrectly said melee weapons could not have mods.</li>\n<li>Changed medi-gel resupply cost to &quot;varies&quot; as the cost varies based on the medi-gel type.</li>\n<li>Added <em>Variant: Venting</em> to the Thermal Clips section of the rules.</li>\n<li>Fixed the error in the Charisma section of Using Ability Scores which referenced &quot;wisdom&quot;</li>\n</ul>\n<h2>Classes</h2>\n<ul>\n<li><strong>Barrier</strong>. Number of uses previously said it was based on your highest Adept, Sentinel, or Vanguard level. Changed\nto your combined levels of those classes.</li>\n</ul>\n<h3>Engineer</h3>\n<ul>\n<li><strong>Engineer's Efficiency</strong>: Reduces the scaling increase of the spell to a 2TP version at 11th level. EE was intended\nto be a filler spell for engineers, but scaling to a free 2nd-, 3rd-, 4th-level spell essentially replaced the need for\nweapons and was almost always the best action for the engineer to take.</li>\n<li><strong>Medic, Medi-gel Enhancements</strong>: Clarify feature text, &quot;Within 1 minute of using this medi-gel, the next time you\ntake damage that reduces you to 0 hit points but doesn't kill you outright, you are reduced to 1 hit point instead.&quot;</li>\n</ul>\n<h3>Sentinel</h3>\n<ul>\n<li><strong>Heavy Barrier</strong>: reduce from 3d8 to 2d8</li>\n</ul>\n<h3>Soldier</h3>\n<ul>\n<li><strong>Tactical Reload</strong>: Changed to &quot;When you take the Attack action on your turn, you can use one of your attacks to\nreload a weapon your are wielding.&quot;</li>\n<li><strong>Indomitable</strong>: Correctly provide 1, 2, and 3 uses at appropriate levels.</li>\n</ul>\n<h3>Vanguard</h3>\n<ul>\n<li><strong>Heavy Barrier</strong>: reduce from 3d8 to 2d8</li>\n</ul>\n<h2>Feats</h2>\n<ul>\n<li><strong>Melee Specialist</strong> correctly highlighted as a new feat.</li>\n<li><strong>Grenadier</strong>. Added a range of the grenade attack (10m/30m)</li>\n<li><strong>Hair Trigger</strong>. Remove free action attack from Hair Trigger.</li>\n</ul>\n<h2>Armor Sets</h2>\n<ul>\n<li><strong>Maverick Boots</strong> incorrectly had a 19 or higher as a critical hit, the rest of the set had an 18.</li>\n</ul>\n<h2>Spells</h2>\n<ul>\n<li><strong>Tactical Scan</strong>. <em>Telegraphed Attacks</em> advancement only benefits the caster.</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Fixed issue of some creatures with infrared vision showing a distance of &quot;null&quot; meters.</li>\n<li><strong>Assault Drone</strong>:\n<ul>\n<li>Increase health from 3d6 to 5d6</li>\n</ul>\n</li>\n<li><strong>Combat Drone</strong>:\n<ul>\n<li>Increase health from 3d6 to 6d6</li>\n<li>Removed erroneous <em>petrified</em> immunity.</li>\n</ul>\n</li>\n<li><strong>Defense Drone</strong>:\n<ul>\n<li>Increase health from 4d6 to 6d6</li>\n</ul>\n</li>\n<li><strong>Disruption Drone</strong>:\n<ul>\n<li>Increase health from 2d6 to 4d6</li>\n<li>Clarified Self destruct mechanic.</li>\n<li>Increased explosion damage to 2d12.</li>\n</ul>\n</li>\n<li><strong>Recon Drone</strong>:\n<ul>\n<li>Increase health from 2d6 to 4d6</li>\n</ul>\n</li>\n<li><strong>Rocket Drone</strong>:\n<ul>\n<li>Increase health from 2d6 to 5d6</li>\n<li>Increase damage to 2d8</li>\n<li>Increase CR to 1/2</li>\n</ul>\n</li>\n<li><strong>Repair Drone</strong>:\n<ul>\n<li>Increase health from 2d6 to 5d6</li>\n</ul>\n</li>\n</ul>\n<br>\n",
    "id": "1-2-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "What's on the horizon",
    "description": "Beginnings of an online character sheet and what's in store for the future.",
    "date": "2020-06-02T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/5/59/Horizon_Pre-Attack.jpg/revision/latest?cb=20100617035919",
    "html": "<h2>Online Character Sheet</h2>\n<p>First and foremost, Bryce Gelinas has stepped up and started working on an online character sheet. It's a work in\nprogress, but he'd like to start gathering your feedback. Best way to submit feedback is on the <a href=\"https://discord.gg/c2UnqkH\" target=\"_blank\">Discord server</a>\nin the #online-character-sheet channel.</p>\n<h2><a href=\"https://discord.gg/c2UnqkH\" target=\"_blank\">Discord Server</a></h2>\n<p>A lot of thanks to Noblesse Oblige for setting up a discord server. It is extremely active, and we recommend going there\nfor all of your questions.</p>\n<h2>New Assets Directory</h2>\n<p>Based on how the site is set up, it was difficult to make a change every time someone created something new. The\ndiscord folks set up their own shared folder with all the old and a lot of new assets. I've linked it on the assets page.</p>\n<h2>What's coming</h2>\n<p>While on my hiatus, I've continued to play a lot of D&amp;D 5th Edition as a player and GM, and continued to run my own\nMass Effect 5e Campaign. During all of this, I've been taking a lot of notes about what is working, what could be improved,\nand what needs to be overhauled. All of these notes have piled up and paved a path forward for what Version 2 of this\nsystem might look like.</p>\n<p><em>Disclaimer #1</em>: I am in the <strong>very</strong> early stages. So some of the details may change.</p>\n<p><em>Disclaimer #2</em>: Any new version is several months away. In addition to content changes, the site itself needs a lot of love\nas much of the code has become outdated. So I've got two large tasks in both writing content and cleaning up code.</p>\n<p><em>Disclaimer #3</em>: Once Version 2 is released, I'll keep a copy of version 1 available online and in the pdf form in perpetuity.</p>\n<p>With the disclaimers out of the way, here is an abbreviated list of the changes Version 2 might contain.</p>\n<h3>Classes</h3>\n<p>Before going on my hiatus, there was a LOT of discussion about class balance and class mechanics in general. Through\nthe many versions of this systems, the classes had become amalgams of the D&amp;D classes with a lot of overlap. This left\na number of odd mechanics like cantrips that weren't cantrips (soldiers), ersatz cantrips (engineer's efficiency),\nprogression column bloat (vanguards and sentinels), or just a boring/underpowered class (adepts).</p>\n<p>As I've been working on new class designs, I'm keeping three principles in mind:</p>\n<ol>\n<li>Less Kitchen Sink - the idea here is to let the classes progress like 5th edition classes, and not to bolt on new mechanics\nto a complete class. Instead, find ways to reflavor or replace 5e mechanics with ones that adhere to Mass Effect lore.</li>\n<li>Central themes - I want to make sure that each class feels unique from each other independent of its respective subclasses.\nThis will require trying to hone in on what makes a class special and build their progression about their unique feature.</li>\n<li>More Choice - The choices you made in Mass Effect mattered (...well for most of the games). I want to bring choice\ninto the classes by having more subclasses and more feature sets like Fighting Style. Thus, not only will your character\nfeel unique because of their subclass, but as they progress you'll have more options as well.</li>\n</ol>\n<h3>Expanding the Spell Library to 9th Level</h3>\n<p>This will be a major undertaking, but it's important to keep in balance with 5th edition and also make it easier to adapt\nor use 5th edition tools with this system (i.e. Roll20).</p>\n<h3>Expanding Melee Weapons</h3>\n<p>If my games have taught me anything, it's that melee weapons are very viable in this system. But the current list of melee\nweapons is lax at best.</p>\n<h3>Vehicles and Vehicle Combat</h3>\n<p>This needs its own overhaul. Both the vehicle list and combat mechanics need a tune up. The end result will probably draw\nfrom the expanded vehicle rules from Ghost of Saltmarsh.</p>\n<h3>Rule Clean-up</h3>\n<p>Some other things on my mind are tightening up the rule-set as well. There are currently 4 health pools (HP, SP, Temp HP\n, and Tech Armor HP), Double Tap continues to baffle new players, Targeting is clunky, and there are a number of\none-off rules that are often forgotten about or unused (Armor and Environmental Protection, Melee damage bypassing shields).</p>\n<p>This might include a simplification of how Armor and AC works, but I'm undecided.</p>\n<h3>Equipment Clean-up</h3>\n<p>There is a lot of overlap between Omni-tool Programs, Armor Mods, Weapon Mods, and Armor set bonuses. My goal here is to\nclarify permanence and transience. That is, what can you add and remove at will vs what is permanently installed.</p>\n<h3>Final Thoughts</h3>\n<p>I've got more I'm thinking about, new ideas and new features, but nothing worth noting at this time. As I finish developing\nfully-fledged ideas, I'll be sharing them on Discord for feedback.</p>\n<br>\n",
    "id": "1-2-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Just in time for the Legendary Edition",
    "description": "It's been a long time...how has everyone been?",
    "date": "2021-03-07T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/5/51/Shepard_ME3.PNG/revision/latest",
    "html": "<p>So...it's been a while. This past summer I had some <a href=\"https://www.reddit.com/r/masseffect5e/comments/hk2u71/next_steps_for_me5e/\" target=\"_blank\">&quot;grand&quot; ideas</a>\nabout where I wanted to take ME5e. As it often does, life just sort of got in the way. I was slowly (ever so slowly),\nworking on the site update; but, my cadence of development was only about once a month.</p>\n<p>When I found out that the Legendary Edition was real (and not just a rumor), I finally got that fire I needed to buckle down\nand focus. Before anyone freaks out, don't worry...the changes to the homebrew content are minor: little improvements here and there.\nYou'll find everything listed below.</p>\n<p>That said, I wanted to take a few quick paragraphs and qualify my <a href=\"https://docs.google.com/document/d/1BlA7AA3otzgI-FGJTxJ9_3nwKubnresvCvSaz9N6dUw/edit?usp=sharing\" target=\"_blank\">&quot;roadmap&quot;</a>.\nDuring my time off, I've still been mulling over this homebrew and thinking about where I want to take it. I would call the\nlinked roadmap an overreaction to the current state of the system. I felt it had drifted too far from 5e and my\nsnap judgement was to bring it as close in line with 5e as possible.</p>\n<p>At some point during the back-end refactor, I found myself re-reading the Open Game License (OGL) and System Reference\nDocument (SRD) for D&amp;D 5th Edition. The epiphany I had was that the OGL and SRD are meant for the creation of <em>new</em> content,\nnot the rehashing or &quot;re-skinning&quot; of already existing content. After realizing this, I took a few days to reread all\nof the content I (and others) have created over the past 4 years. I realized that most of the things I didn't like\n(barrier, combat cantrips, mix &amp; match armor), were exactly the things the OGL and SRD were made for. They augment an existing\nsystem with new rules and mechanics.</p>\n<p>So...my plans for the future are to focus on creation instead of re-skinning. For example, if you saw or used any of the playtest\ncontent for a &quot;class 2.0&quot; update, adepts and soldiers were just re-skins of sorcerers and fighters. That's\nthe type of design I want to avoid. If I refactor the classes, they'll be brand new classes. The same goes for a lot\nof content like monsters, backgrounds, species, etc. I also want to explore new avenues of gameplay and progression, like\nexpanding paragon and renegade or introducing new powers that can branch and progress in various ways. Nothing is set in stone,\nthese are all just ideas I've been jotting down.</p>\n<p>That said, mechanics are mechanics. Sometimes aspects of a class, or spell, or feature just work. There are some staples\nin 5e that I don't want to do away with simply because I'm leaning towards &quot;the new&quot;. Some spells are perfect for ME5e, so\nlong as they get a sci-fi spin. Extra attack is common among many classes as are the mechanics of spell slots. It's a\nfine needle to thread and I can't say it's going to be perfect. What I can say is that I'll listen to your feedback and\ndo my best to find a balance.</p>\n<p>And, hey...if you don't like it...I've got a surprise...</p>\n<h2>Versions</h2>\n<p>If you look in the lower left (or open the nav menu and look at the bottom), you'll see the current version.\nGo ahead, click on it...what's that! Links to the older versions of the site! #mind-blown...or whatever</p>\n<p>I've resurrected a few key versions of ME5e. <strong>NOTE!!!</strong> These are resurrections, flaws and all, including any flaws the site at that version.\nThey're not going to have all the new and pretty site improvements I plan on introducing.</p>\n<ul>\n<li>v0.8.4 contains the classes and species &quot;pre-v1.0.0&quot;</li>\n<li>v0.9.1 contains the post-v1 classes, but pre-v1 species</li>\n<li>v1.2.0 contains everything as it has been for the past year or so</li>\n</ul>\n<p>Moving forward, whenever I release, I'll &quot;freeze&quot; a version of the site and make it available. Hopefully, this will\nlet people utilize the version they like/d most. If, one day...far far far into the future, I get everything I want done,\nmaybe I'll make some sort of version compiler that lets you pick and choose atomic parts of the rules in the version you want. While\nthat would be super awesome and I'd love the challenge, I've got plenty of other skald to fry.</p>\n<h2>Site</h2>\n<h3>Backend updates</h3>\n<ul>\n<li><strong>Dark mode.</strong> It's here...it's live...it's darker than Jack's backstory\n<ul>\n<li>Note: you can toggle it if you like the light</li>\n</ul>\n</li>\n<li><strong>Metric toggler.</strong> Do you hate the metric system...well...(no comment)...you can now used imperial measurements instead\n<ul>\n<li>Note: It's very possible I missed something somewhere. If you notice some measurement that isn't being toggled, <a href=\"https://forms.gle/JtGQqS9KxVFQGtAq7\" target=\"_blank\">please let us know</a></li>\n</ul>\n</li>\n</ul>\n<h3>Organization</h3>\n<ul>\n<li><strong>Mods</strong>. Armor and Weapon mods were combined into a single list.</li>\n<li><strong>Gear Section</strong>. The new gear section contains: Grenades, Heavy Weapons, Tools and Kits (the physical items), Omni-tool programs, and other consumables (medi-gel, thermal clips, heavy weapon charges)</li>\n<li><strong>Tool Proficiencies</strong> can now be found in the appendix.</li>\n<li>The <strong>Generators</strong> section contains the loot and npc generator, more generators will be coming as I more forward with other updates.</li>\n<li>The <strong>Guides</strong> section contains some of those random pages about creating encounters, custom armor, etc. I may expand this section in the future with more GM-friendly materials.</li>\n<li>The <strong>Feedback &amp; About</strong> pages have been combined</li>\n</ul>\n<h2>Name changes</h2>\n<ul>\n<li>&quot;Race&quot; has been renamed to &quot;Species&quot; throughout (if I missed a reference, <a href=\"https://forms.gle/JtGQqS9KxVFQGtAq7\" target=\"_blank\">please let us know</a>)</li>\n<li>&quot;Spell&quot; has been renamed to &quot;Power&quot; throughout (if I missed a reference, <a href=\"https://forms.gle/JtGQqS9KxVFQGtAq7\" target=\"_blank\">please let us know</a>)\n<ul>\n<li>This includes phrases like &quot;spellcasting&quot; becoming &quot;powercasting&quot;</li>\n</ul>\n</li>\n<li>&quot;Armor sets&quot; are just called &quot;Armor&quot;</li>\n<li>The &quot;Grunt generator&quot; has been renamed to the &quot;NPC generator&quot;</li>\n</ul>\n<h2>Rules</h2>\n<ul>\n<li><strong>Species/Class restrictions</strong> have been removed. GM's can still limit based on their discretion.</li>\n<li><strong>Species/Setting</strong> restrictions (i.e. Andromeda  vs Milky Way) have been removed. GM's can still limit based on their discretion.</li>\n<li><strong>Racial Starting Credits</strong> have been removed. Starting credits are now decides by class. See: <nuxt-link to=\"/manual/equipment#starting-equipment\">Rules &gt; Equipment &gt; Starting Equipment</nuxt-link></li>\n<li><strong>Two-weapon fighting.</strong> Two-weapon fighting now applies to all light weapons (ranged and melee). See: <nuxt-link to=\"/manual/combat#making-an-attack\">Rules &gt; Combat &gt; Making an Attack &gt; Dual Wielding</nuxt-link>\n<ul>\n<li>This also had a chain of effect which required a few other changes.</li>\n</ul>\n</li>\n</ul>\n<h2>Classes</h2>\n<h3>Fighting Styles</h3>\n<p><strong>Ambidextrous</strong> was added which works for any combination of melee and ranged two-weapon fighting. I'm not 100% sure about\nthis approach because I don't think it makes sense for a character who specializes is dual-wielding\nswords to be able to pick up a couple of pistols and fire akimbo without issue. But it streamlines the rules significantly.\nOnce the weapon refactor happens, this might change.</p>\n<p><strong>Gunslinger</strong> was removed as the addition of Two-weapon fighting effectively made it obsolete. The only difference is\nthe limitation of &quot;light&quot; ranged weapons in two-weapon fighting, whereas gunslinger let you use non-light weapons. This\nis addressed with the new feats, but GMs might wish to simply use the old rules.</p>\n<h2>Feats</h2>\n<ul>\n<li><strong>Dual Wielder</strong> remains as is.</li>\n<li><strong>Melee Gunner</strong> a replacement for Melee Specialist (parts of which became obsolete with the two-weapon fighting change). It focuses on utilizing your gun as a melee weapon or firing in close range then making a melee attack.</li>\n</ul>\n<h2>Conditions</h2>\n<ul>\n<li><strong>Primers &amp; Detonators</strong>. The explosions resulting from a primer being detonated now scale with your level, similarly to cantrips.</li>\n</ul>\n<h2>Gear</h2>\n<h3>Grenades</h3>\n<p>I did some additional clean-up on grenade &quot;marks&quot;, scaling them similarly to a 5e spell scroll.</p>\n<h2>What didn't happen</h2>\n<ul>\n<li><strong>Simplified Shield Regen Rules</strong>. Due to the interconnectedness of armor and shields, this will be postponed to the armor rework.</li>\n<li><strong>Melee Attacks and Shields</strong>. I was going to turn the melee-shield-bypass rule into a variant, but since I did not rework shields, this was postponed.</li>\n<li><strong>Remove Targeting</strong>. This was more a lack of time and the fact that I didn't want to update any classes (at least one has an interconnected feature with targeting). This will come with a weapon rework.</li>\n</ul>\n",
    "id": "1-3-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "New Character Builder is Live!",
    "description": "Plus a bit of info about imperial vs metric...",
    "date": "2021-08-24T00:00:00.000Z",
    "image": "https://data.n7.world/images/misc/v131-update.jpg",
    "html": "<h2>Newest Contributors</h2>\n<p>Those of you on Discord have more than likely seen Spagheddy and Tech Knight as moderators but also as significant contributors,\nespecially in my hiatus last year. Spagheddy has continued to make fresh and interesting subclasses and Tech Knight\nhas worked incredibly hard on the Roll20 mod, on top of that, they've been Discord mods from the early days of the Discord\nchannel. For all their hard work, we've officially immortalized them on the about page.</p>\n<h2>Updated Character Builder!</h2>\n<p>Thanks to the hard work of Bryan, we've got a brand new character builder. We have a whole backlog of ideas and improvements\nfor it, so if things still feel a bit &quot;beta&quot;, don't worry we'll be making improvements in the near future. Either way, it's\na huge milestone and gets us one step closer to other fun ideas like Roll20 exports.</p>\n<h2>Imperial vs Metric</h2>\n<p>Wanted to give a brief history about this conundrum. When I first created the system, I decided to use metric and was\nconverting distances with a true feet to meters modifier (3.281), then rounding. But that quickly became problematic\nwhen using battle maps and especially when needing to halve distances due to conditions or debuffs. Therefore, we decided\nto use an imprecise but game-friendlier conversion rate of 2 meters to 5 feet.</p>\n<p>Unfortunately, when I made the updates throughout the data, I completely forgot to update the species speeds and bestiary.\nBefore, it wasn't as apparent. Some players assumed 25ft (10 meters) was the standard walking speed in this system. Others\nthought the precise metric (30 ft ~= 10 meters) was correct. Then I went and wrote in the metric conversion which caused all\ntypes of problems, effectively illuminating these long-overlooked issues.</p>\n<p>So, we took a Discord poll to ask what people preferred, and it went overwhelmingly in the favor of keeping the 2m = 5ft rule,\nwhich meant going through and fixing distancing issues where they existed.</p>\n<h3>TL;DR:</h3>\n<ol>\n<li>We're keeping the 2m = 5ft rule, but have updated a plethora of stats throughout the game.</li>\n<li>Species &amp; Bestiary have speeds more inline with D&amp;D 5e (12 meters or 30 ft)</li>\n<li>Powers have a &quot;truer&quot; metric conversion</li>\n<li>Weapons were not updated as they will be adjusted in a more comprehensive weapons update.</li>\n</ol>\n<p>If you want to see the entire list of changes, you can scroll to the bottom of this post.</p>\n<h2>Bug Fixes</h2>\n<p>Thanks to everyone for 1) pointing out the numerous bugs throughout and 2) being patient while they weren't being fixed\nin a timely manner. Everything that was reported on Discord and through the form should be fixed now.</p>\n<h2>Other Odds and Ends</h2>\n<ul>\n<li>Ruzad weapon was given the recoil, hip fire, and special properties</li>\n<li>Clarified that Engineers and Infiltrators that prepare advanced powers only cast the advanced versions, bringing\nadvance mechanic in line with the other classes. But GMs should feel free to adjust this rule and it may change in the future.</li>\n</ul>\n<h2>What's next...</h2>\n<p>Well the easiest answer is continuing to improve and evolve the character builder / character sheet. Plus, the downloadable\nPDF is slowly getting out of date, so that's something I need to spend some time on at some point in the near future.</p>\n<p>As for content improvements, we'll be spending the next few weeks having internal discussions and potentially polling the Discord\ncommunity about what changes/improvements they want to see.</p>\n<h2>Comprehensive list of distance updates</h2>\n<h3>Bestiary</h3>\n<h4>General</h4>\n<ul>\n<li>anything with 8m =&gt; 10m</li>\n<li>anything with 10m =&gt; 12m</li>\n<li>anything with 12m =&gt; 14m</li>\n<li>anything with 14m =&gt; 16m</li>\n<li>any sense was less than 12m became 12m</li>\n</ul>\n<h4>Specific</h4>\n<ul>\n<li>elcor: walking 4m =&gt; 8m</li>\n<li>harvester: walking 20m =&gt; 24m; fly: 30m =&gt; 36m\n<ul>\n<li>trample attack, if you move 10m =&gt; 12m...</li>\n</ul>\n</li>\n<li>horned kath hound: 18m =&gt; 16m (!note: keeping this in line with other base speeds)</li>\n<li>occulus: fly 20m =&gt; 24m</li>\n<li>reaper harvester: darkvision 14m =&gt; 12m</li>\n<li>varren alpha: walking 20m =&gt; 16m</li>\n<li>yahg: blindsight 6m =&gt; 4m</li>\n</ul>\n<h3>Classes</h3>\n<h4>Engineer</h4>\n<ul>\n<li>mastermind: enfilade; range 10m =&gt; 12m</li>\n</ul>\n<h3>Infiltrator</h3>\n<ul>\n<li>shadow: shadow strike; teleport to location 10m =&gt; 12m</li>\n</ul>\n<h4>Sentinel</h4>\n<ul>\n<li>fighting style; cqc, &quot;ignore half cover&quot; 10m =&gt; 12m</li>\n<li>fighting style; sniper, &quot;no hostile creature within&quot; 10m =&gt; 12m</li>\n<li>bastion: tactical focus range; increase to 10m =&gt; 12m per side</li>\n<li>bastion: master tactician; the target...can be within 20m =&gt; 24m of your...</li>\n<li>guardian: tech aura; increase aura 10m =&gt; 12m</li>\n<li>guardian: tech aura (18th level); increases to 20m =&gt; 24m</li>\n<li>juggernaut: assault armor; each hostile creature within 20m =&gt; 24m</li>\n</ul>\n<h4>Soldier</h4>\n<ul>\n<li>fighting style; cqc, &quot;ignore half cover&quot; 10m =&gt; 12m</li>\n<li>fighting style; sniper, &quot;no hostile creature within&quot; 10m =&gt; 12m</li>\n</ul>\n<h4>Vanguard</h4>\n<ul>\n<li>fighting style; cqc, &quot;ignore half cover&quot; 10m =&gt; 12m</li>\n<li>fighting style; sniper, &quot;no hostile creature within&quot; 10m =&gt; 12m</li>\n<li>nemesis: metabiotics; distant power, increase range from 10m =&gt; 12m</li>\n<li>shock trooper: biotic bull rush; distance of charge is 20m =&gt; 24m (!note, this is 1 space more than the normal charge boost, and is equivalent to 60 ft)</li>\n<li>shock trooper: blitz; whenever a creature within 20m =&gt; 24m</li>\n</ul>\n<h3>Gear</h3>\n<ul>\n<li>All grenades (most detonations and range): 10m =&gt; 12m</li>\n<li>cain trip mine (range): 20m =&gt; 24m</li>\n<li>flash_hypno.exe: 10m =&gt; 12m</li>\n<li>m920 cain: &quot;all creatures within&quot; 10m =&gt; 12m</li>\n<li>sync laser: rectangle becomes 10x20m =&gt; 12x24m</li>\n<li>experimental_garrier_generator.exe, target a location within 30m =&gt; 36m</li>\n<li>m-100 grenade launcher, target a location within 30m =&gt; 36m</li>\n</ul>\n<h3>Mods</h3>\n<ul>\n<li>combat sensor: senses enemies within 10m =&gt; 12m</li>\n<li>electrical conduits: if range is farther than 10/20m =&gt; 12/24m</li>\n<li>focus monulator: choose a creature within 30m =&gt; 36m</li>\n<li>night sight: darkvision 30m =&gt; 36m</li>\n<li>personal diruptor torpedoes: target location within 30m =&gt; 36m</li>\n</ul>\n<h3>Powers</h3>\n<h4>General</h4>\n<p>Note, these changes were to bring the power distances in line with standard D&amp;D spell distances <em>using the 5ft to 2m rule</em>.\ne.g., 24m = 60ft, 36m = 90ft, etc.</p>\n<ul>\n<li>anything with a range of 20m =&gt; 24m</li>\n<li>anything with a range of 30m =&gt; 36m</li>\n<li>anything with a range of 40m =&gt; 48m</li>\n<li>anything with a range of 50m =&gt; 60m</li>\n<li>anything with a range of 60m =&gt; 72m</li>\n</ul>\n<h4>Specific</h4>\n<ul>\n<li>cryo blast: size of body of water 10m =&gt; 12m</li>\n<li>havoc strike: range 8m =&gt; 10m</li>\n<li>havoc strike: advancement__improved distance: 12m =&gt; 14m</li>\n<li>flamethrowser: advancement__contentrated burn: aoe is now a 2m line (this was a typo and said 20m wide line!!! whoops!)</li>\n<li>charge: range 14m =&gt; 16m</li>\n</ul>\n<h3>Rules</h3>\n<ul>\n<li>Choose a species: change &quot;Building kaleim&quot; section to indicate speed of 10m =&gt; 12m</li>\n<li>Strength: heavily encumbered speed by reduced by 10m =&gt; 12m</li>\n<li>Weapons: Improvised thrown weapon, range: 6/18m =&gt; 8/24m</li>\n<li>Weapons: Light improvised thrown weapons, range: 10/30m =&gt; 12/36m</li>\n</ul>\n<h3>Species</h3>\n<ul>\n<li>drell: 12m =&gt; 14m</li>\n<li>elcor: 6m =&gt; 8m</li>\n<li>vorcha: 14m =&gt; 16m</li>\n<li>everything else: 10m =&gt; 12m</li>\n<li>note: hanar currently have 12m walking speed with contra-gravitic levitation, this will remain at 12m. Additionally, hanar were meant to have a walking speed of 0 meters, but the rules were ambiguous about this. We've specifically stated that their walking speed is 0 meters, they gain a walking speed via the Contra-gravitic levitation device.</li>\n<li>note: volus have a speed of 10m.  this will remain (it makes sense since they are small)</li>\n</ul>\n<h3>Vehicles</h3>\n<ul>\n<li>mantis gunship: fire damage to 10m =&gt; 12m radius sphere</li>\n<li>m-44 hammerhead: hovers over the battlefield at 30 =&gt; 36 an hour</li>\n</ul>\n",
    "id": "1-3-1",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Upcoming Species rework",
    "description": "Welcoming feedback!",
    "date": "2021-11-07T00:00:00.000Z",
    "image": "https://static.wikia.nocookie.net/masseffect/images/a/a5/Council_ME3.png",
    "html": "<h2>Upcoming Changes and Feedback</h2>\n<p>The next thing the development team is working on is reviewing the species. This work will cover the following:</p>\n<ol>\n<li>Reviewing each species and making changes as necessary</li>\n<li>Adding new species</li>\n<li>Making the species' traits fully functioning in the Character Builder</li>\n<li>Adding more Species-based feats</li>\n<li>Updating the Paragon/Renegade rules</li>\n<li>Adding Paragon/Renegade feats</li>\n<li>Updating the PDF (as it has become very out of date)</li>\n</ol>\n<br>\n<p>We'd like to get community input as we work on this content update (a process we'd like to continue as we work on other\ncontent updates). Currently we have the first round of species updates and the new paragon/renegade rules ready for review.\nYou can find all of the content in this public Google Drive folder</p>\n<h3><a href=\"https://drive.google.com/drive/folders/13xZHAI4YL65ZHd6Kp3bzTleLDjX3XcZC?usp=sharing\" target=\"_blank\">Species Update (Round 1)</a></h3>\n<h3>Feedback</h3>\n<p>If you'd like to leave feedback, you've got a few options:</p>\n<ol>\n<li>Use the <a href=\"https://forms.gle/M7p6Ffcvcnkf5KnGA\" target=\"_blank\">feedback form</a></li>\n<li>Alternatively, if you want to have discussions with other community members, you can use the <strong>#closed-play-testing</strong>\nchannel on <a href=\"https://discord.gg/c2UnqkH\" target=\"_blank\">Discord</a></li>\n</ol>\n<br>\n<p><em>While you can certainly leave feedback on the #closed-play-testing channel, we recommend this channel be\nreserved for discussions rather than specific recommendations or criticisms, simply because its difficult to gather feedback\nby scrolling through messages.</em></p>\n<h2>Bug Fixes</h2>\n<v-alert value type=\"info\"><p>Shoutout to Kael the Adventurer for making a long list of typos and needed clarifications</p>\n</v-alert><ul>\n<li>Correctly updated the Lucky feat to have 3 uses per long rest</li>\n<li>Changed &quot;Distracting Performance&quot; on the Musical Performance proficiency to target &quot;sentient&quot; creatures instead of &quot;humanoids&quot;</li>\n<li>Removed the &quot;When you cast this at 2nd level, &quot; clause on Unity: Shield Restore Advancement. It already is a 2nd level power.</li>\n<li>Any and all typos that have been pointed out on Discord or in Kael's document. If you'd like to see all of my responses\nto the questions and suggestions Kael pointed out, <a href=\"https://docs.google.com/document/d/1SjmEVd4Q-bDgobQj_gOK75NqJLGTVqW5/edit\" target=\"_blank\">you can read them here</a>.</li>\n</ul>\n",
    "id": "1-3-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "Species Rework: Round 2",
    "description": "Ready for playtesting and feedback",
    "date": "2021-12-14T00:00:00.000Z",
    "image": "https://static.wikia.nocookie.net/masseffect/images/e/e0/Codex_MEA_-_Krogan_Biology_%2B_main.png",
    "html": "<h2>Upcoming Changes and Feedback, Round 2</h2>\n<p>As per the last post, we're working on reviewing the species. We've finished are initial review of the rest of the\nspecies and are ready for community feedback. Highlights to this round of updates includes:</p>\n<ol>\n<li>New Species: Kett, Unshackled AI, and Yahg</li>\n<li>Over 30 species-specific feats!</li>\n</ol>\n<h3><a href=\"https://drive.google.com/drive/folders/1NgQFcImx8ubtsSXb8zyliWBWm1rokc3W?usp=sharing\" target=\"_blank\">Species Update (Round 2)</a></h3>\n<br>\n<h3>Feedback</h3>\n<p>If you'd like to leave feedback, you've got a few options:</p>\n<ol>\n<li>Use the Round 2 <a href=\"https://forms.gle/ezJzzo424x8tMfQV6\" target=\"_blank\">feedback form</a></li>\n<li>Alternatively, if you want to have discussions with other community members, you can use the <strong>#closed-play-testing</strong>\nchannel on <a href=\"https://discord.gg/c2UnqkH\" target=\"_blank\">Discord</a></li>\n</ol>\n<br>\n<p><em>While you can certainly leave feedback on the #closed-play-testing channel, we recommend this channel be\nreserved for discussions rather than specific recommendations or criticisms, simply because its difficult to gather feedback\nby scrolling through messages.</em></p>\n<h2>Next Steps &amp; What's not happening</h2>\n<ol>\n<li>As we gather feedback, I'll begin coding the changes for the website and character builder. The goal is to have\nall feats and species traits fully functioning in the character builder.</li>\n<li>We want to release this content as quickly as possible, so I am not going to work on a PDF update for the next release.\nInstead, as soon as the species rework is live, I'll focus on updating the printable PDF.</li>\n<li>We decided to forego Paragon and Renegade feats because the new P/R system might need tweaking after its been live.</li>\n</ol>\n<h2>Bug Fixes</h2>\n<ul>\n<li>Added the heavy weapon charges back to the display (incorrectly lost in the 1.3.1 update)</li>\n<li>Fixed a typo in the Adept powercasting &quot;Powers Known&quot; section. The example previous had the wrong level mentioned.</li>\n<li>Added a missing DC to the Reaper Harvester's cannon attack.</li>\n</ul>\n",
    "id": "1-3-3",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v1.4.0",
    "description": "Species, Reputation, Accounts, and more!",
    "date": "2022-02-21T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/a/a8/Prologue_Lazarus_2.jpg/revision/latest/scale-to-width-down/1000?cb=20100703161236",
    "html": "<h2>Highlights</h2>\n<ul>\n<li>New species, updated species, and subspecies! <em>You will have to update your species selection for your characters.</em></li>\n<li>Online character sheet quality of life improvements</li>\n<li>New Reputation (Paragon/Renegade) Rules</li>\n<li>Account system (allows for saving character sheets and bookmarks)</li>\n</ul>\n<h2>Rules</h2>\n<h3>Charisma changes</h3>\n<p>The new Reputation (paragon/renegade) system uses Charisma as your &quot;Reputation Ability&quot;, which, like a\npowercasting ability, sets the DC of your benefits and can increase the number of uses per rest. To accommodate this change,\nCharisma was removed as a powercasting ability from Asari and Sentinels.</p>\n<p>The other reason for this change is because the debate over which classes should use which powercasting ability has\nbeen constant. This homebrew will be entering its fifth year in April, and\nthe feedback for a better way to divvy up Charisma and Wisdom between biotic-capable classes has never ended. The reason\nto use Wisdom instead of Charisma as the biotic ability is purely based on the fact that there is a new ruleset (Reputation)\nwhich is better suited for Charisma than Wisdom.</p>\n<p>That said, if you completely disagree and think the designers are making a horrible decision, not a problem!\nYou can decide which classes should use which abilities! The online character builder even allows you to override which\nmental stat you want to use for every class. You think engineers should use Wisdom? Great! Go for it!</p>\n<p>Finally, if you're homebrewing your own unique class and want it to use Charisma, that's completely fine too! We'd only ask that your\njustification for using Charisma be because Charima casting fits the theme of the class and not because this system lacks Charisma casters.</p>\n<h3>Unarmed Strikes count as weapons</h3>\n<p>This is a change from the official 5e ruleset. We believe this will help reduce confusion about unarmed strikes in general.\nPrior to this change, a &quot;natural&quot; weapon was not treated as a weapon for the purposes of any other rules referring to a\n&quot;weapon attack&quot; or &quot;melee weapon&quot; (as it is ruled in standard 5e). With the increase in natural weapons among species,\nwe have decided to remove this counterintuitive rule.</p>\n<p>However, note that you cannot &quot;wield&quot; nor &quot;hold&quot; a natural weapon (i.e. w/ bite, you can't hold your own teeth). Therefore,\nif a rule indicates a &quot;weapon you are wielding&quot; or a &quot;weapon your are holding&quot;, it cannot be applied to a natural weapon.</p>\n<h3>Reputation</h3>\n<p>A new set of Reputation (Paragon/Renegade) rules can be found under the Beyond 1st Level section of the rules. Our intent\nis that these rules are not &quot;Variant&quot; (i.e., they are meant to be used in your campaign). But, of course, that's just\na recommendation.</p>\n<h2>Classes</h2>\n<h3>Sentinel</h3>\n<ul>\n<li>Removed Charisma as an option for powercasting (see note above)</li>\n</ul>\n<h2>Races</h2>\n<h3>Natural Armor &amp; Player Feedback</h3>\n<p>In this update, a number of species received a version of Natural Armor (i.e., when you aren't wearing armor, your AC is X + some mod).\nMany players expressed their dislike of this type of trait, claiming this system rarely sees player characters outside of armor.\nWhile that is true, the internal balancing done for the species gave natural armor little to no weight and we've kept these traits for world building purposes.\n<em>Your</em> campaign may never see an unarmored elcor fighting alongside an unarmored salarian, but in the event that <em>someone's</em>\ncampaign results in this example, we want to make sure that elcor has a higher AC, as representative of their thick hide.</p>\n<h3>Custom Ability Score Increases</h3>\n<p>The other most common piece of feedback was to use the Ability Score Increase rules outlined in &quot;Customizing Your Origin&quot;\nsection of <em>Tasha's Caldron of Everything</em>. After internal discussions, we decided that the rules of this homebrew\nwill remain as an archetypal approach to ability score increases. Our justification is that D&amp;D 5e is a general high\nfantasy ruleset that can be applied in any high fantasy campaign setting (Faerun just being one of the hundreds of high\nfantasy settings with very specific archetype's for its races). Comparatively, Mass Effect is both a ruleset and a\ncampaign setting, therefore the archetypes are relatively universal across campaigns.</p>\n<p>That said, we also support these types of rule divergences when people want to use them.\nThus, when you make a character in the online character sheet, you have the option of toggling these rules on or off.</p>\n<h3>Angara</h3>\n<ul>\n<li>Changed Ability Score Increases to +2 CON and +1 WIS. The +2 CON reflects their ability to live in harsh environments\nlike extreme heat and cold. The +1 WIS for their spirituality. The current +2 CHA seems odd given that\nThe angara as a people are very free with their emotions, demonstrative and larger than life. They'll say and do\nwhat they mean, even if it entails violence</li>\n<li>Bio-electric focus was replaced with Electrogenesis. This was more of a preparatory change for later content updates.</li>\n<li>Bio-electric ward. Removed the +1 AC and added cold resistance. Noted that resistance is only applied to hit points, rather than not shields</li>\n<li>Solar dependency. Noted that the energy source must be UV radiation, not specifically sunlight.\n<ul>\n<li>Post playtest/feedback change: In addition, added a clause that the solar dependency was &quot;in addition&quot; to food and water. It was asked if the immersion in light needed to happen all at once\nor could it happen over short periods throughout the day. The same could be asked about drinking water or eating food, so\nuse whatever rules you use for adjudicating food and water consumption.</li>\n</ul>\n</li>\n</ul>\n<h3>Asari</h3>\n<ul>\n<li>Base species receives +1 WIS</li>\n<li>Added 3 subspecies called Life Stages\n<ul>\n<li>Post playtest/feedback change: Matriarchs gain +1 Wis and +1 Int (the +2 Wis resulted in a +3 wis at 1st level)</li>\n<li>Post playtest/feedback change: Matriarchs gain a choice of expertise, rather than a set expertise</li>\n</ul>\n</li>\n<li>Innate Biotics: removed the CHA powercasting mod replacement. Wisdom is your powercasting modifier for the selected powers.</li>\n<li>Mind Meld: Solidified the mechanics of this trait, works similarly to Detect Thoughts</li>\n<li>Refactored Ardat-Yakshi Variant (which has its own 3 subspecies and one variant)\n<ul>\n<li>Post playtest/feedback change: Clarified DC of Addition saving throws resets after you successfully mate</li>\n<li>Post playtest/feedback change: Added Mental Resilience trait to Chaste subspecies</li>\n</ul>\n</li>\n</ul>\n<h3>Awakened Collector</h3>\n<ul>\n<li>Awakened collectors will have their own species, rather than being a variant of Protheans</li>\n<li>Chitinous Exoskeleton updated to reflect natural armor, rather than a flat bonus</li>\n<li>Forewing Leap replaced with Wings that allows a flying speed for the turn only</li>\n<li>Seeker Swarm updated to better represent ME3 multiplayer and have a bit more functionality. The summoned swarms were ineffective at higher levels and more of a nuisance causing additional dice rolls.</li>\n</ul>\n<h3>Batarians</h3>\n<ul>\n<li>Ability Score Increase changed to +1 to all ability scores. This was primarily done because Batarians balance score\nwas falling behind most other species. Additionally, the &quot;concept&quot; for Batarians is to be the other side of the same coin\nas humans. This is represented more in the new species-specific feats, in which Batarians and Humans share a common set of\nfeats.</li>\n</ul>\n<h3>Drell</h3>\n<ul>\n<li>Prior to feedback we added +1 Str to Drell to both bring their balance scores inline with other species and reflect their wiry strength.\nPost playtest/feedback we removed the +1 Str and added the Body and Soul trait</li>\n<li>Natural Hunters: Added acrobatics to the list of skill choices</li>\n</ul>\n<h3>Elcor</h3>\n<ul>\n<li>Prior to feedback we added another +1 Str to Elcor (giving them +3) but added a -1 Dex\nPost playtest/feedback we decided no species should have a negative starting modifier. Thus both the +1 Str and -1 Dex were removed.</li>\n<li>Added Dense Build with a small addition to the standard 5e version which interacts with powers like singularity and pull.</li>\n<li>Remove the powerful build mechanics from Quadrupedal (as that part of quadrupedal is now it's own trait, Dense Build), otherwise Quadrupedal is unchanged.</li>\n<li>Shoulder Mounts replaced with Tripedal Combat. It was odd that this species required gear to simply fire weapons. This codifies how the elcor would fight without gear.\n<ul>\n<li>See below, 4 new armor mods were added to keep the flair of shoulder mounts.</li>\n</ul>\n</li>\n<li>Thick Hide does not stack with armor, it is standard 5e version of Natural Armor.</li>\n<li>Add Keen Olfactory Sensory since it is a unique trait for elcor.</li>\n</ul>\n<h3>Geth</h3>\n<ul>\n<li>Added Mobile Platform as subspecies\n<ul>\n<li>Post playtest/feedback change: For Juggernauts, we removed the -1 Dex, reduced +2 AC to +1 AC, and added Jump-Start Aura</li>\n</ul>\n</li>\n<li>Base ability score is +2 Int, as subclasses add other ability score increases</li>\n<li>Speed is based on the mobile platform selection</li>\n<li>Removed Hunter Mode, Innate Shielding, Armor Mods, and No Feats</li>\n<li>Living Construct renamed Synthetic Construct with\n<ul>\n<li>Bulleted benefits/detriments</li>\n<li>Lightning vulnerability added</li>\n<li>Stabilization check for synthetic added to this trait (removed from repair matrix)</li>\n</ul>\n</li>\n<li>Sentry Mode broken out from the old Living Construct</li>\n<li>Integrated Protection updated to reflect the published version used in 5e (was previously the UA version for warforged)</li>\n<li>Advanced Optics Added</li>\n<li>Repair Matrix simplified</li>\n</ul>\n<h3>Hanar</h3>\n<ul>\n<li>Changed +1 CHA to +1 INT, their speech patterns and supposed aloofness made it difficult to justify the +1 CHA</li>\n<li>Added a minor falling reduction benefit to the contra-gravitic levitation</li>\n<li>Removed fragile</li>\n<li>Broke Tentacles into two separate traits: Tentacles and Tentacle Bind for better clarity and utility.</li>\n</ul>\n<h3>Human</h3>\n<ul>\n<li>Added 2 skill proficiencies, 1 expertise, and 1 tool proficiency to the base human to make them more balanced to\nother species and their own variant.</li>\n</ul>\n<h3>Kett</h3>\n<ul>\n<li>Kett have been reworked from the initial playtest content\n<ul>\n<li>Added the four main subspecies representing the known Kett types in Andromeda</li>\n<li>Added a Behemoth variant</li>\n<li>Updated Exalted Lineage to incorporate resistances, immunitites, and senses instead of proficiencies. This change\nis more representative of the exaltation process, as kett keep beneficial traits and proficiencies are generally learned,\nnot biological.</li>\n</ul>\n</li>\n</ul>\n<h3>Krogan</h3>\n<ul>\n<li>Menacing removed. Though justifiable, Krogan have the most codex-official biological traits, and we wanted to focus on those.</li>\n<li>Post playtest/feedback change: We had added a new trait, Wide-set Eyes, but it was removed as other traits were more beneficial and lore representative.</li>\n<li>Toughness (post playtext/feedback) will remain!</li>\n<li>Added a Natural Armor trait.</li>\n<li>Extremophile replaced with Nutrient Hump which extends time between needed food and water, but removes the bonus to Con saving throws to resist exhaustion.</li>\n<li>Thick Frontal Plate (i.e., the Krogan Headbutt) is now available for all Krogan.</li>\n<li>Blood Rage overhauled to better represent the codex entry:  krogan become totally unresponsive to pain and will fight to the death regardless of injury level\n<ul>\n<li>Post playtest/feedback change: Blood rage is less of a risk than it was in the playtest content. While in Blood Rage, you\ngain a &quot;pool&quot; of death saving throws and you only assess whether or not your character dies when blood rage ends.</li>\n</ul>\n</li>\n<li>Tank-Bred added as a variant\n<ul>\n<li>Post playtest/feedback change\n<ul>\n<li>Blind rage was adjusted to work more like a curse (to offset the number of benefits Tank Bred krogan receive)</li>\n<li>Genetic Deficiency was removed. We felt the potency of blind rage was enough to offset Tank Bred's benefits.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>Prothean</h3>\n<ul>\n<li>Removed +1 Dex from Ability Score Increase. The additional +1s come from the Avatar subspecies (though not ALL subspecies have a +1)</li>\n<li>All-Seeing Eyes changed to only have an effect when you take the Search action. We felt blanket truesight was a bit too powerful</li>\n<li>Quad-Strand DNA removed</li>\n<li>Added Avatar as a subspecies</li>\n<li>A No Avatar variant added for those who either want to avoid the new Avatar subspecies or dont want to RP an Avatar.</li>\n</ul>\n<h3>Quarian</h3>\n<ul>\n<li>Ability Score increase changed from +1 Dex and +1 Int to +1 Con and +1 Int. Other than the oft-mentioned maladjusted immune systems,\nthe quarians have surprisingly robust physiology. Grunt's tank imprints specifically deem several species soft and easy to kill, but not quarians</li>\n<li>Cerebral =&gt; Mind Shielding Unit: Updated the mechanic to specifically indicate charmed and frightened conditions.</li>\n<li>Cerebral =&gt; Scientific Aptitude:  allows choice of 2 skills and added history as a skill option</li>\n<li>Muscular =&gt; Ability Score Increase: can choose Strength or Dexterity</li>\n<li>Visceral =&gt; Instead of +2 Con (which resulted in +3 con at 1st level), added Toughness</li>\n</ul>\n<h3>Salarian</h3>\n<ul>\n<li>High-Speed Metabolism clarified (before there was confusion about how long a long rest took)</li>\n<li>Photographic Memory simplified and expanded to include any information seen or read.</li>\n<li>Twice as Bright buffed to allow a minor bonus to rolls for the skills/tools learned from it</li>\n<li>Lystheni added as a variant</li>\n</ul>\n<h3>Turian</h3>\n<ul>\n<li>+1 Strength removed from Ability Score Increase, third +1 can be found in the Military Doctrine subspecies</li>\n<li>Six Military Doctrine Subspecies added, with the following post playtest/feedback changes\n<ul>\n<li>Combat Officer: added the option of proficiency in perception or insight</li>\n<li>Demolitions: Removed thunder resistance</li>\n<li>Infantry: Esprit de Corps has been limited to once per turn.</li>\n<li>Recon: Expanded recon to incorporate the various types of recon (field, force, and special).</li>\n</ul>\n</li>\n</ul>\n<h3>Unshackled AI</h3>\n<ul>\n<li>Unshackled AI are now their own species (rather than a Geth variant) with 3 subspecies</li>\n<li>Post playtest/feedback change: Base species receives +2 Int instead of +1</li>\n</ul>\n<h3>Volus</h3>\n<ul>\n<li>Power Armor Training added to give Volus a minor combat buff.\n<ul>\n<li>Post playtest/feedback change: the &quot;ignore STR requirements of armor&quot; has been changed to &quot;your speed is not reduced by wearing armor&quot;</li>\n</ul>\n</li>\n<li>Lucky changed from the Feat version of to the trait version.</li>\n</ul>\n<h3>Vorcha</h3>\n<ul>\n<li>Adaptation treated as a subspecies</li>\n<li>Additions/changes to the existing adaptations are as follows:\n<ul>\n<li>Desert: Can go twice as long without food or water instead of ignoring 1 level of exhaustion.</li>\n<li>Frozen: Advantage on exhaustion saving throws due to cold added.</li>\n<li>Volcanic: Advantage on exhaustion saving throws due to heat added.</li>\n<li>High-gravity: Ignore difficult terrain caused by high-gravity.</li>\n<li>Underground: Advantage on hiding when in darkness</li>\n</ul>\n</li>\n</ul>\n<h3>Yahg</h3>\n<ul>\n<li>Yahg added as a new species</li>\n</ul>\n<h2>Feats</h2>\n<ul>\n<li>Added 34 new feats, 33 of which have species prerequisites.</li>\n<li>Post playtest/feedback changes:\n<ul>\n<li>Base Hunter Mode was removed. Instead, there are 3 Hunter Mode feats which no longer require having learned Hunter Mode as a prerequisite</li>\n<li>Determination is available for Quarians (in addition to Humans and Batarians)</li>\n<li>Fast Learned is available for Salarians (in addition to Humans and Batarians)</li>\n<li>The Kett's Premium Genetics an Gene-Splicing were combined. In addition to gaining a trait from the species, you also\ngain an ability score increase.</li>\n</ul>\n</li>\n</ul>\n<h2>Armor Mods</h2>\n<ul>\n<li>Four new armor mods were added to replace the lost &quot;Shoulder Mounts&quot; for Elcor.</li>\n</ul>\n<h2>Powers</h2>\n<ul>\n<li>Concussive Shot: Clarified this power requires a ranged weapon</li>\n<li>Turbocharge: Clarified this power requires a ranged weapon</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Updated the following powercasting to Wisdom: Adjutant, Banshee, Collector General, Eclipse Commando, Eclipse Vanguard, N7 Paladin</li>\n</ul>\n<h2>Site Features</h2>\n<h3>Account System</h3>\n<p>You can now create an account on n7.world. Our policies can be found in the footer of the homepage. With an account...</p>\n<ul>\n<li>Your bookmarks and characters will be saved on our server so you can access them on other devices</li>\n<li>You'll be able to share characters with other people who also have accounts. When other people view your character they will not be able to edit it.</li>\n<li>You can have up to 20 characters on a single account. Any additional characters you make will be stored locally (won't be saved on our servers).</li>\n<li>If you don't want to make an account, you can still create characters as normal. You'll just need to export/import them to other devices.</li>\n</ul>\n<p>This new account system is a huge step up in infrastructure for us, so we are just dipping our toes in it for now. But this\ndoes pave the way for more modern features like campaign management, streaming dice rolls, and community homebrew.</p>\n<h3>Online Character Sheet</h3>\n<h4>Important notes</h4>\n<ul>\n<li><em>You will need to reselect your species and traits!</em> With the huge change to species, it was impossible to migrate\nthings that didn't exist in v1.3.1 (for example, Asari lifestages)</li>\n<li><em>You should reselect your powers!</em> The Manage Powers menu now supports preparing/learning powers on a per class basis. You will see\nall of your v1.3.1 powers listed in an &quot;Unlinked Powers&quot; menu. They will show up in your powers list, but we recommend you move these to their associated class.</li>\n</ul>\n<h4>New Features</h4>\n<ul>\n<li>Skill check and saving throw advantages, disadvantages, and bonuses from Feats and Traits are now displayed</li>\n<li>Conditions, Immunities, Resistances, and Vulnerabilities are now displayed</li>\n<li>New Reputation Tracker</li>\n<li>Initiative bonus is shown instead of barrier ticks (barrier ticks are easily seen next to the hit point tracker)</li>\n<li>Better display of Attacks, Actions, Bonus Actions, Reactions, and Other abilities</li>\n<li>Special attacks like Burst Fire, Two-Weapon Fighting, and Double Tap now appear in their appropriate section and show potential weapons to use</li>\n<li>When multiclassing, if you have more than one powercasting modifier, all will show up in the powers section</li>\n<li>In the settings menu, you can override which powercasting ability you want to use</li>\n<li>Features and Traits moved into its own tab</li>\n<li>Settings moved below the proficiencies block</li>\n</ul>\n<h2>What's next</h2>\n<p>The content developers will be reviewing weapons, armor, mods, and gear. We <em>know</em> that we want to expand melee weapons and melee weapon types. Changes to anything else is\nstill in early discussions. Depending on the scope of these changes, we may break them out into two different releases.</p>\n<p>What about an updated PDF? Sadly, there are too many other competing priorities and this continues to be pushed down the list.\nCreating the original PDF was a huge project and its difficult to justify making a new version knowing that a lot of changes will be happening\nthis year. Devs are discussing workarounds but nothing has come to fruition.</p>\n",
    "id": "1-4-0",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "2022 Roadmap",
    "description": "A look at what's to come this year.",
    "date": "2022-04-03T00:00:00.000Z",
    "image": "https://data.n7.world/images/misc/v140-roadmap.jpg",
    "html": "<h2>April Fools</h2>\n<p>Thanks for humoring us yesterday. We know April Fools jokes can be a bit tiring but we hope you got a minor chuckle.\nIf anyone missed the April Fools content, <nuxt-link to=\"/changelog/april-fools-2022\">you can find it here</nuxt-link>.</p>\n<h2>2022 Roadmap</h2>\n<p><strong>NOTE!</strong> The timelines listed below are &quot;best case scenarios.&quot; There is a lot of web development involved in the upcoming\ncontent and we only have two web developers who both have full-time jobs. In addition, one of the developers is the creator (me/I)\nand I have to juggle bugs and content ideas/editing. I'm very committed to delivering these features as soon as possible,\nbut there are only so many hours in the day.</p>\n<h3>Targeted Rules clean-up</h3>\n<p><em>Release: Ongoing</em></p>\n<p>Starting today, well begin polling the community for potential problem areas. The content moderators will review\nsubmissions and work on targeted updates, batching the updates into smaller, more manageable releases. This work will\nbe ongoing and updates will all fall into the v1.4.X range of releases. If a change is disruptive enough to warrant a\nversion bump, we will do so. If that happens, we will pre-release the changes as playtest content so we can get feedback.</p>\n<p>However, the goal of these targeted updates is <em>not</em> to make sweeping changes. Instead, we want to focus on smaller tweaks\nand fixing long-standing issues.</p>\n<p><em>So what is a problem area?</em></p>\n<p>Problem areas confusing, broken, outdated, or any other issue about the system that weve heard from multiple players\nand GMs. Some notorious examples are:</p>\n<ul>\n<li>Concussive shot is overpowered and needs some tweaking</li>\n<li>Catapult: Salvo advancement makes absolutely no sense</li>\n<li>Some armor set bonuses are too powerful to be considered uncommon items (for example, Maverick armor)</li>\n</ul>\n<p>We will consider any suggestion provided by the community, but issues will be prioritized by:</p>\n<ul>\n<li><strong>Frequency of reports</strong>\n<ul>\n<li>The more people report a problem the higher the priority</li>\n</ul>\n</li>\n<li><strong>Specificity of the feedback</strong>\n<ul>\n<li>More specific feedback (i.e., clearly outlined problems with supporting reasons) will have a higher priority than generalized statements</li>\n</ul>\n</li>\n<li><strong>Scope</strong>\n<ul>\n<li>Smaller, more targeted changes will take priority over changes that would change numerous rules and mechanics</li>\n</ul>\n</li>\n<li><strong>Development Requirements</strong>\n<ul>\n<li>Changes that require significant development to the website and/or character sheet wont necessarily have a higher or lower priority but may take longer to release</li>\n</ul>\n</li>\n</ul>\n<p>If you would like to submit your thoughts, ideas, and/or areas where youve experienced problems <a href=\"https://forms.gle/XxyMKYarrSGf4DKaA\" target=\"_blank\">you can do so via this form</a> (which is also now available on the about page).</p>\n<p>Please keep your suggestions limited to the rules/content of the system and not the website or online character builder/sheet.\nAdditionally, we are already working on a vehicle rules redesign so we ask that you hold your suggestions for that\ncontent until it is released.</p>\n<h3>New Vehicle Rules</h3>\n<p><em>Release: TBD</em></p>\n<p>New vehicle rules are being designed and playtested by the discord moderator team. They will be shared out to the\ncommunity once we feel they are ready for public playtesting. Then they will be added to the website. We currently do\nnot have a proposed timeline for this work as it will happen concurrently with everything else on this list.</p>\n<h3>Character Sheet improvements</h3>\n<p><em>Release: By the end of Q2</em></p>\n<p>The website developers will be focusing on making the character sheet fully functional for all system needs. It will include (but is not limited to):</p>\n<ul>\n<li>Class features</li>\n<li>Power Damage &amp; Higher Level casting</li>\n<li>Weapon Mods</li>\n<li>Armor Set Bonuses</li>\n<li>Armor Mods</li>\n<li>A death saving throw interface</li>\n<li>Inspiration</li>\n<li>Better character level management</li>\n</ul>\n<h3>Community Homebrew</h3>\n<p><em>Release: Starting in Q3 and hopefully finished by the end of the year</em></p>\n<p>This feature will focus on allowing community homebrew submissions to the site and letting other players use that\nhomebrew in their own campaigns. Because each model (e.g., species, classes, weapons, etc) requires its own unique\ndevelopment, the following list will be rolled out over the course of Q3 and likely into Q4. The list is presented\nin alphabetical order (not in release order). The current plan is to start with something &quot;simpler&quot; like weapons\nthen dive right into classes and subclasses (but no promises).</p>\n<ul>\n<li>Armor</li>\n<li>Backgrounds</li>\n<li>Bestiary</li>\n<li>Classes and Subclasses</li>\n<li>Feats</li>\n<li>Gear (grenades, omni-tool programs, heavy weapons, and other miscellany)</li>\n<li>Mods (weapons &amp; armor)</li>\n<li>Species, Variant species, and  Subspecies</li>\n<li>Powers</li>\n<li>Vehicles</li>\n<li>Weapons</li>\n</ul>\n<h3>Rules PDF</h3>\n<p><em>Release: Q3</em></p>\n<p>This feature will allow players to cherry pick rules from the system and export into a markdown file, which can then\nbe copy and pasted into Homebrewery (which can then be downloaded as a PDF). Thus, instead of maintaining an official\nPDF, we want users to be able to create their own unique PDFs that fit their needs. Though we want to get to this\nfeature earlier, we also want players to be able to include homebrew in their custom PDFs. Therefore, we are holding\noff on this feature until some of the homebrew models are completed.</p>\n<h3>Campaign Management</h3>\n<p><em>Release: Q4</em></p>\n<p>Finally, we will work on modern campaign management features similar to those found in other online TTRPG systems like\nRoll20 and DnDBeyond. Campaign management primarily entails:</p>\n<ul>\n<li>Creating a campaign and allowing other players to associate their character with the campaign</li>\n<li>A special GM roll for a user, which grants them edit rights to associated character sheets</li>\n<li>An encounter builder/runner for the GM roll</li>\n<li>A campaign roll log</li>\n</ul>\n<h2>Updated Road to Version 2</h2>\n<p>Once all of the above is complete, the creator (me/I), will take a step back from Version 1 and hand over rules\nmaintenance/governance to the capable discord moderators. I will still be around to make website updates and provide\ninput to rule changes, but I wont actively be designing anything for it.</p>\n<p>Instead, my focus will shift to designing a Version 2. For years, Ive had a grand vision for this system, but many of\nmy designs are not cohesive with Version 1 and, in some cases, will likely upset current players. Therefore, at\nsome point I will release a Version 2, but it will live alongside Version 1. Much like you can set whether or not you\nwant to use metric or imperial measurements, the website will allow you to choose your preferred version.</p>\n<p>As I work towards this goal, I will release playtesting materials for community feedback and the current content team\ncan be as involved as they want in the design process (though they may prefer to work on Version 1 instead).</p>\n<p>Not everything will change so the two versions will be mostly compatible (which will, hopefully, reduce questions and\nconfusion in community discussions). The major changes for Version 2 will be:</p>\n<h3>Classes &amp; Subclasses Overhaul</h3>\n<p>Instead of cherry picking from existing D&amp;D classes, I am working on 6 completely unique classes and, at minimum, 5\nunique subclasses for each.</p>\n<h3>New Powercasting System</h3>\n<p>My plan a year ago was to re-skin the D&amp;D spell library into ME lore and expand the power slots to 9 levels. Instead,\nIve been designing an entirely new powercasting system that, I think, better represents the ME games.</p>\n<h3>Weapons &amp; Armor Overhaul</h3>\n<p>We were planning on doing a weapons and armor overhaul for Version 1, but felt that it ultimately would nerf too many\ncurrent players (i.e. there was too much change involved). Therefore, some ideas from this work may make it into\nVersion 1, but the majority of this work will be reserved for Version 2.</p>\n",
    "id": "1-4-1-a",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v1.4.1",
    "description": "Adept update and character sheet improvements",
    "date": "2022-05-15T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/0/01/Noveria_Benezia_Using_Her_Biotics.png/revision/latest/scale-to-width-down/1000?cb=20100307070147",
    "html": "<h1>v1.4.1</h1>\n<h2>Highlights</h2>\n<ul>\n<li>Numerous character sheet improvements, including class feature integrations and power damage</li>\n<li>Adepts significantly buffed</li>\n</ul>\n<h2>Rules</h2>\n<ul>\n<li>Multiclassing can no longer <em>reduce</em> your maximum number of barrier ticks.</li>\n</ul>\n<h2>Classes</h2>\n<h3>Adept</h3>\n<p><em>One of the most consistent pieces of feedback we have received over the past year (or more) is that adepts are <em>the</em> most\nunderpowered class in this homebrew. The changes below represent a significant buff to the class; and, therefore, the\ndev team felt that it wasn't necessary to keep the v1.4.0 version.</em></p>\n<p><em>In summary, the commando subclass was incorporated into the base subclass. The commando's features felt the most &quot;adept-y&quot;\nand brought the boost in power that the devs were looking for. The commando subclass was conceptually rewritten\nto reflect the games' commandos, bringing both biotics and weaponry into combat.</em></p>\n<p><em>While there were discussions about reviewing the other 2 subclasses, the dev team decided we would rather get this update\nout and work on subclasses (as a whole) at a later date.</em></p>\n<h4>Base Class</h4>\n<ul>\n<li>3rd level, Biotic Aptitude lets adepts add their powercasting mod to all biotic damage. This effectively replaces Dark and\nPure biotics from the Disruptor and Commando subclasses, respectively.</li>\n<li>7th level, Expert Biotics (gain power slots of lower level when you cast a power) was moved from commando subclass to the base class.</li>\n<li>11th level, Biotic Split (split a power to hit two targets) was moved from commando subclass to the base class.</li>\n<li>Biotic Mastery moved from 17th level to 15th level.</li>\n<li>Empowered Biotics (reroll 1s on damage rolls) was removed completely (previously at 17th level)</li>\n<li>Signature Biotics moved from 20th level to 18th level</li>\n<li>New capstone, Unmatched Biotics, increases Wisdom by 4 and Wisdom maximum to 24.</li>\n</ul>\n<h4>Commando Subclass</h4>\n<ul>\n<li>Effectively a new subclass focusing on mixing weapon combat and biotics.</li>\n</ul>\n<h4>Disruptor</h4>\n<ul>\n<li>Dark Biotics updated to be a penalty to affected creatures' saving throws (previous feature's bonus damage is effectively\nincluded the new 3rd-level Biotic Aptitude)</li>\n</ul>\n<h3>Engineer</h3>\n<h4>Drone Jockey</h4>\n<ul>\n<li>Combined drone's bond and drone companion features into a single feature. Simply a housekeeping change, no actual changes to those features.</li>\n</ul>\n<h3>Sentinel</h3>\n<ul>\n<li>Changed Quick Cast to Extra Attack and one of the attacks can now be used to cast a cantrip. This change was made to help with the overabundance of bonus actions for sentinels.</li>\n</ul>\n<h3>Vanguard</h3>\n<h4>Battle Master</h4>\n<ul>\n<li>Lift Attack (Biotic Maneuver). Clarified that the lifted condition lasts until the end of your next turn.</li>\n<li>Biotic Focus (6th level feature). Changed from &quot;double your walking speed&quot; to a 12 meter increase in walking speed. This was mainly done for housekeeping purposes but also to prevent confusion on if the &quot;double&quot; applied to other bonuses.</li>\n</ul>\n<h4>Shock Trooper</h4>\n<ul>\n<li>Stunning Strike (6th level feature). Clarified when you &quot;deal damage&quot; with charge (instead of &quot;hit&quot;), as charge is not an attack roll.</li>\n</ul>\n<h2>Powers</h2>\n<ul>\n<li>Removed the +powercasting modifier to damage on the 4 powers where it existed as it overlapped with the new Adept feature, Biotic Aptitude. This applies to the following powers:\n<ul>\n<li>Biotic Orbs</li>\n<li>Dark Sphere</li>\n<li>Lance</li>\n<li>Warp</li>\n</ul>\n</li>\n<li>Barrier Detonation: fixed a typo. Now indicates that the range is a 2m-<em>radius</em> sphere</li>\n<li>Catapult: The salvo advancement has finally been replaced and need never be discussed again.</li>\n<li>Concussive shot was nerfed as we have had numerous reports of it being way too overpowered.</li>\n<li>Cryo Beam level fixed (was listed at 2nd level should have been 3rd)</li>\n<li>Added correct higher level cast times for Pull (30 minutes at 4th level, 1 hours at 5th level)</li>\n</ul>\n<h2>Bestiary</h2>\n<ul>\n<li>Corrected the Blue Suns Pyro CR to 1 (instead of 1/4)</li>\n</ul>\n<h2>Site Features</h2>\n<h3>Character Sheet Improvements</h3>\n<ul>\n<li>Powers are now &quot;castable&quot; (main improvement is showing the upcast changes)</li>\n<li>Power damage shown on the sheet</li>\n<li>Improve power management interface</li>\n<li>Numerous &quot;more information&quot; panels were moved to a right-hand pane (instead of a pop-up dialog)</li>\n<li>Activating barrier is now moved into the Actions section. The button below the barrier tick tracker now rolls the barrier tick die</li>\n<li>Tech Armor has its own health pool</li>\n<li>Some features now are &quot;toggle-able&quot;, which applies the correct benefits (such as AC, bonuses to attack, etc) when the feature is toggled on.</li>\n</ul>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Barrier uses will now reset on a short rest</li>\n<li>Multiclassing will no longer make your power slots disappear</li>\n<li>STG Training (Feat) now properly applies its bonus to sleight of hand</li>\n</ul>\n",
    "id": "1-4-1-b",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "v1.4.1",
    "description": "Adept update and character sheet improvements",
    "date": "2022-05-15T00:00:00.000Z",
    "image": "https://vignette.wikia.nocookie.net/masseffect/images/0/01/Noveria_Benezia_Using_Her_Biotics.png/revision/latest/scale-to-width-down/1000?cb=20100307070147",
    "html": "<ul>\n<li>\n<p>all terrain exe +5 changed to advantage</p>\n</li>\n<li>\n<p>mines, changed from ranged weapon to weapon attack roll</p>\n</li>\n<li>\n<p>deflector array, removed riot shield restriction</p>\n</li>\n<li>\n<p>double time changed to flat +30ft/12m speed increase</p>\n</li>\n<li>\n<p>added DC to experimental barrier generator</p>\n</li>\n<li>\n<p>expert hand changed to advantage</p>\n</li>\n<li>\n<p>updated proximity mine. removed disarm check, changed to increasing perception check</p>\n</li>\n<li>\n<p>quantum displacer, removed omni-gel cost</p>\n</li>\n<li>\n<p>thermic-overvent, removed omni-gel cost</p>\n</li>\n<li>\n<p>sticky grenade range changed to 30ft/12m</p>\n</li>\n<li>\n<p>adept changed potent biotics to any power, not just limited to necrotic damage</p>\n</li>\n<li>\n<p>armor slot clarification (medi-gel, grenades, thermal clips)</p>\n</li>\n<li>\n<p>gyroscope (always gains +2 (instead of +1 only if already having the thrown))</p>\n</li>\n<li>\n<p>extended grip (always gains two-handed and reach and versatile)</p>\n</li>\n</ul>\n<p>cs improvements</p>\n<ul>\n<li>grenades, medi-gel, personal shield generator, and specific programs levels</li>\n<li>&quot;custom armor&quot; change (individual pieces)</li>\n<li>mod effects now apply</li>\n<li>armor effects now apply</li>\n<li>equipped gear applies</li>\n<li>new side-nav interface for: equipment, long/short rests</li>\n<li>manage equipped megi-gel, grenades, and thermal clips</li>\n<li>equipment seller and break down</li>\n</ul>\n<p>cs changes</p>\n<ul>\n<li>new character side nav</li>\n<li>short &amp; long rest moved to menu (large and mobile)</li>\n<li>settings moved to side nav</li>\n<li>new preferences</li>\n</ul>\n",
    "id": "1-4-2",
    "url": "/changelog/undefined"
  },
  {
    "layout": "post",
    "title": "The Bestest Update Eva!!!",
    "description": "I'm Commander Shepard, and this is my favorite update on the Citadel",
    "date": "2022-04-02T00:00:00.000Z",
    "image": "https://data.n7.world/images/af-2022/cmf.jpg",
    "html": "<h1>v100.N7.314</h1>\n<h2>Rules</h2>\n<p>No more complicated modifiers and checking for proficiencies. Flat d20 rolls until someone beats the other 5 times.</p>\n<p>We found that the process of making an attack roll needed some tweaking. Please proceed through the following 127 page flowchart. [LINK REDACTED. SITE CAN'T HANDLE TERABYTES]</p>\n<p>Credits have been changed to ShepCoin!</p>\n<h2>Classes</h2>\n<p>Adepts were deemed too weak. So now they gain the Extra Attack feature at 2nd level, then again at every level after\nthe 2nd for a total of 20 attacks per action at 20th level.</p>\n<p>The first inclusion of a community homebrew subclass has been added! Though there are lots of other submissions, we decided that\nonly the top-of-the-line submissions will be available, which means only one was added. Say hello to the Dominatrix Adept!</p>\n<p>New 20th level capstone for Engineers: &quot;Your power exceeds that of the devs, you become the GM&quot;</p>\n<p>We've continually seen rhetoric that the Tech Point system is too confusing, so we're getting rid of it entirely. You\ncan now cast what you have memorized for the day, at will, at any level!</p>\n<p>&quot;Power&quot; slots have been reverted to &quot;Spell&quot; slots. No reason necessary to be given.</p>\n<p>The Soldier's Havoc subclass has been renamed: MR. TORGUE'S SUPER AWESOME EXPLOSION SOLDIER</p>\n<h2>Species</h2>\n<p>New Species! Halo's &quot;Elites&quot; are now a species due to popular demand.</p>\n<p>All synthetic species can only speak either UwU or l33tsp34k</p>\n<p>We brought Sexy back! Remember, the thorough &quot;bangable-ness&quot; of species research was not done by our team, you <a href=\"https://www.polygon.com/2017/3/20/14980436/mass-effect-sexiest-character-aliens-ranked\" target=\"_blank\">can thank Polygon</a>.</p>\n<p>All species images have been updated with amazing new concept art! (See at the bottom of this page)</p>\n<h2>Feats</h2>\n<p>Ritual caster is now a feat. No ritual powers will be available besides <em>praising the sun</em> and <em>praising Grunt</em>.</p>\n<h2>Weapons</h2>\n<p>Weapons that were supposed to be scaling with the Arcane stat werent doing so properly. Should be fixed now.</p>\n<h2><s>Heavy</s> Thicc and Chonky Weapons</h2>\n<p>&quot;Heavy weapons&quot; renamed to &quot;Thicc and Chonky weapons&quot; to reduce confusion with the Heavy property</p>\n<p>Targeting was proving to be quite a hot topic many times, so we changed it to the following: <strong>If you've been able to\nmaintain Targeting for 1 minute with your heavy weapon, you instantly win the combat encounter with nothing left of the enemy except a mushroom cloud</strong></p>\n<h2>Vehicles</h2>\n<p>The vehicle/starship combat was too confusing with the amount of different actions we had, so we changed it to just shooting back and forth at one another until one falls. Pew pew!</p>\n<h2>Powers</h2>\n<p>New Powers:</p>\n<ul>\n<li>Transmute Ohio</li>\n<li>Greater Baja Blast</li>\n</ul>\n<p>People loved the Catapult: Salvo advancement so much, we've made it the only advancement available for every power (don't tell spageddy)</p>\n<p>Mod team agrees: Concussive Shot needed to change. It now deals 20d8 damage per shot.</p>\n<h2>Site Features</h2>\n<p>The NPC Generator has been reverted back to the Grunt Generator and now only generates pictures of Grunt.</p>\n<h2>New Species Images</h2>\n<h4>Angara</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/angara.jpg\" />\n</v-card></p>\n<h4>Asari</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/asari.jpg\" />\n</v-card></p>\n<h4>Awakened Collector</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/awakened-collector.jpg\" />\n</v-card></p>\n<h4>Batarian</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/batarian.jpg\" />\n</v-card></p>\n<h4>Drell</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/drell.jpg\" />\n</v-card></p>\n<h4>Elcor</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/elcor.jpg\" />\n</v-card></p>\n<h4>Geth</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/geth.jpg\" />\n</v-card></p>\n<h4>Hanar</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/hanar.jpg\" />\n</v-card></p>\n<h4>Human</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/human.jpg\" />\n</v-card></p>\n<h4>Kett</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/kett.jpg\" />\n</v-card></p>\n<h4>Krogan</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/krogan.jpg\" />\n</v-card></p>\n<h4>Prothean</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/prothean.jpg\" />\n</v-card></p>\n<h4>Quarian</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/quarian.jpg\" />\n</v-card></p>\n<h4>Salarian</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/salarian.jpg\" />\n</v-card></p>\n<h4>Turian</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/turian.jpg\" />\n</v-card></p>\n<h4>Unshackled AI</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/unshackled-ai.jpg\" />\n</v-card></p>\n<h4>Volus</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/volus.jpg\" />\n</v-card></p>\n<h4>Vorcha</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/vorcha.jpg\" />\n</v-card></p>\n<h4>Yahg</h4>\n<v-card max-width=\"300\">\n<p><v-img src=\"https://data.n7.world/images/af-2022/yahg.jpg\" />\n</v-card></p>\n",
    "id": "april-fools-2022",
    "url": "/changelog/undefined"
  }
]