[
  {
    "type": "artisan",
    "name": "Armorsmith's Workbench",
    "html": "<p>An armorsmith's workbench allows you to work with alloys and ceramic plates, letting you reshape armor for different species,\nrepair damage, or install armor mods.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining heavy and medium armor.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves heavy or medium armor.</p>\n<h3>Activities</h3>\n<p>With access to your workbench, you can perform one of the following activities as part of a long rest.</p>\n<ul>\n<li><strong>Install mod</strong>. Install an armor mod into a piece of heavy or medium armor.</li>\n<li><strong>Augment or repair armor</strong>. Adjust a suit of heavy or medium armor to fit another species or repair a piece of used\nheavy or medium armor. Repaired armor can be sold for one half its market value. Consumes 2 omni-gel.</li>\n<li><strong>Craft armor</strong>.\n<ul>\n<li>Craft a medium or heavy armor set. See the <nuxt-link to=\"/fr/manual/missions#between-missions\">crafting</nuxt-link>\nsection of downtime activities for more information.</li>\n<li>Craft a customizable piece of heavy or medium armor. See the <nuxt-link to=\"/fr/manual/equipment#custom-armor\">creating armor</nuxt-link>\nsection of armor for more information.</li>\n</ul>\n</li>\n<li><strong>Salvage an armor mod</strong>. DC 20. On a success, you can salvage 1 armor mod from a piece of heavy or medium armor. On a failure, the armor\nand all mods are destroyed.</li>\n<li><strong>Create omni-gel</strong>. Break down a piece of heavy or medium armor, gaining omni-gel equal to the amount listed on the\n<nuxt-link to=\"/fr/gear/omni-gel\">omni-gel yield table</nuxt-link>.</li>\n</ul>\n",
    "id": "armorsmiths-workbench"
  },
  {
    "type": "artisan",
    "name": "Brewer's Supplies",
    "html": "<p>Brewing is the art of producing beer, mead, wine, and liquor. Not only does brewing create alcoholic beverages, but the\nprocess of brewing purifies water. Brewing beer, mead, or wine takes weeks of fermentation, but only a few hours of work.\nYou can further distill fermented beverages to create liquor.</p>\n<p><strong>History</strong>. Proficiency with brewer's supplies gives you additional insight on Intelligence (History) checks concerning\nevents that involve alcohol as a significant element.</p>\n<p><strong>Medicine</strong>. This tool proficiency grants additional insight when you treat anyone suffering from alcohol poisoning or\nwhen you can use alcohol to dull pain.</p>\n<p><strong>Persuasion</strong>. A stiff drink can help soften the hardest heart. Your proficiency with brewer's supplies can help you ply\nsomeone with drink, giving them just enough alcohol to mellow their mood.</p>\n<p><strong>Potable Water</strong>. Your knowledge of brewing enables you to purify water that would otherwise be undrinkable. As part of\na long rest, you can purify up to 25 liters (~6.5 gallons) water, or 5 liters (~1.5 gallons) as part of a short rest.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Detect poison or impurities in a drink</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Identify alcohol</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Ignore effects of alcohol</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "brewers-supplies"
  },
  {
    "type": "artisan",
    "name": "Chemist's Supplies",
    "html": "<p>Chemists can create helpful drugs such as NSAIDs but can also create powerful concoctions of mind-altering drugs and even poisons.</p>\n<p><strong>History</strong>. Your training in chemistry can help you when you try to recall facts about drug -elated events, medical breakthroughs,\nand infamous poisonings.</p>\n<p><strong>Medicine</strong>.\nWhen you treat the victim of a disease, sickness, or poison, your knowledge grants you added insight into how to provide\nthe best care to your patient.</p>\n<p><strong>Sleight of Hand</strong>. You've learned to handle chemicals carefully, giving you an edge when interacting with\nvolatile substances.</p>\n<p><strong>Immunity</strong>. Your prolonged exposure to a variety of chemical allows you to handle and apply poisons and mind-altering drugs\nwithout risk of exposing yourself to its effects.</p>\n<p><strong>Create Drug</strong>. As part of a long rest, you may create a single poison, drug, or medicine.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Spot a poisoned object</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Identify a drug</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Know which drug caused a creature's condition</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "chemists-supplies"
  },
  {
    "type": "artisan",
    "name": "Cook's Utensils",
    "html": "<p>With a cook in your party, your meals will be much better than the typical mix of nutrient bars and protein soup.</p>\n<p><strong>History</strong>. Your knowledge of cooking techniques allows you to assess the social patterns involved in a culture's eating habits.</p>\n<p><strong>Medicine</strong>. When administering treatment, you can transform medicine that is bitter or sour into a pleasing concoction.</p>\n<p><strong>Survival</strong>. When foraging for food, you can make do with ingredients you scavenge that others would be unable to transform\ninto nourishing meals.</p>\n<p><strong>Prepare Meals</strong>. As part of a short rest, you can prepare a tasty meal that helps your companions regain their strength.\nYou and up to five creatures of your choice regain 1 extra hit point per Hit Die spent during a short rest, provided you have\naccess to your cook's utensils and low-grade provisions. If you use mid-grade provisions, gain 2 extra hit points per Hit Die\nspent. And if you use high-grade provisions, gain 3 extra hit points per Hit Die spent.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create a typical meal</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Duplicate a meal</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot poison or impurities in food</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Create a gourmet meal</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "cooks-utensils"
  },
  {
    "type": false,
    "name": "Disguise Kit",
    "html": "<p>The perfect tool for anyone who wants to engage in trickery, a disguise kit enables its owner to adopt a false identity.</p>\n<p><strong>Deception</strong>. In certain cases, a disguise can improve your ability to weave convincing lies.</p>\n<p><strong>Intimidation</strong>. The right disguise can make you look more fearsome.</p>\n<p><strong>Performance</strong>. A cunning disguise can enhance an audience's enjoyment of a performance, provided the disguise is properly\ndesigned to evoke the desired reaction.</p>\n<p><strong>Persuasion</strong>. People tend to trust a person in uniform. If you disguise yourself as an authority figure, your efforts\nto persuade others are often more effective.</p>\n<p><strong>Create Disguise</strong>. As part of a long rest, you can use 1 omni-gel to create a disguise. It takes you 1 minute to don such a disguise once you have created it.\nYou can carry only one such disguise on you at a time without drawing undue attention, unless you have something to keep them hidden.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Cover injuries or distinguishing marks</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot a disguise being used by someone else</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Copy a humanoid's appearance</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "disguise-kit"
  },
  {
    "type": false,
    "name": "Gaming Set",
    "html": "<p>Proficiency with a gaming set applies to one type of game, such as Skyllian-5 or games of chance that use dice.</p>\n<p><strong>History</strong>. Your mastery of a game includes knowledge of its history, as well as of important events it was connected\nto or prominent historical figures involved with it.</p>\n<p><strong>Insight</strong>. Playing games with someone is a good way to gain an understanding of their personality, granting you a better\nability to discern their lies from their truths and read their mood.</p>\n<p><strong>Sleight of Hand</strong>. Sleight of Hand is a useful skill for cheating at a game, as it allows you to swap pieces, palm cards,\nor alter a die roll. Alternatively, engrossing a target in a game by manipulating the components with dexterous\nmovements is a great distraction for a pickpocketing attempt.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Catch a player cheating</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Gain insight into an opponent's personality</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "gaming-set"
  },
  {
    "type": false,
    "name": "Hacking Tools",
    "html": "<p>Hacking tools are used to override security systems in order to gain access to encrypted files, open locked doors, or\nsabotage security devices such as cameras, turrets, or mechs. Proficiency with the tools also grants you a general knowledge\nof VIs, encryption techniques, and cryptography.</p>\n<p><strong>Perception</strong>. You're understanding of patterns and cryptography gives you insight when discerning information from unknown languages.</p>\n<p><strong>Investigation</strong>. You gain additional insight when utilizing networked systems (such as the exonet) to find information.</p>\n<p><strong>Fortify</strong>. Just as you can break down security, you can also fortify it. For each hour of work,\nyou can further encrypt an electronic data package, rebuff a security device, or harden a network to attack, increasing\nthe DC to hack it by 1 (maximum 5).</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Disable a security system</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Decrypt a data package</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Falsify electronic documents</td>\n<td>Varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "hacking-tools"
  },
  {
    "type": false,
    "name": "Medical Kit",
    "html": "<p>Medical Kits contain the necessary tools and supplies to triage injuries and treat diseases.</p>\n<p><strong>Insight</strong>. When you spend 1 minute observing an organic creature, you gain additional insight on if the creature is injured or weakened.</p>\n<p><strong>Investigation</strong>. When you investigate a dead organic creature, you gain insight into what caused its death and how long ago it died.</p>\n<p><strong>Medicine</strong>. You can spend a medi-gel to gain advantage when stabilizing a creature.</p>\n<p><strong>Healing Hands</strong>. During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids.\nEach creature that spends a Hit Die during this rest can forgo the roll and instead regain the maximum number of hit points the die can restore.\nA creature can do so only once per rest, regardless of how many Hit Dice it spends.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Close a wound</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Diagnose a sickness</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Craft a medicine to treat a disease</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "medical-kit"
  },
  {
    "type": "artisan",
    "name": "Musical Instrument",
    "html": "<p>Proficiency with a musical instrument indicates you are familiar with the techniques used to play it. You also have\nknowledge of some songs commonly performed with that instrument.</p>\n<p><strong>History</strong>. Your expertise aids you in recalling lore related to your instrument.</p>\n<p><strong>Performance</strong>. Your ability to put on a good show is improved when you incorporate an instrument into your act.</p>\n<p><strong>Compose a Tune</strong>. As part of a long rest, you can compose a new tune and lyrics for your instrument.</p>\n<p><strong>Distracting Performance</strong>. While performing with your instrument, you can try to distract one humanoid you can see who\ncan see and hear you. Make a Charisma (Performance) check with your instrument contested by the humanoid's Wisdom (Insight)\ncheck. If your check succeeds, you grab the humanoid's attention enough that it makes Wisdom (Perception) and\nIntelligence (Investigation) checks with disadvantage until you stop performing.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify a tune</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Improvise a tune</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "musical-instrument"
  },
  {
    "type": "artisan",
    "name": "Painter's Supplies",
    "html": "<p>Proficiency with painter's supplies represents your ability to paint and draw, design decals and paint jobs for armor and vehicles,\nand create propaganda. You also acquire an understanding of art history, which can aid you in examining works of art.</p>\n<p><strong>Insight</strong>. Your expertise allows you to glimpse the emotional states of other artists by viewing their works of art.</p>\n<p><strong>Investigation, Perception</strong>. When you inspect a painting or a similar work of visual art,\nyour knowledge of the practices behind creating it can grant you additional insight.</p>\n<p><strong>Painting and Drawing</strong>.\nAs part of a short or long rest, you can produce a simple work of art or a design for a suit of armor or vehicle. Although\nyour work might lack precision, you can capture an image or a scene, or make a quick copy of a piece of art you saw.</p>\n<p><strong>Detailing</strong>.\nWith 8 hours of work, you can detail a suit of armor. With 20 hours of work, you can detail a vehicle.\nThe detailing can provide advantages to skill checks made by the wearer of the armor or user of the vehicle, such\nas a bonus to a stealth check for camouflage designs.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Paint an accurate portrait</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Create a painting with a hidden message</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "painters-supplies"
  },
  {
    "type": "starship",
    "name": "Starship System (Drive)",
    "html": "<p>Proficiency with a starship's drive core represents your ability to maintain, repair, and improve the drive of a starship.</p>\n<p><strong>Engineering</strong>. Gain additional insight when taking the Repair, Advanced Repair, System Repair, or Restore actions\nduring starship combat.</p>\n<p><strong>Investigation</strong>. Gain additional insight when investigating power sources and engines, even if the source is alien.</p>\n<p><strong>History</strong>. Gain additional insight when recalling information about ancient or groundbreaking starship drives.</p>\n<p><strong>Repair Engine</strong>.\nWith 8 hours of work and the necessary materials, you can patch a vehicle engine. The patched engine\ncan power the vehicle for 2 days worth of range. With 20 hours of work and the necessary materials, you can\ncompletely repair a vehicle engine to a working state.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Boost starship speed by 1 for 24 hours</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Boost starship range by 1 for 24 hours</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Boost starship shields by 50 for 24 hours</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "starship-system-drive"
  },
  {
    "type": "starship",
    "name": "Starship System (EWS)",
    "html": "<p>The ability to temporarily disable maneuverability or targeting systems on a ship can be the difference between winning\nand losing a battle.</p>\n<p><strong>Electronics</strong>. Gain additional insight when taking the Sabotage or Harden checks during starship combat.</p>\n<p><strong>Investigation</strong>. Gain additional insight when recognizing or discovering malicious code within your starship system's network.</p>\n<p><strong>History</strong>. You know a variety of techniques used in cyber warfare. Gain additional insight when recalling information\nabout cybersecurity and the outcomes of hacking starship systems.</p>\n<p><strong>Countermeasures</strong>. With 8 hours of work, you can write custom algorithms that harden your starship against sabotage attacks.\nIncrease the DC of the next Sabotage action against your starship by 5.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Hack another ship's logs</td>\n<td>varies</td>\n</tr>\n<tr>\n<td>Encrypt your ship's logs</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Boost VI, add 1 to all Defer rolls</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "starship-system-ews"
  },
  {
    "type": "starship",
    "name": "Starship System (Helm)",
    "html": "<p>A Starship's helm is the pilot seat. While most ships can be piloted by VI, the pilot monitors an array of sensors\nand subroutines to optimize the ship's flight, make smooth landings, and avoid enemy fire. Pilots can also\noverride subsystems and take full control of the craft.</p>\n<p><strong>Vehicle Handling</strong>. Your ability in the pilot seat gives you additional insight when taking the Maneuver or Hard Maneuver\naction during starship combat.</p>\n<p><strong>Insight</strong>. Gain additional insight when assessing the tales of others' piloting feats.</p>\n<p><strong>Performance</strong>. Gain additional insight when using Air or Space transports or Starships to make fantastic maneuvers\nor awe-inspiring piloting feats.</p>\n<p><strong>Practiced Maneuver</strong>. Once per long rest, you can execute a practiced maneuver. Gain the benefits of a Hard Maneuver.\nCreatures on board your ship automatically succeed their Constitution saving throws.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Hastily leave orbit under duress</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Crash land</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Navigate an asteroid field or through obstacles</td>\n<td>varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "starship-system-helm"
  },
  {
    "type": "starship",
    "name": "Starship System (Navigation)",
    "html": "<p>Proficiency with a starship's navigation involves plotting courses between clusters and solar systems.</p>\n<p><strong>Investigation</strong>. You gain additional insight when reviewing flight patterns and ship's logs.</p>\n<p><strong>Survival</strong>. When your ship is on its last leg, you have a better chance of guiding it to safety. Gain additional\ninsight when you try to find safe harbor or safe planets to land.</p>\n<p><strong>Science</strong>. Your experience navigating the galaxy gives you additional insight when taking the Flee action during\nstarship combat.</p>\n<p><strong>Sleight of Hand, Acrobatics</strong>. Navigation requires an intimate knowledge of gravity, mass effect fields, trajectories, relativistic movements.\nYou gain additional insight when throwing objects or moving through zero-g environments.</p>\n<p><strong>Uncharted Course</strong>. With 8 hours of work, you can plot an uncharted course through the galaxy. You can increase\nyour range for the next 24 hours by 2.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Read an ancient star map</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Falsify manifest</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Plot a safe course through an asteroid field</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "starship-system-navigation"
  },
  {
    "type": "starship",
    "name": "Starship System (SSC)",
    "html": "<p>Proficiency with a ships SSC equipment represents your ability to quickly analyze scanning logs and make long distance telemetry\ncommunications.</p>\n<p><strong>Investigation</strong>. You can parse additional details when scanning other ships. You gain additional insight when taking\nthe Scan action during starship combat.</p>\n<p><strong>Deception, Persuasion</strong>. You have an expansive knowledge of the etiquette required to communicate with other starships.\nGain additional insight when trying to persuade or deceive other starships or space stations through comms.</p>\n<p><strong>Science</strong>. Gain additional insight when scanning unknown celestial objects for threats or valuable materials.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Recognize a sensor anomaly</td>\n<td>varies</td>\n</tr>\n<tr>\n<td>Boost communications signal</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Scramble a signal</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Improvise a communications array</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "starship-system-ssc"
  },
  {
    "type": "starship",
    "name": "Starship System (Weapons)",
    "html": "<p>Represents your ability to target and attack moving objects through space using sensors and calculations rather than sight\nor dexterity.</p>\n<p><strong>Investigation</strong>. Gain additional insight when investigating damage done by starship weapons.</p>\n<p><strong>Deception, Insight</strong>. You know how to bluff and when others are bluffing about the capabilities of their ship's weaponry.</p>\n<p><strong>Calibrate</strong>. With 8 hours of work, you can calibrate the targeting systems of your starship's weapons. You gain a\n+2 bonus to hit with Attack and Targeted Attack actions for the next 24 hours.</p>\n<p><strong>Weapon Attack</strong>. Add your proficiency bonus to attack rolls made when taking the Attack and Targeted Attack actions\nduring starship combat.</p>\n",
    "id": "starship-system-weapons"
  },
  {
    "type": "artisan",
    "name": "Tailor's Tools",
    "html": "<p>Tailor's tools allow you to work with fabrics and nano-materials to reshape armor for different species,\nrepair damage, or install armor mods.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining light armor.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves light armor.</p>\n<h3>Activities</h3>\n<p>With access to your tools, you can perform one of the following activities as part of a long rest.</p>\n<ul>\n<li><strong>Install mod</strong>. Install an armor mod into a piece of light armor.</li>\n<li><strong>Augment or repair armor</strong>. Adjust a suit of light armor to fit another species or repair a piece of light armor.\nRepaired armor can be sold for one half its market value. Consumes 2 omni-gel.</li>\n<li><strong>Craft armor</strong>.\n<ul>\n<li>Craft a light armor set. See the <nuxt-link to=\"/fr/manual/missions#between-missions\">crafting</nuxt-link>\nsection of downtime activities for more information.</li>\n<li>Craft a customizable piece of light armor. See the <nuxt-link to=\"/fr/manual/equipment#custom-armor\">creating armor</nuxt-link>\nsection of armor for more information.</li>\n</ul>\n</li>\n<li><strong>Salvage an armor mod</strong>. DC 20. On a success, you can salvage 1 armor mod from a piece of light armor. On a failure, the armor\nand all mods are destroyed.</li>\n<li><strong>Create omni-gel</strong>. Break down a piece of light armor, gaining omni-gel equal to the amount listed on the\n<nuxt-link to=\"/fr/gear/omni-gel\">omni-gel yield table</nuxt-link>.</li>\n</ul>\n",
    "id": "tailors-tools"
  },
  {
    "type": false,
    "name": "Thieves' tools",
    "html": "<p>Thieves' tools are used to <em>manually</em> disarm traps, breach security doors, and open locked containers. Criminals prefer thieves'\ntools over hacking tools because they're cheaper and more reliable. For most, trying to outsmart a security VI can be near impossible,\nbut snipping a few wires is easy if you know the right ones to cut. Proficiency with the tools also grants you a general knowledge\nof traps, security systems, and locks.</p>\n<p><strong>History</strong>. Your knowledge of security systems grants you insight when answering questions about locations that are renowned for their\nsecurity.</p>\n<p><strong>Investigation and Perception</strong>. You gain additional insight when looking for traps and alarms because you have learned a variety of\ncommon signs that betray their presence.</p>\n<p><strong>Set a trap</strong>. Just as you can disable traps, you can also set them. As part of a short rest, you can use 1 create a trap\nusing 1 omni-gel and any other items you have on hand. The total of your check becomes the DC for someone else's attempt to discover\nor disable the trap. The trap deals damage appropriate to the materials used in crafting it (such as poison or a weapon)\nor damage equal to half the total of your check, whichever the GM deems appropriate.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Pick a lock</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Disable alarm</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Disable a trap</td>\n<td>Varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "thieves-tools"
  },
  {
    "type": "artisan",
    "name": "Tinker's Tools",
    "html": "<p>A set of tinker's tools is designed to create small, inventive devices from omni-gel. Some examples include a motion sensor,\na desalinator, a compass, a light source, or a small EMP device.</p>\n<p><strong>History</strong>. You can determine the age and origin of objects, even if you have only a few pieces remaining from the original.</p>\n<p><strong>Investigation</strong>. When you inspect a damaged object, you gain knowledge of how it was damaged and how long ago.</p>\n<p><strong>Mending</strong>. For 1 omni-gel, you can repair a single break or tear in an object, such as a punctured tire, a cracked helmet, or a ripped pack.\nAs long as the break or tear is no larger than 30 cm (~ 1 foot) in any dimension, you mend it, leaving no trace of the former damage.</p>\n<p><strong>Repair</strong>. You can restore 10 hit points to a damaged object for 1 omni-gel and an hour of work.</p>\n<p><strong>Craft Armor or Weapon Mod</strong>. See the <nuxt-link to=\"/fr/manual/missions#between-missions\">crafting</nuxt-link> section\nof downtime activities for more information.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Temporarily repair a disabled device</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Repair an item in half the time</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Improvise a temporary item using scraps</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "tinkers-tools"
  },
  {
    "type": false,
    "name": "Vehicles",
    "html": "<p>Proficiency with a vehicle applies to one type of environment. The proficiency reflects the ability to navigate and maneuver\nwithin the environment and is not limited to a specific vehicle. For example, a hovercraft could be a land or water vehicle.</p>\n<h3>Vehicle Types</h3>\n<ul>\n<li><strong>Land</strong>: travel over solid surfaces</li>\n<li><strong>Water</strong>: travel on or through liquids</li>\n<li><strong>Air</strong>: travel <em>within</em> a planet's atmosphere</li>\n<li><strong>Space</strong>: travel in space, limited to small ships meant to travel short distances, like fighters and transports</li>\n</ul>\n<p><strong>Engineering</strong>. Vehicle proficiency combined with knowledge of engineering improves your ability to repair, maintain,\nor assess vehicles of that type.</p>\n<p><strong>Insight</strong>. Your knowledge about vehicles of this type makes it easy to discern the veracity of others' boasts about their piloting\nskills and past stunts.</p>\n<p><strong>Investigation</strong>. You gain insight into the environment's conditions and the safety of traveling within the conditions.</p>\n<p><strong>Pilot's Luck</strong>. If your vehicle crashes while you are driving it, you and your passengers take half damage from the crash.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Drive the vehicle through difficult conditions</td>\n<td>varies</td>\n</tr>\n<tr>\n<td>Make a complicated maneuver</td>\n<td>varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "vehicles"
  },
  {
    "type": "artisan",
    "name": "Weaponsmith's Workbench",
    "html": "<p>A weaponsmith's workbench allows you to customize, craft, and repair weapons.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining weapons.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves weapons.</p>\n<h3>Activities</h3>\n<p>With access to your workbench, you can perform one of the following activities as part of a long rest.</p>\n<ul>\n<li><strong>Install mod</strong>. Install a weapon mod to a weapon.</li>\n<li><strong>Repair weapon</strong>. Repair a used weapon to a pristine condition. Repaired weapons can be sold for one half their market value. Consumes 2 omni-gel.</li>\n<li><strong>Craft weapon</strong>. See the <nuxt-link to=\"/fr/manual/missions#between-missions\">crafting</nuxt-link> section of downtime activities for more information.</li>\n<li><strong>Salvage a weapon mod</strong>. DC 20. On a success, you can salvage 1 weapon mod from a weapon. On a failure, the weapon\nand all mods are destroyed.</li>\n<li><strong>Customize a weapon</strong>. Customize a weapon, consuming 10 omni-gel and applying one of the following improvements.\nA customized weapon becomes Special and any installed mods are removed.\n<ul>\n<li>2 additional heat</li>\n<li>increase normal range by 50%</li>\n<li>+1 damage</li>\n<li>+1 to hit on attack rolls</li>\n</ul>\n</li>\n<li><strong>Create omni-gel</strong>. Break down a weapon, gaining omni-gel equal to the amount listed on the <nuxt-link to=\"/fr/gear/omni-gel\">omni-gel yield table</nuxt-link>.</li>\n</ul>\n",
    "id": "weaponsmiths-workbench"
  }
]